instance 1ab5c9fc100
class BlueprintFunctionLibrary public : Object
{
	// Fields

};


instance 1ab5c9fbc80
class SoundBase public : Object
{
	// Fields
	SoundClass* SoundClassObject; // 0x28
	bool bDebug; // 0x30
	bool bOverrideConcurrency; // 0x30
	bool bOutputToBusOnly; // 0x30
	bool bHasDelayNode; // 0x30
	bool bHasConcatenatorNode; // 0x30
	bool bBypassVolumeScaleForPriority; // 0x30
	EVirtualizationMode VirtualizationMode; // 0x31
	SetProperty ConcurrencySet; // 0x88 property 0x1ab71165f60 hash 0xb0194396
	SoundConcurrencySettings ConcurrencyOverrides; // 0xd8
	float Duration; // 0xf8
	float MaxDistance; // 0xfc
	float TotalSamples; // 0x100
	float Priority; // 0x104
	SoundAttenuation* AttenuationSettings; // 0x108
	SoundModulation Modulation; // 0x110
	SoundSubmix* SoundSubmixObject; // 0x120
	TArray SoundSubmixSends; // 0x128
	SoundEffectSourcePresetChain* SourceEffectChain; // 0x138
	TArray BusSends; // 0x140
	TArray PreEffectBusSends; // 0x150

};


instance 1ab5c9facc0
class ActorComponent public : Object
{
	// Fields
	ActorComponentTickFunction PrimaryComponentTick; // 0x30
	TArray ComponentTags; // 0x60
	TArray AssetUserData; // 0x70
	bool bReplicates; // 0x84
	bool bNetAddressable; // 0x84
	bool bAutoActivate; // 0x85
	bool bIsActive; // 0x86
	bool bEditableWhenInherited; // 0x86
	bool bCanEverAffectNavigation; // 0x86
	bool bIsEditorOnly; // 0x86
	EComponentCreationMethod CreationMethod; // 0x88
	MulticastSparseDelegateProperty OnComponentActivated; // 0x89 property 0x1ab712f1a00 hash 0xece81129
	MulticastSparseDelegateProperty OnComponentDeactivated; // 0x8a property 0x1ab712f1b80 hash 0xece81129
	TArray UCSModifiedProperties; // 0x90

	// Functions
	ToggleActive 0x3e045 hash 6361d743 params:(  );
	SetTickGroup 0x3e03e hash 8d5f65c9 params:( ETickingGroup NewTickGroup; );
	SetTickableWhenPaused 0x3e032 hash 7e7bbc04 params:( None bTickableWhenPaused; );
	SetIsReplicated 0x3e029 hash d1be052a params:( None ShouldReplicate; );
	SetComponentTickInterval 0x3e01c hash e4aa3994 params:( None TickInterval; );
	SetComponentTickEnabled 0x3e00f hash e8f12eba params:( None bEnabled; );
	SetAutoActivate 0x3e006 hash 705e83fb params:( None bNewAutoActivate; );
	SetActive 0x3e000 hash 6cb1e72d params:( None bNewActive;None bReset; );
	RemoveTickPrerequisiteComponent 0x3dfef hash ccf05993 params:( ActorComponent PrerequisiteComponent; );
	RemoveTickPrerequisiteActor 0x3dfe0 hash a4a684b9 params:( Actor PrerequisiteActor; );
	ReceiveTick 0x2222c hash 2a96f4d3 params:( None DeltaSeconds; );
	ReceiveEndPlay 0x22209 hash 3a1b8675 params:( EEndPlayReason EndPlayReason; );
	ReceiveBeginPlay 0x221f7 hash a4ab8b03 params:(  );
	OnRep_IsActive 0x3dfd8 hash 4c71e540 params:(  );
	K2_DestroyComponent 0x3dfcd hash 8a83e1be params:( Object Object; );
	IsComponentTickEnabled 0x3dfc1 hash 416bb96a params:( None ReturnValue; );
	IsBeingDestroyed 0x3dfb8 hash fd535499 params:( None ReturnValue; );
	IsActive 0x3dfb3 hash dc27ddd params:( None ReturnValue; );
	GetOwner 0x3dfae hash 751e67d0 params:( Actor ReturnValue; );
	GetComponentTickInterval 0x3dfa1 hash 31b8a708 params:( None ReturnValue; );
	Deactivate 0x3df9b hash 9d90ffdf params:(  );
	ComponentHasTag 0x3df92 hash d5318ff0 params:( None Tag;None ReturnValue; );
	AddTickPrerequisiteComponent 0x3df83 hash 2470fa4e params:( ActorComponent PrerequisiteComponent; );
	AddTickPrerequisiteActor 0x3df76 hash d6b5fff4 params:( Actor PrerequisiteActor; );
	Activate 0x3df71 hash 5374ac56 params:( None bReset; );
};


instance 1ab5c9faf00
class SceneComponent public : ActorComponent
{
	// Fields
	WeakObjectProperty PhysicsVolume; // 0xb8 property 0x1ab71345d80 hash 0x24388009
	SceneComponent* AttachParent; // 0xc0
	FName AttachSocketName; // 0xc8
	TArray AttachChildren; // 0xd0
	TArray ClientAttachedChildren; // 0xe0
	Vector RelativeLocation; // 0x11c
	Rotator RelativeRotation; // 0x128
	Vector RelativeScale3D; // 0x134
	Vector ComponentVelocity; // 0x140
	bool bComponentToWorldUpdated; // 0x14c
	bool bAbsoluteLocation; // 0x14c
	bool bAbsoluteRotation; // 0x14c
	bool bAbsoluteScale; // 0x14c
	bool bVisible; // 0x14c
	bool bHiddenInGame; // 0x14c
	bool bShouldBeAttached; // 0x14c
	bool bShouldSnapLocationWhenAttached; // 0x14d
	bool bShouldSnapRotationWhenAttached; // 0x14d
	bool bShouldUpdatePhysicsVolume; // 0x14d
	bool bBoundsChangeTriggersStreamingDataRebuild; // 0x14d
	bool bUseAttachParentBound; // 0x14d
	BYTE Mobility; // 0x14f
	BYTE DetailMode; // 0x150
	MulticastSparseDelegateProperty PhysicsVolumeChangedDelegate; // 0x151 property 0x1ab71344880 hash 0xece81129

	// Functions
	ToggleVisibility 0x3e2c9 hash 5896b60f params:( None bPropagateToChildren; );
	SnapTo 0x3e2c5 hash d178d0da params:( SceneComponent InParent;None InSocketName;None ReturnValue; );
	SetWorldScale3D 0x3e2bc hash 74b03a38 params:( Vector NewScale; );
	SetVisibility 0x3e2b4 hash a9e0aaf9 params:( None bNewVisibility;None bPropagateToChildren; );
	SetShouldUpdatePhysicsVolume 0x3e2a5 hash 2f547cfe params:( None bInShouldUpdatePhysicsVolume; );
	SetRelativeScale3D 0x3e29b hash 9e3b5c2c params:( Vector NewScale3D; );
	SetMobility 0x3e294 hash e597035a params:( EComponentMobility NewMobility; );
	SetHiddenInGame 0x3e28b hash 68a1122e params:( None NewHidden;None bPropagateToChildren; );
	SetAbsolute 0x3e284 hash 11e06bb0 params:( None bNewAbsoluteLocation;None bNewAbsoluteRotation;None bNewAbsoluteScale; );
	ResetRelativeTransform 0x3e278 hash 501864e0 params:(  );
	OnRep_Visibility 0x3e26f hash a0e3f3b0 params:( None OldValue; );
	OnRep_Transform 0x3e266 hash a8a21124 params:(  );
	OnRep_AttachSocketName 0x3e25a hash c638c027 params:(  );
	OnRep_AttachParent 0x3e250 hash de40cce7 params:(  );
	OnRep_AttachChildren 0x3e245 hash 78a24386 params:(  );
	K2_SetWorldTransform 0x3e23a hash 96af4b51 params:( Transform NewTransform;None bSweep;HitResult SweepHitResult;None bTeleport; );
	K2_SetWorldRotation 0x3e22f hash 2ab47ce5 params:( Rotator NewRotation;None bSweep;HitResult SweepHitResult;None bTeleport; );
	K2_SetWorldLocationAndRotation 0x3e21f hash 94854531 params:( Vector NewLocation;Rotator NewRotation;None bSweep;HitResult SweepHitResult;None bTeleport; );
	K2_SetWorldLocation 0x3e214 hash 7981ccee params:( Vector NewLocation;None bSweep;HitResult SweepHitResult;None bTeleport; );
	K2_SetRelativeTransform 0x3e207 hash 194ec0c5 params:( Transform NewTransform;None bSweep;HitResult SweepHitResult;None bTeleport; );
	K2_SetRelativeRotation 0x3e1fb hash 8bc113d9 params:( Rotator NewRotation;None bSweep;HitResult SweepHitResult;None bTeleport; );
	K2_SetRelativeLocationAndRotation 0x3e1e9 hash f6bd1ba5 params:( Vector NewLocation;Rotator NewRotation;None bSweep;HitResult SweepHitResult;None bTeleport; );
	K2_SetRelativeLocation 0x3e1dd hash da8e63e2 params:( Vector NewLocation;None bSweep;HitResult SweepHitResult;None bTeleport; );
	K2_GetComponentToWorld 0x3e1d1 hash 7cb6b4df params:( Transform ReturnValue; );
	K2_GetComponentScale 0x3e1c6 hash 2a5533dc params:( Vector ReturnValue; );
	K2_GetComponentRotation 0x3e1b9 hash 7db2f804 params:( Rotator ReturnValue; );
	K2_GetComponentLocation 0x3e1ac hash cc80480d params:( Vector ReturnValue; );
	K2_DetachFromComponent 0x3e1a0 hash 9601f131 params:( UnderlyingType LocationRule;UnderlyingType RotationRule;UnderlyingType ScaleRule;None bCallModify; );
	K2_AttachToComponent 0x3e195 hash 73e206cc params:( SceneComponent Parent;None SocketName;UnderlyingType LocationRule;UnderlyingType RotationRule;UnderlyingType ScaleRule;None bWeldSimulatedBodies;None ReturnValue; );
	K2_AttachTo 0x3e18e hash f5957f59 params:( SceneComponent InParent;None InSocketName;EAttachLocation AttachType;None bWeldSimulatedBodies;None ReturnValue; );
	K2_AddWorldTransform 0x3e183 hash 2b1654e params:( Transform DeltaTransform;None bSweep;HitResult SweepHitResult;None bTeleport; );
	K2_AddWorldRotation 0x3e178 hash f7accb42 params:( Rotator DeltaRotation;None bSweep;HitResult SweepHitResult;None bTeleport; );
	K2_AddWorldOffset 0x3e16e hash 12301e39 params:( Vector DeltaLocation;None bSweep;HitResult SweepHitResult;None bTeleport; );
	K2_AddRelativeRotation 0x3e162 hash b1a116 params:( Rotator DeltaRotation;None bSweep;HitResult SweepHitResult;None bTeleport; );
	K2_AddRelativeLocation 0x3e156 hash 4f7ef11f params:( Vector DeltaLocation;None bSweep;HitResult SweepHitResult;None bTeleport; );
	K2_AddLocalTransform 0x3e14b hash fe0531f1 params:( Transform DeltaTransform;None bSweep;HitResult SweepHitResult;None bTeleport; );
	K2_AddLocalRotation 0x3e140 hash 35980f85 params:( Rotator DeltaRotation;None bSweep;HitResult SweepHitResult;None bTeleport; );
	K2_AddLocalOffset 0x3e136 hash c4e775bc params:( Vector DeltaLocation;None bSweep;HitResult SweepHitResult;None bTeleport; );
	IsVisible 0x3e130 hash 2485bccf params:( None ReturnValue; );
	IsSimulatingPhysics 0x3e125 hash 12346ae1 params:( None BoneName;None ReturnValue; );
	IsAnySimulatingPhysics 0x3e119 hash 43b2a769 params:( None ReturnValue; );
	GetUpVector 0x3e112 hash 37fc5d3d params:( Vector ReturnValue; );
	GetSocketTransform 0x3e108 hash bb96deea params:( None InSocketName;ERelativeTransformSpace TransformSpace;Transform ReturnValue; );
	GetSocketRotation 0x3e0fe hash cebb815e params:( None InSocketName;Rotator ReturnValue; );
	GetSocketQuaternion 0x3e0f3 hash 2dd60394 params:( None InSocketName;Quat ReturnValue; );
	GetSocketLocation 0x3e0e9 hash 1d88d167 params:( None InSocketName;Vector ReturnValue; );
	GetShouldUpdatePhysicsVolume 0x3e0da hash 10048472 params:( None ReturnValue; );
	GetRightVector 0x3e0d2 hash e42dab96 params:( Vector ReturnValue; );
	GetRelativeTransform 0x3e0c7 hash dac93a7d params:( Transform ReturnValue; );
	GetPhysicsVolume 0x3e0be hash 788da600 params:( PhysicsVolume ReturnValue; );
	GetParentComponents 0x3e0b3 hash 731acdb5 params:( Parents Parents; );
	GetNumChildrenComponents 0x3e0a6 hash d6c3da44 params:( None ReturnValue; );
	GetForwardVector 0x3e09d hash d0b49dcd params:( Vector ReturnValue; );
	GetComponentVelocity 0x3e092 hash 6e8f5287 params:( Vector ReturnValue; );
	GetChildrenComponents 0x3e086 hash 61297114 params:( None bIncludeAllDescendants;Children Children; );
	GetChildComponent 0x3e07c hash 6b79551c params:( None ChildIndex;SceneComponent ReturnValue; );
	GetAttachSocketName 0x3e071 hash 26c13f24 params:( None ReturnValue; );
	GetAttachParent 0x3e068 hash 71ef5564 params:( SceneComponent ReturnValue; );
	GetAllSocketNames 0x3e05e hash 6963097b params:( ReturnValue ReturnValue; );
	DoesSocketExist 0x3e055 hash 3284ff06 params:( None InSocketName;None ReturnValue; );
	DetachFromParent 0x3e04c hash 6218b98c params:( None bMaintainWorldPosition;None bCallModify; );
};


instance 1ab5c9fa600
class SoundEffectPreset public : Object
{
	// Fields

};


instance 1ab5c9fa840
class SoundEffectSourcePreset public : SoundEffectPreset
{
	// Fields

};


instance 1ab5c9f8200
class SoundEffectSubmixPreset public : SoundEffectPreset
{
	// Fields

};


instance 1ab5c9fd300
class MaterialExpression public : Object
{
	// Fields
	Material* Material; // 0x28
	MaterialFunction* Function; // 0x30
	bool bIsParameterExpression; // 0x38

};


instance 1ab5c9fd540
class MaterialExpressionTextureBase public : MaterialExpression
{
	// Fields
	Texture* Texture; // 0x40
	BYTE SamplerType; // 0x48
	bool IsDefaultMeshpaintTexture; // 0x49

};


instance 1ab5c9fd780
class MaterialExpressionTextureSample public : MaterialExpressionTextureBase
{
	// Fields
	ExpressionInput Coordinates; // 0x50
	ExpressionInput TextureObject; // 0x64
	ExpressionInput MipValue; // 0x78
	ExpressionInput CoordinatesDX; // 0x8c
	ExpressionInput CoordinatesDY; // 0xa0
	ExpressionInput AutomaticViewMipBiasValue; // 0xb4
	BYTE MipValueMode; // 0xc8
	BYTE SamplerSource; // 0xc9
	bool AutomaticViewMipBias; // 0xca
	BYTE ConstCoordinate; // 0xcb
	int ConstMipValue; // 0xcc

};


instance 1ab5c9fd9c0
class MaterialExpressionTextureSampleParameter public : MaterialExpressionTextureSample
{
	// Fields
	FName ParameterName; // 0xd0
	Guid ExpressionGUID; // 0xd8
	FName Group; // 0xe8

};


instance 1ab5c9fdc00
class MaterialExpressionTextureSampleParameter2D public : MaterialExpressionTextureSampleParameter
{
	// Fields

};


instance 1ab5c9fca00
class Actor public : Object
{
	// Fields
	ActorTickFunction PrimaryActorTick; // 0x28
	bool bHidden; // 0x58
	bool bNetTemporary; // 0x58
	bool bNetStartup; // 0x58
	bool bOnlyRelevantToOwner; // 0x58
	bool bAlwaysRelevant; // 0x58
	bool bReplicateMovement; // 0x58
	bool bTearOff; // 0x58
	bool bExchangedRoles; // 0x58
	bool bNetLoadOnClient; // 0x59
	bool bNetUseOwnerRelevancy; // 0x59
	bool bRelevantForNetworkReplays; // 0x59
	bool bRelevantForLevelBounds; // 0x59
	bool bReplayRewindable; // 0x59
	bool bAllowTickBeforeBeginPlay; // 0x59
	bool bAutoDestroyWhenFinished; // 0x59
	bool bBlockInput; // 0x59
	bool bCanBeDamaged; // 0x5a
	bool bCollideWhenPlacing; // 0x5a
	bool bFindCameraComponentWhenViewTarget; // 0x5a
	bool bGenerateOverlapEventsDuringLevelStreaming; // 0x5a
	bool bIgnoresOriginShifting; // 0x5a
	bool bEnableAutoLODGeneration; // 0x5a
	bool bIsEditorOnlyActor; // 0x5a
	bool bActorSeamlessTraveled; // 0x5a
	bool bReplicates; // 0x5b
	bool bCanBeInCluster; // 0x5b
	bool bAllowReceiveTickEventOnDedicatedServer; // 0x5b
	bool bActorEnableCollision; // 0x5c
	bool bActorIsBeingDestroyed; // 0x5c
	EActorUpdateOverlapsMethod UpdateOverlapsMethodDuringLevelStreaming; // 0x5d
	EActorUpdateOverlapsMethod DefaultUpdateOverlapsMethodDuringLevelStreaming; // 0x5e
	BYTE RemoteRole; // 0x5f
	RepMovement ReplicatedMovement; // 0x60
	float InitialLifeSpan; // 0x94
	float CustomTimeDilation; // 0x98
	RepAttachment AttachmentReplication; // 0xa0
	Actor* Owner; // 0xe0
	FName NetDriverName; // 0xe8
	BYTE Role; // 0xf0
	BYTE NetDormancy; // 0xf1
	ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0xf2
	BYTE AutoReceiveInput; // 0xf3
	int InputPriority; // 0xf4
	InputComponent* InputComponent; // 0xf8
	float NetCullDistanceSquared; // 0x100
	int NetTag; // 0x104
	float NetUpdateFrequency; // 0x108
	float MinNetUpdateFrequency; // 0x10c
	float NetPriority; // 0x110
	Pawn* Instigator; // 0x118
	TArray Children; // 0x120
	SceneComponent* RootComponent; // 0x130
	TArray ControllingMatineeActors; // 0x138
	TArray Layers; // 0x150
	WeakObjectProperty ParentComponent; // 0x160 property 0x1ab71568f00 hash 0x24388009
	TArray Tags; // 0x168
	MulticastSparseDelegateProperty OnTakeAnyDamage; // 0x178 property 0x1ab71569000 hash 0xece81129
	MulticastSparseDelegateProperty OnTakePointDamage; // 0x179 property 0x1ab71569080 hash 0xece81129
	MulticastSparseDelegateProperty OnTakeRadialDamage; // 0x17a property 0x1ab71569100 hash 0xece81129
	MulticastSparseDelegateProperty OnActorBeginOverlap; // 0x17b property 0x1ab71569180 hash 0xece81129
	MulticastSparseDelegateProperty OnActorEndOverlap; // 0x17c property 0x1ab71569200 hash 0xece81129
	MulticastSparseDelegateProperty OnBeginCursorOver; // 0x17d property 0x1ab71569280 hash 0xece81129
	MulticastSparseDelegateProperty OnEndCursorOver; // 0x17e property 0x1ab71569300 hash 0xece81129
	MulticastSparseDelegateProperty OnClicked; // 0x17f property 0x1ab71569380 hash 0xece81129
	MulticastSparseDelegateProperty OnReleased; // 0x180 property 0x1ab71569400 hash 0xece81129
	MulticastSparseDelegateProperty OnInputTouchBegin; // 0x181 property 0x1ab71569480 hash 0xece81129
	MulticastSparseDelegateProperty OnInputTouchEnd; // 0x182 property 0x1ab71567400 hash 0xece81129
	MulticastSparseDelegateProperty OnInputTouchEnter; // 0x183 property 0x1ab71567480 hash 0xece81129
	MulticastSparseDelegateProperty OnInputTouchLeave; // 0x184 property 0x1ab71567500 hash 0xece81129
	MulticastSparseDelegateProperty OnActorHit; // 0x185 property 0x1ab71567580 hash 0xece81129
	MulticastSparseDelegateProperty OnDestroyed; // 0x186 property 0x1ab71567600 hash 0xece81129
	MulticastSparseDelegateProperty OnEndPlay; // 0x187 property 0x1ab71567700 hash 0xece81129
	TArray InstanceComponents; // 0x1e8
	TArray BlueprintCreatedComponents; // 0x1f8

	// Functions
	WasRecentlyRendered 0x3f2e7 hash 5824f33f params:( None Tolerance;None ReturnValue; );
	UserConstructionScript 0x22233 hash b8442e64 params:(  );
	TearOff 0x3f2e2 hash 388fbdec params:(  );
	SnapRootComponentTo 0x3f2d7 hash 7003d5d1 params:( Actor InParentActor;None InSocketName; );
	SetTickGroup 0x3e03e hash 8d5f65c9 params:( ETickingGroup NewTickGroup; );
	SetTickableWhenPaused 0x3e032 hash 7e7bbc04 params:( None bTickableWhenPaused; );
	SetReplicates 0x3f2cf hash f9cf881d params:( None bInReplicates; );
	SetReplicateMovement 0x3f2c4 hash 20d84a75 params:( None bInReplicateMovement; );
	SetOwner 0x3f2bf hash 8834625c params:( Actor NewOwner; );
	SetNetDormancy 0x3f2b7 hash f79fe515 params:( ENetDormancy NewDormancy; );
	SetLifeSpan 0x3f2b0 hash 34766843 params:( None InLifespan; );
	SetActorTickInterval 0x3f2a5 hash 115d0d3a params:( None TickInterval; );
	SetActorTickEnabled 0x3f29a hash 4f2525a0 params:( None bEnabled; );
	SetActorScale3D 0x3f291 hash 5091ce69 params:( Vector NewScale3D; );
	SetActorRelativeScale3D 0x3f284 hash e17c7c25 params:( Vector NewRelativeScale; );
	SetActorHiddenInGame 0x3f279 hash e088cc7 params:( None bNewHidden; );
	SetActorEnableCollision 0x3f26c hash d8b6d3fd params:( None bNewActorEnableCollision; );
	RemoveTickPrerequisiteComponent 0x3dfef hash ccf05993 params:( ActorComponent PrerequisiteComponent; );
	RemoveTickPrerequisiteActor 0x3dfe0 hash a4a684b9 params:( Actor PrerequisiteActor; );
	ReceiveTick 0x2222c hash 2a96f4d3 params:( None DeltaSeconds; );
	ReceiveRadialDamage 0x22221 hash 315c3014 params:( None DamageReceived;DamageType DamageType;Vector Origin;HitResult HitInfo;Controller InstigatedBy;Actor DamageCauser; );
	ReceivePointDamage 0x22217 hash 2896aa91 params:( None Damage;DamageType DamageType;Vector HitLocation;Vector HitNormal;PrimitiveComponent HitComponent;None BoneName;Vector ShotFromDirection;Controller InstigatedBy;Actor DamageCauser;HitResult HitInfo; );
	ReceiveHit 0x22211 hash 2fd5d46d params:( PrimitiveComponent MyComp;Actor Other;PrimitiveComponent OtherComp;None bSelfMoved;Vector HitLocation;Vector HitNormal;Vector NormalImpulse;HitResult Hit; );
	ReceiveEndPlay 0x22209 hash 3a1b8675 params:( EEndPlayReason EndPlayReason; );
	ReceiveDestroyed 0x22200 hash 43619e7b params:(  );
	ReceiveBeginPlay 0x221f7 hash a4ab8b03 params:(  );
	ReceiveAnyDamage 0x221ee hash 90ed768f params:( None Damage;DamageType DamageType;Controller InstigatedBy;Actor DamageCauser; );
	ReceiveActorOnReleased 0x221e2 hash 34d72fe3 params:( Key ButtonReleased; );
	ReceiveActorOnInputTouchLeave 0x221d2 hash 18a8fc1e params:( ETouchIndex FingerIndex; );
	ReceiveActorOnInputTouchEnter 0x221c2 hash 182f8eaf params:( ETouchIndex FingerIndex; );
	ReceiveActorOnInputTouchEnd 0x221b3 hash 56dd328 params:( ETouchIndex FingerIndex; );
	ReceiveActorOnInputTouchBegin 0x221a3 hash 17f41ef6 params:( ETouchIndex FingerIndex; );
	ReceiveActorOnClicked 0x22197 hash a6530f2d params:( Key ButtonPressed; );
	ReceiveActorEndOverlap 0x2218b hash 22ea0e51 params:( Actor OtherActor; );
	ReceiveActorEndCursorOver 0x2217d hash e9fd8bb2 params:(  );
	ReceiveActorBeginOverlap 0x22170 hash 2c9d025f params:( Actor OtherActor; );
	ReceiveActorBeginCursorOver 0x22161 hash 7443ad00 params:(  );
	PrestreamTextures 0x3f262 hash 5ab9a27c params:( None Seconds;None bEnableStreaming;None CinematicTextureGroups; );
	OnRep_ReplicateMovement 0x3f255 hash 1d69bf4c params:(  );
	OnRep_ReplicatedMovement 0x3f248 hash ed550bd0 params:(  );
	OnRep_Owner 0x3f241 hash e6529cb3 params:(  );
	OnRep_Instigator 0x3f238 hash 11b377ac params:(  );
	OnRep_AttachmentReplication 0x3f229 hash 547127cb params:(  );
	MakeNoise 0x3f223 hash 9e6ec0a1 params:( None Loudness;Pawn NoiseInstigator;Vector NoiseLocation;None MaxRange;None Tag; );
	MakeMIDForMaterial 0x3f219 hash 24474b3 params:( MaterialInterface Parent;MaterialInstanceDynamic ReturnValue; );
	K2_TeleportTo 0x3f211 hash 1b2d7b93 params:( Vector DestLocation;Rotator DestRotation;None ReturnValue; );
	K2_SetActorTransform 0x3f206 hash f146afc2 params:( Transform NewTransform;None bSweep;HitResult SweepHitResult;None bTeleport;None ReturnValue; );
	K2_SetActorRotation 0x3f1fb hash 82c89736 params:( Rotator NewRotation;None bTeleportPhysics;None ReturnValue; );
	K2_SetActorRelativeTransform 0x3f1ec hash c861387e params:( Transform NewRelativeTransform;None bSweep;HitResult SweepHitResult;None bTeleport; );
	K2_SetActorRelativeRotation 0x3f1dd hash b016f872 params:( Rotator NewRelativeRotation;None bSweep;HitResult SweepHitResult;None bTeleport; );
	K2_SetActorRelativeLocation 0x3f1ce hash fee4487b params:( Vector NewRelativeLocation;None bSweep;HitResult SweepHitResult;None bTeleport; );
	K2_SetActorLocationAndRotation 0x3f1be hash 6c95aae2 params:( Vector NewLocation;Rotator NewRotation;None bSweep;HitResult SweepHitResult;None bTeleport;None ReturnValue; );
	K2_SetActorLocation 0x3f1b3 hash d195e73f params:( Vector NewLocation;None bSweep;HitResult SweepHitResult;None bTeleport;None ReturnValue; );
	K2_OnReset 0x2215b hash 9957dca1 params:(  );
	K2_OnEndViewTarget 0x22151 hash 9f63deb7 params:( PlayerController PC; );
	K2_OnBecomeViewTarget 0x22145 hash 777fab6b params:( PlayerController PC; );
	K2_GetRootComponent 0x3f1a8 hash b8b55c18 params:( SceneComponent ReturnValue; );
	K2_GetComponentsByClass 0x3f19b hash 73b92298 params:( Class ComponentClass;ReturnValue ReturnValue; );
	K2_GetActorRotation 0x3f190 hash f04ad0aa params:( Rotator ReturnValue; );
	K2_GetActorLocation 0x3f185 hash 3f1820b3 params:( Vector ReturnValue; );
	K2_DetachFromActor 0x3f17b hash 4210fd57 params:( UnderlyingType LocationRule;UnderlyingType RotationRule;UnderlyingType ScaleRule; );
	K2_DestroyComponent 0x3dfcd hash 8a83e1be params:( ActorComponent Component; );
	K2_DestroyActor 0x3f172 hash 621eaf64 params:(  );
	K2_AttachToComponent 0x3e195 hash 73e206cc params:( SceneComponent Parent;None SocketName;UnderlyingType LocationRule;UnderlyingType RotationRule;UnderlyingType ScaleRule;None bWeldSimulatedBodies; );
	K2_AttachToActor 0x3f169 hash ce487d72 params:( Actor ParentActor;None SocketName;UnderlyingType LocationRule;UnderlyingType RotationRule;UnderlyingType ScaleRule;None bWeldSimulatedBodies; );
	K2_AttachRootComponentToActor 0x3f159 hash 31fc8729 params:( Actor InParentActor;None InSocketName;EAttachLocation AttachLocationType;None bWeldSimulatedBodies; );
	K2_AttachRootComponentTo 0x3f14c hash 6da7dab0 params:( SceneComponent InParent;None InSocketName;EAttachLocation AttachLocationType;None bWeldSimulatedBodies; );
	K2_AddActorWorldTransform 0x3f13e hash c34415c7 params:( Transform DeltaTransform;None bSweep;HitResult SweepHitResult;None bTeleport; );
	K2_AddActorWorldRotation 0x3f131 hash edfed09b params:( Rotator DeltaRotation;None bSweep;HitResult SweepHitResult;None bTeleport; );
	K2_AddActorWorldOffset 0x3f125 hash 815ef952 params:( Vector DeltaLocation;None bSweep;HitResult SweepHitResult;None bTeleport; );
	K2_AddActorLocalTransform 0x3f117 hash be97e26a params:( Transform NewTransform;None bSweep;HitResult SweepHitResult;None bTeleport; );
	K2_AddActorLocalRotation 0x3f10a hash 2bea14de params:( Rotator DeltaRotation;None bSweep;HitResult SweepHitResult;None bTeleport; );
	K2_AddActorLocalOffset 0x3f0fe hash 341650d5 params:( Vector DeltaLocation;None bSweep;HitResult SweepHitResult;None bTeleport; );
	IsOverlappingActor 0x3f0f4 hash d44b1961 params:( Actor Other;None ReturnValue; );
	IsChildActor 0x3f0ed hash e6a6047e params:( None ReturnValue; );
	IsActorTickEnabled 0x3f0e3 hash 8625d850 params:( None ReturnValue; );
	IsActorBeingDestroyed 0x3f0d7 hash 22ab8772 params:( None ReturnValue; );
	HasAuthority 0x3f0d0 hash dfb8dd6a params:( None ReturnValue; );
	GetVerticalDistanceTo 0x3f0c4 hash 756d276d params:( Actor OtherActor;None ReturnValue; );
	GetVelocity 0x3f0bd hash 983da94 params:( Vector ReturnValue; );
	GetTransform 0x3f0b6 hash 6822c1 params:( Transform ReturnValue; );
	GetTickableWhenPaused 0x3f0aa hash b1dffdf8 params:( None ReturnValue; );
	GetSquaredDistanceTo 0x3f09f hash 87910088 params:( Actor OtherActor;None ReturnValue; );
	GetRemoteRole 0x3f097 hash 7d48ef83 params:( ENetRole ReturnValue; );
	GetParentComponent 0x3f08d hash e4752d02 params:( ChildActorComponent ReturnValue; );
	GetParentActor 0x3f085 hash 6b44f8a8 params:( Actor ReturnValue; );
	GetOwner 0x3dfae hash 751e67d0 params:( Actor ReturnValue; );
	GetOverlappingComponents 0x3f078 hash a9c1d6d2 params:( OverlappingComponents OverlappingComponents; );
	GetOverlappingActors 0x3f06d hash b4c110b8 params:( OverlappingActors OverlappingActors;Class ClassFilter; );
	GetLocalRole 0x3f066 hash 12d6e182 params:( ENetRole ReturnValue; );
	GetLifeSpan 0x3f05f hash f41de937 params:( None ReturnValue; );
	GetInstigatorController 0x3f052 hash 26df78cd params:( Controller ReturnValue; );
	GetInstigator 0x3f04a hash 623bbce9 params:( Pawn ReturnValue; );
	GetInputVectorAxisValue 0x3f03d hash 664e0c9a params:( Key InputAxisKey;Vector ReturnValue; );
	GetInputAxisValue 0x3f033 hash 296aa0c7 params:( None InputAxisName;None ReturnValue; );
	GetInputAxisKeyValue 0x3f028 hash 2a8a4eb0 params:( Key InputAxisKey;None ReturnValue; );
	GetHorizontalDotProductTo 0x3f01a hash 9660501a params:( Actor OtherActor;None ReturnValue; );
	GetHorizontalDistanceTo 0x3f00d hash ab5495bd params:( Actor OtherActor;None ReturnValue; );
	GetGameTimeSinceCreation 0x3f000 hash 8b7dcd55 params:( None ReturnValue; );
	GetDotProductTo 0x3eff7 hash d0729e10 params:( Actor OtherActor;None ReturnValue; );
	GetDistanceTo 0x3efef hash f56eee33 params:( Actor OtherActor;None ReturnValue; );
	GetComponentsByTag 0x3efe5 hash 7d02a302 params:( Class ComponentClass;None Tag;ReturnValue ReturnValue; );
	GetComponentsByInterface 0x3efd8 hash 7fbaf017 params:( Class Interface;ReturnValue ReturnValue; );
	GetComponentByClass 0x3efcd hash ddf91cc9 params:( Class ComponentClass;ActorComponent ReturnValue; );
	GetAttachParentSocketName 0x3efbf hash 187bb9ce params:( None ReturnValue; );
	GetAttachParentActor 0x3efb4 hash 33e0d25d params:( Actor ReturnValue; );
	GetAttachedActors 0x3efaa hash 8101b76f params:( OutActors OutActors;None bResetArray; );
	GetAllChildActors 0x3efa0 hash dc0f5b8e params:( ChildActors ChildActors;None bIncludeDescendants; );
	GetActorUpVector 0x3ef97 hash 775f2bd6 params:( Vector ReturnValue; );
	GetActorTimeDilation 0x3ef8c hash bbe8ca01 params:( None ReturnValue; );
	GetActorTickInterval 0x3ef81 hash 7f86e0ae params:( None ReturnValue; );
	GetActorScale3D 0x3ef78 hash a938a95d params:( Vector ReturnValue; );
	GetActorRightVector 0x3ef6d hash f1999f8f params:( Vector ReturnValue; );
	GetActorRelativeScale3D 0x3ef60 hash 7ef90b19 params:( Vector ReturnValue; );
	GetActorForwardVector 0x3ef54 hash e8ed7406 params:( Vector ReturnValue; );
	GetActorEyesViewPoint 0x3ef48 hash f6061d19 params:( Vector OutLocation;Rotator OutRotation; );
	GetActorEnableCollision 0x3ef3b hash 763362f1 params:( None ReturnValue; );
	GetActorBounds 0x3ef33 hash 8907dd89 params:( None bOnlyCollidingComponents;Vector Origin;Vector BoxExtent; );
	ForceNetUpdate 0x3ef2b hash 540745e params:(  );
	FlushNetDormancy 0x2f0 hash cc01df2b params:(  );
	EnableInput 0x3ef24 hash 98dd317c params:( PlayerController PlayerController; );
	DisableInput 0x3ef1d hash dbf94ea9 params:( PlayerController PlayerController; );
	DetachRootComponentFromParent 0x3ef0d hash 258a12e3 params:( None bMaintainWorldPosition; );
	AddTickPrerequisiteComponent 0x3df83 hash 2470fa4e params:( ActorComponent PrerequisiteComponent; );
	AddTickPrerequisiteActor 0x3df76 hash d6b5fff4 params:( Actor PrerequisiteActor; );
	AddComponent 0x3ef06 hash 33c62bc1 params:( None TemplateName;None bManualAttachment;Transform RelativeTransform;Object ComponentTemplateContext;ActorComponent ReturnValue; );
	ActorHasTag 0x3eeff hash 8776b516 params:( None Tag;None ReturnValue; );
};


instance 1ab5c9fcc40
class Pawn public : Actor
{
	// Fields
	bool bUseControllerRotationPitch; // 0x220
	bool bUseControllerRotationYaw; // 0x220
	bool bUseControllerRotationRoll; // 0x220
	bool bCanAffectNavigationGeneration; // 0x220
	float BaseEyeHeight; // 0x224
	BYTE AutoPossessPlayer; // 0x228
	EAutoPossessAI AutoPossessAI; // 0x229
	BYTE RemoteViewPitch; // 0x22a
	Controller* AIControllerClass; // 0x230
	PlayerState* PlayerState; // 0x238
	Controller* LastHitBy; // 0x248
	Controller* Controller; // 0x250
	Vector ControlInputVector; // 0x25c
	Vector LastControlInputVector; // 0x268

	// Functions
	SpawnDefaultController 0x3f413 hash 88a4ac77 params:(  );
	SetCanAffectNavigationGeneration 0x3f402 hash 6e41768 params:( None bNewValue;None bForceUpdate; );
	ReceiveUnpossessed 0x319f5 hash fbf8c104 params:( Controller OldController; );
	ReceivePossessed 0x319ec hash f08aec21 params:( Controller NewController; );
	PawnMakeNoise 0x3f3fa hash 2dd98297 params:( None Loudness;Vector NoiseLocation;None bUseNoiseMakerLocation;Actor NoiseMaker; );
	OnRep_PlayerState 0x3f3f0 hash 36e1aff6 params:(  );
	OnRep_Controller 0x3f3e7 hash e63c700c params:(  );
	LaunchPawn 0x3f3e1 hash 880a6196 params:( Vector LaunchVelocity;None bXYOverride;None bZOverride; );
	K2_GetMovementInputVector 0x3f3d3 hash b210a14f params:( Vector ReturnValue; );
	IsPlayerControlled 0x3f3c9 hash a08b60a4 params:( None ReturnValue; );
	IsPawnControlled 0x3f3c0 hash 407c44ad params:( None ReturnValue; );
	IsMoveInputIgnored 0x3f3b6 hash 911901b0 params:( None ReturnValue; );
	IsLocallyControlled 0x3f3ab hash 4576fe67 params:( None ReturnValue; );
	IsControlled 0x3f3a4 hash 3f1595f7 params:( None ReturnValue; );
	IsBotControlled 0x3f39b hash eccd381c params:( None ReturnValue; );
	GetPendingMovementInputVector 0x3f38b hash 91cac338 params:( Vector ReturnValue; );
	GetNavAgentLocation 0x3f380 hash d1acb52 params:( Vector ReturnValue; );
	GetMovementComponent 0x3f375 hash 5d09ac3 params:( PawnMovementComponent ReturnValue; );
	GetMovementBaseActor 0x3f36a hash 56a903a4 params:( Pawn Pawn;Actor ReturnValue; );
	GetLastMovementInputVector 0x3f35c hash 5b7a7747 params:( Vector ReturnValue; );
	GetControlRotation 0x3f352 hash 242f16 params:( Rotator ReturnValue; );
	GetController 0x3f34a hash 36c4b549 params:( Controller ReturnValue; );
	GetBaseAimRotation 0x3f340 hash a370aa27 params:( Rotator ReturnValue; );
	DetachFromControllerPendingDestroy 0x3f32e hash 320b7e35 params:(  );
	ConsumeMovementInputVector 0x3f320 hash 17718ccd params:( Vector ReturnValue; );
	AddMovementInput 0x3f317 hash e4c27ec9 params:( Vector WorldDirection;None ScaleValue;None bForce; );
	AddControllerYawInput 0x3f30b hash 96bba173 params:( None Val; );
	AddControllerRollInput 0x3f2ff hash 2aa796bb params:( None Val; );
	AddControllerPitchInput 0x3f2f2 hash af8e5d7a params:( None Val; );
};


instance 1ab5c9fce80
class Character public : Pawn
{
	// Fields
	SkeletalMeshComponent* Mesh; // 0x278
	CharacterMovementComponent* CharacterMovement; // 0x280
	CapsuleComponent* CapsuleComponent; // 0x288
	BasedMovementInfo BasedMovement; // 0x290
	BasedMovementInfo ReplicatedBasedMovement; // 0x2c0
	float AnimRootMotionTranslationScale; // 0x2f0
	Vector BaseTranslationOffset; // 0x2f4
	Quat BaseRotationOffset; // 0x300
	float ReplicatedServerLastTransformUpdateTimeStamp; // 0x310
	float ReplayLastTransformUpdateTimeStamp; // 0x314
	BYTE ReplicatedMovementMode; // 0x318
	bool bInBaseReplication; // 0x319
	float CrouchedEyeHeight; // 0x31c
	bool bIsCrouched; // 0x320
	bool bProxyIsJumpForceApplied; // 0x320
	bool bPressedJump; // 0x320
	bool bClientUpdating; // 0x320
	bool bClientWasFalling; // 0x320
	bool bClientResimulateRootMotion; // 0x320
	bool bClientResimulateRootMotionSources; // 0x320
	bool bSimGravityDisabled; // 0x320
	bool bClientCheckEncroachmentOnNetUpdate; // 0x321
	bool bServerMoveIgnoreRootMotion; // 0x321
	bool bWasJumping; // 0x321
	float JumpKeyHoldTime; // 0x324
	float JumpForceTimeRemaining; // 0x328
	float ProxyJumpForceStartedTime; // 0x32c
	float JumpMaxHoldTime; // 0x330
	int JumpMaxCount; // 0x334
	int JumpCurrentCount; // 0x338
	MulticastInlineDelegateProperty OnReachedJumpApex; // 0x340 property 0x1ab7173c880 hash 0xb7a5ed1a
	MulticastInlineDelegateProperty MovementModeChangedDelegate; // 0x360 property 0x1ab7173c900 hash 0xb7a5ed1a
	MulticastInlineDelegateProperty OnCharacterMovementUpdated; // 0x370 property 0x1ab7173a700 hash 0xb7a5ed1a
	RootMotionSourceGroup SavedRootMotion; // 0x380
	RootMotionMovementParams ClientRootMotionParams; // 0x480
	TArray RootMotionRepMoves; // 0x4c0
	RepRootMotionMontage RepRootMotion; // 0x4d0

	// Functions
	UnCrouch 0x3f500 hash a5ac7c2c params:( None bClientSimulation; );
	StopJumping 0x3f4f9 hash 353938c5 params:(  );
	StopAnimMontage 0x3f4f0 hash 6174eebb params:( AnimMontage AnimMontage; );
	ServerMoveOld 0x25611 hash 16212ef2 params:( None OldTimeStamp;Vector_NetQuantize10 OldAccel;None OldMoveFlags; );
	ServerMoveNoBase 0x25608 hash 860f498b params:( None Timestamp;Vector_NetQuantize10 InAccel;Vector_NetQuantize100 ClientLoc;None CompressedMoveFlags;None ClientRoll;None View;None ClientMovementMode; );
	ServerMoveDualNoBase 0x255fd hash 502567f1 params:( None TimeStamp0;Vector_NetQuantize10 InAccel0;None PendingFlags;None View0;None Timestamp;Vector_NetQuantize10 InAccel;Vector_NetQuantize100 ClientLoc;None NewFlags;None ClientRoll;None View;None ClientMovementMode; );
	ServerMoveDualHybridRootMotion 0x255ed hash 8c9a3cd5 params:( None TimeStamp0;Vector_NetQuantize10 InAccel0;None PendingFlags;None View0;None Timestamp;Vector_NetQuantize10 InAccel;Vector_NetQuantize100 ClientLoc;None NewFlags;None ClientRoll;None View;PrimitiveComponent ClientMovementBase;None ClientBaseBoneName;None ClientMovementMode; );
	ServerMoveDual 0x255e5 hash da412b59 params:( None TimeStamp0;Vector_NetQuantize10 InAccel0;None PendingFlags;None View0;None Timestamp;Vector_NetQuantize10 InAccel;Vector_NetQuantize100 ClientLoc;None NewFlags;None ClientRoll;None View;PrimitiveComponent ClientMovementBase;None ClientBaseBoneName;None ClientMovementMode; );
	ServerMove 0x255df hash 1eb06173 params:( None Timestamp;Vector_NetQuantize10 InAccel;Vector_NetQuantize100 ClientLoc;None CompressedMoveFlags;None ClientRoll;None View;PrimitiveComponent ClientMovementBase;None ClientBaseBoneName;None ClientMovementMode; );
	RootMotionDebugClientPrintOnScreen 0x255cd hash 11b4460f params:( None inString; );
	PlayAnimMontage 0x3f4e7 hash fef89bcb params:( AnimMontage AnimMontage;None InPlayRate;None StartSectionName;None ReturnValue; );
	OnWalkingOffLedge 0x255c3 hash bee8328b params:( Vector PreviousFloorImpactNormal;Vector PreviousFloorContactNormal;Vector PreviousLocation;None TimeDelta; );
	OnRep_RootMotion 0x3f4de hash b8d23e22 params:(  );
	OnRep_ReplicatedBasedMovement 0x3f4ce hash 8c64168f params:(  );
	OnRep_ReplayLastTransformUpdateTimeStamp 0x3f4b9 hash e0dcc87c params:(  );
	OnRep_IsCrouched 0x3f4b0 hash 80d27831 params:(  );
	OnLaunched 0x255bd hash e9af9926 params:( Vector LaunchVelocity;None bXYOverride;None bZOverride; );
	OnLanded 0x255b8 hash 2feb778a params:( HitResult Hit; );
	OnJumped 0x255b3 hash 2caab707 params:(  );
	LaunchCharacter 0x3f4a7 hash bef6dbad params:( Vector LaunchVelocity;None bXYOverride;None bZOverride; );
	K2_UpdateCustomMovement 0x255a6 hash 2b97362a params:( None DeltaTime; );
	K2_OnStartCrouch 0x2559d hash a9578d70 params:( None HalfHeightAdjust;None ScaledHalfHeightAdjust; );
	K2_OnMovementModeChanged 0x25590 hash 2eb75918 params:( EMovementMode PrevMovementMode;EMovementMode NewMovementMode;None PrevCustomMode;None NewCustomMode; );
	K2_OnEndCrouch 0x25588 hash 9767bb39 params:( None HalfHeightAdjust;None ScaledHalfHeightAdjust; );
	Jump 0x3f4a4 hash 7c87a3c1 params:(  );
	IsPlayingRootMotion 0x3f499 hash 99904e2f params:( None ReturnValue; );
	IsPlayingNetworkedRootMotionMontage 0x3f486 hash 4a9da9ed params:( None ReturnValue; );
	IsJumpProvidingForce 0x3f47b hash 888328be params:( None ReturnValue; );
	HasAnyRootMotion 0x3f472 hash bc2b67a3 params:( None ReturnValue; );
	GetCurrentMontage 0x3f468 hash dc966c53 params:( AnimMontage ReturnValue; );
	GetBaseTranslationOffset 0x3f45b hash fb371c56 params:( Vector ReturnValue; );
	GetBaseRotationOffsetRotator 0x3f44c hash fb686a42 params:( Rotator ReturnValue; );
	GetAnimRootMotionTranslationScale 0x3f43a hash c7a91f3b params:( None ReturnValue; );
	Crouch 0x3f436 hash ac766d49 params:( None bClientSimulation; );
	ClientVeryShortAdjustPosition 0x25578 hash 6687cd1a params:( None Timestamp;Vector NewLoc;PrimitiveComponent NewBase;None NewBaseBoneName;None bHasBase;None bBaseRelativePosition;None ServerMovementMode; );
	ClientCheatWalk 0x2556f hash 15408418 params:(  );
	ClientCheatGhost 0x25566 hash bc3363ee params:(  );
	ClientCheatFly 0x2555e hash 4e37fb34 params:(  );
	ClientAdjustRootMotionSourcePosition 0x2554b hash e03d362f params:( None Timestamp;RootMotionSourceGroup ServerRootMotion;None bHasAnimRootMotion;None ServerMontageTrackPosition;Vector ServerLoc;Vector_NetQuantizeNormal ServerRotation;None ServerVelZ;PrimitiveComponent ServerBase;None ServerBoneName;None bHasBase;None bBaseRelativePosition;None ServerMovementMode; );
	ClientAdjustRootMotionPosition 0x2553b hash b167bbde params:( None Timestamp;None ServerMontageTrackPosition;Vector ServerLoc;Vector_NetQuantizeNormal ServerRotation;None ServerVelZ;PrimitiveComponent ServerBase;None ServerBoneName;None bHasBase;None bBaseRelativePosition;None ServerMovementMode; );
	ClientAdjustPosition 0x25530 hash a925c064 params:( None Timestamp;Vector NewLoc;Vector NewVel;PrimitiveComponent NewBase;None NewBaseBoneName;None bHasBase;None bBaseRelativePosition;None ServerMovementMode; );
	ClientAckGoodMove 0x25526 hash bbfcbad3 params:( None Timestamp; );
	CanJumpInternal 0x2551d hash 33f22e90 params:( None ReturnValue; );
	CanJump 0x3f431 hash 13730493 params:( None ReturnValue; );
	CanCrouch 0x3f42b hash abbd4a9b params:( None ReturnValue; );
	CacheInitialMeshOffset 0x3f41f hash 6394aa17 params:( Vector MeshRelativeLocation;Rotator MeshRelativeRotation; );
};


instance 1ab5e054540
class PrimitiveComponent public : SceneComponent
{
	// Fields
	float MinDrawDistance; // 0x1f8
	float LDMaxDrawDistance; // 0x1fc
	float CachedMaxDrawDistance; // 0x200
	BYTE DepthPriorityGroup; // 0x204
	BYTE ViewOwnerDepthPriorityGroup; // 0x205
	BYTE IndirectLightingCacheQuality; // 0x206
	ELightmapType LightmapType; // 0x207
	bool bUseMaxLODAsImposter; // 0x208
	bool bBatchImpostersAsInstances; // 0x208
	bool bNeverDistanceCull; // 0x208
	bool bAlwaysCreatePhysicsState; // 0x208
	bool bGenerateOverlapEvents; // 0x209
	bool bMultiBodyOverlap; // 0x209
	bool bTraceComplexOnMove; // 0x209
	bool bReturnMaterialOnMove; // 0x209
	bool bUseViewOwnerDepthPriorityGroup; // 0x209
	bool bAllowCullDistanceVolume; // 0x209
	bool bHasMotionBlurVelocityMeshes; // 0x209
	bool bVisibleInReflectionCaptures; // 0x209
	bool bVisibleInRayTracing; // 0x20a
	bool bRenderInMainPass; // 0x20a
	bool bRenderInDepthPass; // 0x20a
	bool bReceivesDecals; // 0x20a
	bool bOwnerNoSee; // 0x20a
	bool bOnlyOwnerSee; // 0x20a
	bool bTreatAsBackgroundForOcclusion; // 0x20a
	bool bUseAsOccluder; // 0x20a
	bool bSelectable; // 0x20b
	bool bForceMipStreaming; // 0x20b
	bool bHasPerInstanceHitProxies; // 0x20b
	bool CastShadow; // 0x20b
	bool bAffectDynamicIndirectLighting; // 0x20b
	bool bAffectDistanceFieldLighting; // 0x20b
	bool bCastDynamicShadow; // 0x20b
	bool bCastStaticShadow; // 0x20b
	bool bCastVolumetricTranslucentShadow; // 0x20c
	bool bSelfShadowOnly; // 0x20c
	bool bCastFarShadow; // 0x20c
	bool bCastInsetShadow; // 0x20c
	bool bCastCinematicShadow; // 0x20c
	bool bCastHiddenShadow; // 0x20c
	bool bCastShadowAsTwoSided; // 0x20c
	bool bLightAsIfStatic; // 0x20c
	bool bLightAttachmentsAsGroup; // 0x20d
	bool bExcludeFromLightAttachmentGroup; // 0x20d
	bool bReceiveMobileCSMShadows; // 0x20d
	bool bSingleSampleShadowFromStationaryLights; // 0x20d
	bool bIgnoreRadialImpulse; // 0x20d
	bool bIgnoreRadialForce; // 0x20d
	bool bApplyImpulseOnDamage; // 0x20d
	bool bReplicatePhysicsToAutonomousProxy; // 0x20d
	bool AlwaysLoadOnClient; // 0x20e
	bool AlwaysLoadOnServer; // 0x20e
	bool bUseEditorCompositing; // 0x20e
	bool bRenderCustomDepth; // 0x20e
	BYTE bHasCustomNavigableGeometry; // 0x20f
	BYTE CanCharacterStepUpOn; // 0x211
	LightingChannels LightingChannels; // 0x212
	ERendererStencilMask CustomDepthStencilWriteMask; // 0x213
	int CustomDepthStencilValue; // 0x214
	CustomPrimitiveData CustomPrimitiveData; // 0x218
	int TranslucencySortPriority; // 0x228
	int VisibilityId; // 0x22c
	TArray RuntimeVirtualTextures; // 0x230
	char VirtualTextureLodBias; // 0x240
	char VirtualTextureCullMips; // 0x241
	char VirtualTextureMinCoverage; // 0x242
	ERuntimeVirtualTextureMainPassType VirtualTextureRenderPassType; // 0x243
	float LpvBiasMultiplier; // 0x248
	float BoundsScale; // 0x254
	TArray MoveIgnoreActors; // 0x268
	TArray MoveIgnoreComponents; // 0x278
	BodyInstance BodyInstance; // 0x298
	MulticastSparseDelegateProperty OnComponentHit; // 0x3a8 property 0x1ab71420800 hash 0xece81129
	MulticastSparseDelegateProperty OnComponentBeginOverlap; // 0x3a9 property 0x1ab71420880 hash 0xece81129
	MulticastSparseDelegateProperty OnComponentEndOverlap; // 0x3aa property 0x1ab71420900 hash 0xece81129
	MulticastSparseDelegateProperty OnComponentWake; // 0x3ab property 0x1ab71420980 hash 0xece81129
	MulticastSparseDelegateProperty OnComponentSleep; // 0x3ac property 0x1ab71420a00 hash 0xece81129
	MulticastSparseDelegateProperty OnBeginCursorOver; // 0x3ae property 0x1ab71420a80 hash 0xece81129
	MulticastSparseDelegateProperty OnEndCursorOver; // 0x3af property 0x1ab71420b00 hash 0xece81129
	MulticastSparseDelegateProperty OnClicked; // 0x3b0 property 0x1ab71420b80 hash 0xece81129
	MulticastSparseDelegateProperty OnReleased; // 0x3b1 property 0x1ab71420c00 hash 0xece81129
	MulticastSparseDelegateProperty OnInputTouchBegin; // 0x3b2 property 0x1ab71420c80 hash 0xece81129
	MulticastSparseDelegateProperty OnInputTouchEnd; // 0x3b3 property 0x1ab71420d00 hash 0xece81129
	MulticastSparseDelegateProperty OnInputTouchEnter; // 0x3b4 property 0x1ab71420d80 hash 0xece81129
	MulticastSparseDelegateProperty OnInputTouchLeave; // 0x3b5 property 0x1ab71420e00 hash 0xece81129
	PrimitiveComponent* LODParentPrimitive; // 0x3d0

	// Functions
	WakeRigidBody 0x3fabb hash 74193d2a params:( None BoneName; );
	WakeAllRigidBodies 0x3fab1 hash 79118f2b params:(  );
	SetWalkableSlopeOverride 0x3faa4 hash 44301197 params:( WalkableSlopeOverride NewOverride; );
	SetUseCCD 0x3fa9e hash 9c71b9c8 params:( None InUseCCD;None BoneName; );
	SetTranslucentSortPriority 0x3fa90 hash 62a02c8e params:( None NewTranslucentSortPriority; );
	SetSingleSampleShadowFromStationaryLights 0x3fa7a hash 37268e28 params:( None bNewSingleSampleShadowFromStationaryLights; );
	SetSimulatePhysics 0x3fa70 hash 43243f78 params:( None bSimulate; );
	SetRenderInMainPass 0x3fa65 hash ee0c13c4 params:( None bValue; );
	SetRenderCustomDepth 0x3fa5a hash 49b91aa1 params:( None bValue; );
	SetReceivesDecals 0x3fa50 hash 82057673 params:( None bNewReceivesDecals; );
	SetPhysMaterialOverride 0x3fa43 hash 6ef945a4 params:( PhysicalMaterial NewPhysMaterial; );
	SetPhysicsMaxAngularVelocityInRadians 0x3fa2f hash 51064acc params:( None NewMaxAngVel;None bAddToCurrent;None BoneName; );
	SetPhysicsMaxAngularVelocityInDegrees 0x3fa1b hash 24e6e389 params:( None NewMaxAngVel;None bAddToCurrent;None BoneName; );
	SetPhysicsMaxAngularVelocity 0x3fa0c hash 1965a333 params:( None NewMaxAngVel;None bAddToCurrent;None BoneName; );
	SetPhysicsLinearVelocity 0x3f9ff hash 73cc6c9e params:( Vector NewVel;None bAddToCurrent;None BoneName; );
	SetPhysicsAngularVelocityInRadians 0x3f9ed hash a52528c6 params:( Vector NewAngVel;None bAddToCurrent;None BoneName; );
	SetPhysicsAngularVelocityInDegrees 0x3f9db hash 7905c183 params:( Vector NewAngVel;None bAddToCurrent;None BoneName; );
	SetPhysicsAngularVelocity 0x3f9cd hash 302d8fed params:( Vector NewAngVel;None bAddToCurrent;None BoneName; );
	SetOwnerNoSee 0x3f9c5 hash 3e9dffb6 params:( None bNewOwnerNoSee; );
	SetOnlyOwnerSee 0x3f9bc hash c5892a1b params:( None bNewOnlyOwnerSee; );
	SetNotifyRigidBodyCollision 0x3f9ad hash db527dd3 params:( None bNewNotifyRigidBodyCollision; );
	SetMaterialByName 0x3f9a3 hash c753d8fc params:( None MaterialSlotName;MaterialInterface Material; );
	SetMaterial 0x3f99c hash d99f71e0 params:( None ElementIndex;MaterialInterface Material; );
	SetMassScale 0x3f995 hash df07686d params:( None BoneName;None InMassScale; );
	SetMassOverrideInKg 0x3f98a hash 975f1eae params:( None BoneName;None MassInKg;None bOverrideMass; );
	SetLinearDamping 0x3f981 hash 3680408c params:( None InDamping; );
	SetLightAttachmentsAsGroup 0x3f973 hash ad4b81a6 params:( None bInLightAttachmentsAsGroup; );
	SetGenerateOverlapEvents 0x3f966 hash 31ede12a params:( None bInGenerateOverlapEvents; );
	SetExcludeFromLightAttachmentGroup 0x3f954 hash 34d3875d params:( None bInExcludeFromLightAttachmentGroup; );
	SetEnableGravity 0x3f94b hash 3d9482de params:( None bGravityEnabled; );
	SetCustomPrimitiveDataVector4 0x3f93b hash 3b22a086 params:( None DataIndex;Vector4 Value; );
	SetCustomPrimitiveDataVector3 0x3f92b hash 3b22a085 params:( None DataIndex;Vector Value; );
	SetCustomPrimitiveDataVector2 0x3f91b hash 3b22a084 params:( None DataIndex;Vector2D Value; );
	SetCustomPrimitiveDataFloat 0x3f90c hash eef428d5 params:( None DataIndex;None Value; );
	SetCustomDepthStencilWriteMask 0x3f8fc hash 23b167ea params:( UnderlyingType WriteMaskBit; );
	SetCustomDepthStencilValue 0x3f8ee hash 460f65d0 params:( None Value; );
	SetCullDistance 0x3f8e5 hash e584e3ec params:( None NewCullDistance; );
	SetConstraintMode 0x3f8db hash 93306b3b params:( EDOFMode ConstraintMode; );
	SetCollisionResponseToChannel 0x3f8cb hash 1598db08 params:( ECollisionChannel Channel;ECollisionResponse NewResponse; );
	SetCollisionResponseToAllChannels 0x3f8b9 hash 1e0a41f4 params:( ECollisionResponse NewResponse; );
	SetCollisionProfileName 0x3f8ac hash 6381652f params:( None InCollisionProfileName; );
	SetCollisionObjectType 0x3f8a0 hash 3b9723d6 params:( ECollisionChannel Channel; );
	SetCollisionEnabled 0x3f895 hash ef102208 params:( ECollisionEnabled NewType; );
	SetCenterOfMass 0x3f88c hash ff8937b params:( Vector CenterOfMassOffset;None BoneName; );
	SetCastShadow 0x3f884 hash e4df61c2 params:( None NewCastShadow; );
	SetCastInsetShadow 0x3f87a hash 5493aa5 params:( None bInCastInsetShadow; );
	SetBoundsScale 0x3f872 hash c8b96104 params:( None NewBoundsScale; );
	SetAngularDamping 0x3f868 hash 1640799b params:( None InDamping; );
	SetAllUseCCD 0x3f861 hash 317779c1 params:( None InUseCCD; );
	SetAllPhysicsLinearVelocity 0x3f852 hash ad262377 params:( Vector NewVel;None bAddToCurrent; );
	SetAllPhysicsAngularVelocityInRadians 0x3f83e hash 163002df params:( Vector NewAngVel;None bAddToCurrent; );
	SetAllPhysicsAngularVelocityInDegrees 0x3f82a hash ea109b9c params:( Vector NewAngVel;None bAddToCurrent; );
	SetAllMassScale 0x3f821 hash 7b3151c6 params:( None InMassScale; );
	ScaleByMomentOfInertia 0x3f815 hash 775d8439 params:( Vector InputVector;None BoneName;Vector ReturnValue; );
	PutRigidBodyToSleep 0x3f80a hash d1376657 params:( None BoneName; );
	K2_SphereTraceComponent 0x3f7fd hash a82cdfca params:( Vector TraceStart;Vector TraceEnd;None SphereRadius;None bTraceComplex;None bShowTrace;None bPersistentShowTrace;Vector HitLocation;Vector HitNormal;None BoneName;HitResult OutHit;None ReturnValue; );
	K2_SphereOverlapComponent 0x3f7ef hash a8d801f4 params:( Vector InSphereCentre;None InSphereRadius;None bTraceComplex;None bShowTrace;None bPersistentShowTrace;Vector HitLocation;Vector HitNormal;None BoneName;HitResult OutHit;None ReturnValue; );
	K2_LineTraceComponent 0x3f7e3 hash 74938a8b params:( Vector TraceStart;Vector TraceEnd;None bTraceComplex;None bShowTrace;None bPersistentShowTrace;Vector HitLocation;Vector HitNormal;None BoneName;HitResult OutHit;None ReturnValue; );
	K2_IsQueryCollisionEnabled 0x3f7d5 hash 32c1738a params:( None ReturnValue; );
	K2_IsPhysicsCollisionEnabled 0x3f7c6 hash b8a128f7 params:( None ReturnValue; );
	K2_IsCollisionEnabled 0x3f7ba hash 66668f74 params:( None ReturnValue; );
	K2_BoxOverlapComponent 0x3f7ae hash 9d110c56 params:( Vector InBoxCentre;Box InBox;None bTraceComplex;None bShowTrace;None bPersistentShowTrace;Vector HitLocation;Vector HitNormal;None BoneName;HitResult OutHit;None ReturnValue; );
	IsOverlappingComponent 0x3f7a2 hash b09f023b params:( PrimitiveComponent OtherComp;None ReturnValue; );
	IsOverlappingActor 0x3f0f4 hash d44b1961 params:( Actor Other;None ReturnValue; );
	IsGravityEnabled 0x3f799 hash 4110cc12 params:( None ReturnValue; );
	IsAnyRigidBodyAwake 0x3f78e hash 75d05d6f params:( None ReturnValue; );
	IgnoreComponentWhenMoving 0x3f780 hash 9d01849e params:( PrimitiveComponent Component;None bShouldIgnore; );
	IgnoreActorWhenMoving 0x3f774 hash b9976ac4 params:( Actor Actor;None bShouldIgnore; );
	GetWalkableSlopeOverride 0x3f767 hash 913e7f0b params:( WalkableSlopeOverride ReturnValue; );
	GetPhysicsLinearVelocityAtPoint 0x3f756 hash 5388bb71 params:( Vector Point;None BoneName;Vector ReturnValue; );
	GetPhysicsLinearVelocity 0x3f749 hash c0dada12 params:( None BoneName;Vector ReturnValue; );
	GetPhysicsAngularVelocityInRadians 0x3f737 hash 2e1f73a params:( None BoneName;Vector ReturnValue; );
	GetPhysicsAngularVelocityInDegrees 0x3f725 hash d6c28ff7 params:( None BoneName;Vector ReturnValue; );
	GetPhysicsAngularVelocity 0x3f717 hash 1f09abe1 params:( None BoneName;Vector ReturnValue; );
	GetOverlappingComponents 0x3f078 hash a9c1d6d2 params:( OutOverlappingComponents OutOverlappingComponents; );
	GetOverlappingActors 0x3f06d hash b4c110b8 params:( OverlappingActors OverlappingActors;Class ClassFilter; );
	GetNumMaterials 0x3f70e hash 330720f7 params:( None ReturnValue; );
	GetMaterialFromCollisionFaceIndex 0x3f6fc hash 3545fd9b params:( None FaceIndex;None SectionIndex;MaterialInterface ReturnValue; );
	GetMaterial 0x3f6f5 hash 9946f2d4 params:( None ElementIndex;MaterialInterface ReturnValue; );
	GetMassScale 0x3f6ee hash 939f07e1 params:( None BoneName;None ReturnValue; );
	GetMass 0x3f6e9 hash 511e7df9 params:( None ReturnValue; );
	GetLinearDamping 0x3f6e0 hash a4027a00 params:( None ReturnValue; );
	GetInertiaTensor 0x3f6d7 hash 1f4d368c params:( None BoneName;Vector ReturnValue; );
	GetGenerateOverlapEvents 0x3f6ca hash 7efc4e9e params:( None ReturnValue; );
	GetCollisionResponseToChannel 0x3f6ba hash c49d0fc params:( ECollisionChannel Channel;ECollisionResponse ReturnValue; );
	GetCollisionProfileName 0x3f6ad hash fdf423 params:( None ReturnValue; );
	GetCollisionObjectType 0x3f6a1 hash db83a44a params:( ECollisionChannel ReturnValue; );
	GetCollisionEnabled 0x3f696 hash a4d356fc params:( ECollisionEnabled ReturnValue; );
	GetClosestPointOnCollision 0x3f688 hash 7187f655 params:( Vector Point;Vector OutPointOnBody;None BoneName;None ReturnValue; );
	GetCenterOfMass 0x3f67f hash 689f6e6f params:( None BoneName;Vector ReturnValue; );
	GetAngularDamping 0x3f675 hash 3409e18f params:( None ReturnValue; );
	CreateDynamicMaterialInstance 0x3f665 hash a4482bc2 params:( None ElementIndex;MaterialInterface SourceMaterial;None OptionalName;MaterialInstanceDynamic ReturnValue; );
	CreateAndSetMaterialInstanceDynamicFromMaterial 0x3f64c hash 53e84904 params:( None ElementIndex;MaterialInterface Parent;MaterialInstanceDynamic ReturnValue; );
	CreateAndSetMaterialInstanceDynamic 0x3f639 hash d72bb5e1 params:( None ElementIndex;MaterialInstanceDynamic ReturnValue; );
	CopyArrayOfMoveIgnoreComponents 0x3f628 hash bed27f15 params:( ReturnValue ReturnValue; );
	CopyArrayOfMoveIgnoreActors 0x3f619 hash bba0f7b params:( ReturnValue ReturnValue; );
	ClearMoveIgnoreComponents 0x3f60b hash bde5484d params:(  );
	ClearMoveIgnoreActors 0x3f5ff hash 3f28fcb3 params:(  );
	CanCharacterStepUp 0x3f5f5 hash 670d1b45 params:( Pawn Pawn;None ReturnValue; );
	AddTorqueInRadians 0x3f5eb hash 534fd47 params:( Vector Torque;None BoneName;None bAccelChange; );
	AddTorqueInDegrees 0x3f5e1 hash d9159604 params:( Vector Torque;None BoneName;None bAccelChange; );
	AddTorque 0x3f5db hash ad36874e params:( Vector Torque;None BoneName;None bAccelChange; );
	AddRadialImpulse 0x3f5d2 hash 46323bba params:( Vector Origin;None Radius;None Strength;ERadialImpulseFalloff Falloff;None bVelChange; );
	AddRadialForce 0x3f5ca hash b23f96a params:( Vector Origin;None Radius;None Strength;ERadialImpulseFalloff Falloff;None bAccelChange; );
	AddImpulseAtLocation 0x3f5bf hash 8039ecfb params:( Vector Impulse;Vector Location;None BoneName; );
	AddImpulse 0x3f5b9 hash 7a5fed params:( Vector Impulse;None BoneName;None bVelChange; );
	AddForceAtLocationLocal 0x3f5ac hash e6b82f36 params:( Vector Force;Vector Location;None BoneName; );
	AddForceAtLocation 0x3f5a2 hash 6fb1edeb params:( Vector Force;Vector Location;None BoneName; );
	AddForce 0x3f59d hash 789f74dd params:( Vector Force;None BoneName;None bAccelChange; );
	AddAngularImpulseInRadians 0x3f58f hash 3a2fbbd0 params:( Vector Impulse;None BoneName;None bVelChange; );
	AddAngularImpulseInDegrees 0x3f581 hash e10548d params:( Vector Impulse;None BoneName;None bVelChange; );
	AddAngularImpulse 0x3f577 hash 1f5cbfb7 params:( Vector Impulse;None BoneName;None bVelChange; );
};


instance 1ab5e054780
class MeshComponent public : PrimitiveComponent
{
	// Fields
	TArray OverrideMaterials; // 0x3d8
	bool bEnableMaterialParameterCaching; // 0x3f8

	// Functions
	SetVectorParameterValueOnMaterials 0x3fafd hash c262a3e1 params:( None ParameterName;Vector ParameterValue; );
	SetScalarParameterValueOnMaterials 0x3faeb hash 572a65c4 params:( None ParameterName;None ParameterValue; );
	PrestreamTextures 0x3f262 hash 5ab9a27c params:( None Seconds;None bPrioritizeCharacterTextures;None CinematicTextureGroups; );
	IsMaterialSlotNameValid 0x3fade hash a3317523 params:( None MaterialSlotName;None ReturnValue; );
	GetMaterialSlotNames 0x3fad3 hash a2e7196a params:( ReturnValue ReturnValue; );
	GetMaterials 0x3facc hash c2254dc7 params:( ReturnValue ReturnValue; );
	GetMaterialIndex 0x3fac3 hash c95adcac params:( None MaterialSlotName;None ReturnValue; );
};


instance 1ab5e052a40
class DataAsset public : Object
{
	// Fields
	DataAsset* NativeClass; // 0x28

};


instance 1ab5e0525c0
class SplineComponent public : PrimitiveComponent
{
	// Fields
	SplineCurves SplineCurves; // 0x3d8
	InterpCurveVector SplineInfo; // 0x440
	InterpCurveQuat SplineRotInfo; // 0x458
	InterpCurveVector SplineScaleInfo; // 0x470
	InterpCurveFloat SplineReparamTable; // 0x488
	bool bAllowSplineEditingPerInstance; // 0x4a0
	int ReparamStepsPerSegment; // 0x4a4
	float Duration; // 0x4a8
	bool bStationaryEndpoints; // 0x4ac
	bool bSplineHasBeenEdited; // 0x4ad
	bool bModifiedByConstructionScript; // 0x4ae
	bool bInputSplinePointsToConstructionScript; // 0x4af
	bool bDrawDebug; // 0x4b0
	bool bClosedLoop; // 0x4b1
	bool bLoopPositionOverride; // 0x4b2
	float LoopPosition; // 0x4b4
	Vector DefaultUpVector; // 0x4b8

	// Functions
	UpdateSpline 0x401db hash df99ed53 params:(  );
	SetWorldLocationAtSplinePoint 0x401cb hash c898417c params:( None PointIndex;Vector InLocation; );
	SetUpVectorAtSplinePoint 0x401be hash df4639f3 params:( None PointIndex;Vector InUpVector;ESplineCoordinateSpace CoordinateSpace;None bUpdateSpline; );
	SetUnselectedSplineSegmentColor 0x401ad hash f43e5b7a params:( LinearColor SegmentColor; );
	SetTangentsAtSplinePoint 0x401a0 hash 50ada13f params:( None PointIndex;Vector InArriveTangent;Vector InLeaveTangent;ESplineCoordinateSpace CoordinateSpace;None bUpdateSpline; );
	SetTangentAtSplinePoint 0x40193 hash afb469ac params:( None PointIndex;Vector InTangent;ESplineCoordinateSpace CoordinateSpace;None bUpdateSpline; );
	SetSplineWorldPoints 0x40188 hash 7fa33401 params:( Points Points; );
	SetSplinePointType 0x4017e hash cd183288 params:( None PointIndex;ESplinePointType Type;None bUpdateSpline; );
	SetSplinePoints 0x40175 hash 395f3359 params:( Points Points;ESplineCoordinateSpace CoordinateSpace;None bUpdateSpline; );
	SetSplineLocalPoints 0x4016a hash 325a8b84 params:( Points Points; );
	SetSelectedSplineSegmentColor 0x4015a hash ead83df7 params:( LinearColor SegmentColor; );
	SetLocationAtSplinePoint 0x4014d hash c99760b4 params:( None PointIndex;Vector InLocation;ESplineCoordinateSpace CoordinateSpace;None bUpdateSpline; );
	SetDrawDebug 0x40146 hash 15b49de6 params:( None bShow; );
	SetDefaultUpVector 0x4013c hash 52c8e72e params:( Vector UpVector;ESplineCoordinateSpace CoordinateSpace; );
	SetClosedLoopAtPosition 0x4012f hash 94b8454f params:( None bInClosedLoop;None Key;None bUpdateSpline; );
	SetClosedLoop 0x40127 hash 11dfd0a5 params:( None bInClosedLoop;None bUpdateSpline; );
	RemoveSplinePoint 0x4011d hash 80465bc8 params:( None Index;None bUpdateSpline; );
	IsClosedLoop 0x40116 hash 61bc3f55 params:( None ReturnValue; );
	GetWorldTangentAtDistanceAlongSpline 0x40103 hash 1047513a params:( None Distance;Vector ReturnValue; );
	GetWorldRotationAtTime 0x400f7 hash 1cfbe4a1 params:( None Time;None bUseConstantVelocity;Rotator ReturnValue; );
	GetWorldRotationAtDistanceAlongSpline 0x400e3 hash 8c744819 params:( None Distance;Rotator ReturnValue; );
	GetWorldLocationAtTime 0x400d7 hash 7951576a params:( None Time;None bUseConstantVelocity;Vector ReturnValue; );
	GetWorldLocationAtSplinePoint 0x400c7 hash bf493770 params:( None PointIndex;Vector ReturnValue; );
	GetWorldLocationAtDistanceAlongSpline 0x400b3 hash 3cc237c2 params:( None Distance;Vector ReturnValue; );
	GetWorldDirectionAtTime 0x400a6 hash 25fef552 params:( None Time;None bUseConstantVelocity;Vector ReturnValue; );
	GetWorldDirectionAtDistanceAlongSpline 0x40092 hash aa3488aa params:( None Distance;Vector ReturnValue; );
	GetVectorPropertyAtSplinePoint 0x40082 hash 93801827 params:( None Index;None PropertyName;Vector ReturnValue; );
	GetVectorPropertyAtSplineInputKey 0x40070 hash 3ecb8056 params:( None InKey;None PropertyName;Vector ReturnValue; );
	GetUpVectorAtTime 0x40066 hash 24b0df41 params:( None Time;ESplineCoordinateSpace CoordinateSpace;None bUseConstantVelocity;Vector ReturnValue; );
	GetUpVectorAtSplinePoint 0x40059 hash 2c54a767 params:( None PointIndex;ESplineCoordinateSpace CoordinateSpace;Vector ReturnValue; );
	GetUpVectorAtSplineInputKey 0x4004a hash 65acc796 params:( None InKey;ESplineCoordinateSpace CoordinateSpace;Vector ReturnValue; );
	GetUpVectorAtDistanceAlongSpline 0x40039 hash ddddaeb9 params:( None Distance;ESplineCoordinateSpace CoordinateSpace;Vector ReturnValue; );
	GetTransformAtTime 0x4002f hash 9323b7c5 params:( None Time;ESplineCoordinateSpace CoordinateSpace;None bUseConstantVelocity;None bUseScale;Transform ReturnValue; );
	GetTransformAtSplinePoint 0x40021 hash 416436b params:( None PointIndex;ESplineCoordinateSpace CoordinateSpace;None bUseScale;Transform ReturnValue; );
	GetTransformAtSplineInputKey 0x40012 hash 75b151a params:( None InKey;ESplineCoordinateSpace CoordinateSpace;None bUseScale;Transform ReturnValue; );
	GetTransformAtDistanceAlongSpline 0x40000 hash 8d6d0ebd params:( None Distance;ESplineCoordinateSpace CoordinateSpace;None bUseScale;Transform ReturnValue; );
	GetTangentAtTime 0x3fff5 hash e5150e9a params:( None Time;ESplineCoordinateSpace CoordinateSpace;None bUseConstantVelocity;Vector ReturnValue; );
	GetTangentAtSplinePoint 0x3ffe8 hash 4d30f8a0 params:( None PointIndex;ESplineCoordinateSpace CoordinateSpace;Vector ReturnValue; );
	GetTangentAtSplineInputKey 0x3ffda hash 5592ba2f params:( None InKey;ESplineCoordinateSpace CoordinateSpace;Vector ReturnValue; );
	GetTangentAtDistanceAlongSpline 0x3ffc9 hash 6a3028f2 params:( None Distance;ESplineCoordinateSpace CoordinateSpace;Vector ReturnValue; );
	GetSplinePointType 0x3ffbf hash a40e98fc params:( None PointIndex;ESplinePointType ReturnValue; );
	GetSplineLength 0x3ffb6 hash 87ff16d2 params:( None ReturnValue; );
	GetScaleAtTime 0x3ffae hash 94c8c9d1 params:( None Time;None bUseConstantVelocity;Vector ReturnValue; );
	GetScaleAtSplinePoint 0x3ffa2 hash ce290ff7 params:( None PointIndex;Vector ReturnValue; );
	GetScaleAtSplineInputKey 0x3ff95 hash e0572626 params:( None InKey;Vector ReturnValue; );
	GetScaleAtDistanceAlongSpline 0x3ff85 hash 2799a749 params:( None Distance;Vector ReturnValue; );
	GetRotationAtTime 0x3ff7b hash da151a59 params:( None Time;ESplineCoordinateSpace CoordinateSpace;None bUseConstantVelocity;Rotator ReturnValue; );
	GetRotationAtSplinePoint 0x3ff6e hash bb74777f params:( None PointIndex;ESplineCoordinateSpace CoordinateSpace;Rotator ReturnValue; );
	GetRotationAtSplineInputKey 0x3ff5f hash 687c0ae params:( None InKey;ESplineCoordinateSpace CoordinateSpace;Rotator ReturnValue; );
	GetRotationAtDistanceAlongSpline 0x3ff4e hash 237816d1 params:( None Distance;ESplineCoordinateSpace CoordinateSpace;Rotator ReturnValue; );
	GetRollAtTime 0x3ff46 hash c10e2542 params:( None Time;ESplineCoordinateSpace CoordinateSpace;None bUseConstantVelocity;None ReturnValue; );
	GetRollAtSplinePoint 0x3ff3b hash 8a890248 params:( None PointIndex;ESplineCoordinateSpace CoordinateSpace;None ReturnValue; );
	GetRollAtSplineInputKey 0x3ff2e hash b93642d7 params:( None InKey;ESplineCoordinateSpace CoordinateSpace;None ReturnValue; );
	GetRollAtDistanceAlongSpline 0x3ff1f hash 512b5a9a params:( None Distance;ESplineCoordinateSpace CoordinateSpace;None ReturnValue; );
	GetRightVectorAtTime 0x3ff14 hash 7323cc5a params:( None Time;ESplineCoordinateSpace CoordinateSpace;None bUseConstantVelocity;Vector ReturnValue; );
	GetRightVectorAtSplinePoint 0x3ff05 hash 8b08be60 params:( None PointIndex;ESplineCoordinateSpace CoordinateSpace;Vector ReturnValue; );
	GetRightVectorAtSplineInputKey 0x3fef5 hash c479a7ef params:( None InKey;ESplineCoordinateSpace CoordinateSpace;Vector ReturnValue; );
	GetRightVectorAtDistanceAlongSpline 0x3fee2 hash af51aeb2 params:( None Distance;ESplineCoordinateSpace CoordinateSpace;Vector ReturnValue; );
	GetNumberOfSplineSegments 0x3fed4 hash 86da4554 params:( None ReturnValue; );
	GetNumberOfSplinePoints 0x3fec7 hash 16c070cb params:( None ReturnValue; );
	GetLocationAtTime 0x3febd hash 366a8d22 params:( None Time;ESplineCoordinateSpace CoordinateSpace;None bUseConstantVelocity;Vector ReturnValue; );
	GetLocationAtSplinePoint 0x3feb0 hash 16a5ce28 params:( None PointIndex;ESplineCoordinateSpace CoordinateSpace;Vector ReturnValue; );
	GetLocationAtSplineInputKey 0x3fea1 hash 8f9e02b7 params:( None InKey;ESplineCoordinateSpace CoordinateSpace;Vector ReturnValue; );
	GetLocationAtDistanceAlongSpline 0x3fe90 hash d3c6067a params:( None Distance;ESplineCoordinateSpace CoordinateSpace;Vector ReturnValue; );
	GetLocationAndTangentAtSplinePoint 0x3fe7e hash ed88ccec params:( None PointIndex;Vector Location;Vector Tangent;ESplineCoordinateSpace CoordinateSpace; );
	GetLocalLocationAndTangentAtSplinePoint 0x3fe69 hash 6e8f5117 params:( None PointIndex;Vector LocalLocation;Vector LocalTangent; );
	GetLeaveTangentAtSplinePoint 0x3fe5a hash c4f67d0d params:( None PointIndex;ESplineCoordinateSpace CoordinateSpace;Vector ReturnValue; );
	GetInputKeyAtDistanceAlongSpline 0x3fe49 hash 56a5847a params:( None Distance;None ReturnValue; );
	GetFloatPropertyAtSplinePoint 0x3fe39 hash 32e0c20a params:( None Index;None PropertyName;None ReturnValue; );
	GetFloatPropertyAtSplineInputKey 0x3fe28 hash 7f540359 params:( None InKey;None PropertyName;None ReturnValue; );
	GetDistanceAlongSplineAtSplinePoint 0x3fe15 hash b245376 params:( None PointIndex;None ReturnValue; );
	GetDirectionAtTime 0x3fe0b hash 863ee20a params:( None Time;ESplineCoordinateSpace CoordinateSpace;None bUseConstantVelocity;Vector ReturnValue; );
	GetDirectionAtSplinePoint 0x3fdfd hash 857c8e10 params:( None PointIndex;ESplineCoordinateSpace CoordinateSpace;Vector ReturnValue; );
	GetDirectionAtSplineInputKey 0x3fdee hash ffef999f params:( None InKey;ESplineCoordinateSpace CoordinateSpace;Vector ReturnValue; );
	GetDirectionAtDistanceAlongSpline 0x3fddc hash 21b22e62 params:( None Distance;ESplineCoordinateSpace CoordinateSpace;Vector ReturnValue; );
	GetDefaultUpVector 0x3fdd2 hash 29bf4da2 params:( ESplineCoordinateSpace CoordinateSpace;Vector ReturnValue; );
	GetArriveTangentAtSplinePoint 0x3fdc2 hash 9ff58aa9 params:( None PointIndex;ESplineCoordinateSpace CoordinateSpace;Vector ReturnValue; );
	FindUpVectorClosestToWorldLocation 0x3fdb0 hash 43fa031f params:( Vector WorldLocation;ESplineCoordinateSpace CoordinateSpace;Vector ReturnValue; );
	FindTransformClosestToWorldLocation 0x3fd9d hash 59f277c3 params:( Vector WorldLocation;ESplineCoordinateSpace CoordinateSpace;None bUseScale;Transform ReturnValue; );
	FindTangentClosestToWorldLocation 0x3fd8b hash 980b458 params:( Vector WorldLocation;ESplineCoordinateSpace CoordinateSpace;Vector ReturnValue; );
	FindScaleClosestToWorldLocation 0x3fd7a hash e757e94f params:( Vector WorldLocation;Vector ReturnValue; );
	FindRotationClosestToWorldLocation 0x3fd68 hash 3ce16e37 params:( Vector WorldLocation;ESplineCoordinateSpace CoordinateSpace;Rotator ReturnValue; );
	FindRollClosestToWorldLocation 0x3fd58 hash 454802a0 params:( Vector WorldLocation;ESplineCoordinateSpace CoordinateSpace;None ReturnValue; );
	FindRightVectorClosestToWorldLocation 0x3fd44 hash 449d4a98 params:( Vector WorldLocation;ESplineCoordinateSpace CoordinateSpace;Vector ReturnValue; );
	FindLocationClosestToWorldLocation 0x3fd32 hash f6ed5300 params:( Vector WorldLocation;ESplineCoordinateSpace CoordinateSpace;Vector ReturnValue; );
	FindInputKeyClosestToWorldLocation 0x3fd20 hash d5bc9100 params:( Vector WorldLocation;None ReturnValue; );
	FindDirectionClosestToWorldLocation 0x3fd0d hash 76db8c08 params:( Vector WorldLocation;ESplineCoordinateSpace CoordinateSpace;Vector ReturnValue; );
	ClearSplinePoints 0x3fd03 hash 9c2e3fd4 params:( None bUpdateSpline; );
	AddSplineWorldPoint 0x3fcf8 hash 9014870b params:( Vector Position; );
	AddSplinePointAtIndex 0x3fcec hash a01ef330 params:( Vector Position;None Index;ESplineCoordinateSpace CoordinateSpace;None bUpdateSpline; );
	AddSplinePoint 0x3fce4 hash 4a188143 params:( Vector Position;ESplineCoordinateSpace CoordinateSpace;None bUpdateSpline; );
	AddSplineLocalPoint 0x3fcd9 hash 4fad7a2e params:( Vector Position; );
	AddPoints 0x3fcd3 hash a3dce88b params:( Points Points;None bUpdateSpline; );
	AddPoint 0x3fcce hash 79544518 params:( SplinePoint Point;None bUpdateSpline; );
};


instance 1ab5e051180
class SkinnedMeshComponent public : MeshComponent
{
	// Fields
	SkeletalMesh* SkeletalMesh; // 0x400
	WeakObjectProperty MasterPoseComponent; // 0x408 property 0x1ab718a8800 hash 0x24388009
	PhysicsAsset* PhysicsAssetOverride; // 0x508
	int ForcedLodModel; // 0x510
	int MinLodModel; // 0x514
	float StreamingDistanceMultiplier; // 0x520
	TArray LODInfo; // 0x530
	EVisibilityBasedAnimTickOption VisibilityBasedAnimTickOption; // 0x564
	bool bOverrideMinLod; // 0x566
	bool bUseBoundsFromMasterPoseComponent; // 0x566
	bool bForceWireframe; // 0x566
	bool bDisplayBones; // 0x566
	bool bDisableMorphTarget; // 0x566
	bool bHideSkin; // 0x566
	bool bPerBoneMotionBlur; // 0x567
	bool bComponentUseFixedSkelBounds; // 0x567
	bool bConsiderAllBodiesForBounds; // 0x567
	bool bSyncAttachParentLOD; // 0x567
	bool bCanHighlightSelectedSections; // 0x567
	bool bRecentlyRendered; // 0x567
	bool bCastCapsuleDirectShadow; // 0x567
	bool bCastCapsuleIndirectShadow; // 0x567
	bool bCPUSkinning; // 0x568
	bool bEnableUpdateRateOptimizations; // 0x568
	bool bDisplayDebugUpdateRateOptimizations; // 0x568
	bool bRenderStatic; // 0x568
	bool bIgnoreMasterPoseComponentLOD; // 0x568
	bool bCachedLocalBoundsUpToDate; // 0x568
	bool bForceMeshObjectUpdate; // 0x569
	float CapsuleIndirectShadowMinVisibility; // 0x56c
	BoxSphereBounds CachedWorldSpaceBounds; // 0x590
	Matrix CachedWorldToLocalTransform; // 0x5b0

	// Functions
	UnloadSkinWeightProfile 0x4049e hash ececeb56 params:( None InProfileName; );
	UnHideBoneByName 0x40495 hash fb31ad42 params:( None BoneName; );
	TransformToBoneSpace 0x4048a hash 1fe8fdb4 params:( None BoneName;Vector InPosition;Rotator InRotation;Vector OutPosition;Rotator OutRotation; );
	TransformFromBoneSpace 0x4047e hash 9bf1dc05 params:( None BoneName;Vector InPosition;Rotator InRotation;Vector OutPosition;Rotator OutRotation; );
	ShowMaterialSection 0x40473 hash 35f8f54a params:( None MaterialID;None SectionIndex;None bShow;None LODIndex; );
	ShowAllMaterialSections 0x40466 hash cf392a16 params:( None LODIndex; );
	SetVertexColorOverride_LinearColor 0x40454 hash 29028907 params:( None LODIndex;VertexColors VertexColors; );
	SetSkinWeightProfile 0x40449 hash c09dd03f params:( None InProfileName;None ReturnValue; );
	SetSkinWeightOverride 0x4043d hash 58968ee params:( None LODIndex;SkinWeights SkinWeights; );
	SetSkeletalMesh 0x40434 hash 3b75ffb3 params:( SkeletalMesh NewMesh;None bReinitPose; );
	SetRenderStatic 0x4042b hash b0d13cb9 params:( None bNewValue; );
	SetPhysicsAsset 0x40422 hash 54314df4 params:( PhysicsAsset NewPhysicsAsset;None bForceReInit; );
	SetMinLOD 0x4041c hash 891896f4 params:( None InNewMinLOD; );
	SetMasterPoseComponent 0x40410 hash f7a9a807 params:( SkinnedMeshComponent NewMasterBoneComponent;None bForceUpdate; );
	SetForcedLOD 0x40409 hash 2a331723 params:( None InNewForcedLOD; );
	SetCastCapsuleIndirectShadow 0x403fa hash 62e76f01 params:( None bNewValue; );
	SetCastCapsuleDirectShadow 0x403ec hash ab47e84a params:( None bNewValue; );
	SetCapsuleIndirectShadowMinVisibility 0x403d8 hash 8f0796e2 params:( None NewValue; );
	IsUsingSkinWeightProfile 0x403cb hash 8eb769f5 params:( None ReturnValue; );
	IsMaterialSectionShown 0x403bf hash 2218e834 params:( None MaterialID;None LODIndex;None ReturnValue; );
	IsBoneHiddenByName 0x403b5 hash 6afe7aed params:( None BoneName;None ReturnValue; );
	HideBoneByName 0x403ad hash 13756b5f params:( None BoneName;EPhysBodyOp PhysBodyOption; );
	GetTwistAndSwingAngleOfDeltaRotationFromRefPose 0x40394 hash 128cbff9 params:( None BoneName;None OutTwistAngle;None OutSwingAngle;None ReturnValue; );
	GetSocketBoneName 0x4038a hash fcd2a8d3 params:( None InSocketName;None ReturnValue; );
	GetRefPosePosition 0x40380 hash 5a04eece params:( None BoneIndex;Vector ReturnValue; );
	GetParentBone 0x40378 hash 31cc8813 params:( None BoneName;None ReturnValue; );
	GetNumLODs 0x40372 hash e492b427 params:( None ReturnValue; );
	GetNumBones 0x4036b hash 7646816c params:( None ReturnValue; );
	GetForcedLOD 0x40364 hash decab697 params:( None ReturnValue; );
	GetDeltaTransformFromRefPose 0x40355 hash aa3b61b3 params:( None BoneName;None BaseName;Transform ReturnValue; );
	GetCurrentSkinWeightProfileName 0x40344 hash 9a1b8f17 params:( None ReturnValue; );
	GetBoneName 0x4033d hash 9a0f4dca params:( None BoneIndex;None ReturnValue; );
	GetBoneIndex 0x40336 hash dba587a1 params:( None BoneName;None ReturnValue; );
	FindClosestBone_K2 0x4032c hash b837cd43 params:( Vector TestLocation;Vector BoneLocation;None IgnoreScale;None bRequirePhysicsAsset;None ReturnValue; );
	ClearVertexColorOverride 0x4031f hash 86e96149 params:( None LODIndex; );
	ClearSkinWeightProfile 0x40313 hash 599ee19a params:(  );
	ClearSkinWeightOverride 0x40306 hash beaca5a9 params:( None LODIndex; );
	BoneIsChildOf 0x402fe hash 7bd0a57e params:( None BoneName;None ParentBoneName;None ReturnValue; );
};


instance 1ab5e0513c0
class SkeletalMeshComponent public : SkinnedMeshComponent
{
	// Fields
	Object* AnimBlueprintGeneratedClass; // 0x610
	AnimInstance* AnimClass; // 0x618
	AnimInstance* AnimScriptInstance; // 0x620
	AnimInstance* PostProcessAnimInstance; // 0x628
	SingleAnimationPlayData AnimationData; // 0x630
	Vector RootBoneTranslation; // 0x658
	Vector LineCheckBoundsScale; // 0x664
	TArray LinkedInstances; // 0x690
	TArray CachedBoneSpaceTransforms; // 0x6a0
	TArray CachedComponentSpaceTransforms; // 0x6b0
	float GlobalAnimRateScale; // 0x6e0
	BYTE KinematicBonesUpdateType; // 0x6e4
	BYTE PhysicsTransformUpdateMode; // 0x6e5
	BYTE AnimationMode; // 0x6e7
	bool bDisablePostProcessBlueprint; // 0x6e9
	bool bUpdateOverlapsOnAnimationFinalize; // 0x6e9
	bool bHasValidBodies; // 0x6e9
	bool bBlendPhysics; // 0x6e9
	bool bEnablePhysicsOnDedicatedServer; // 0x6e9
	bool bUpdateJointsFromAnimation; // 0x6ea
	bool bDisableClothSimulation; // 0x6ea
	bool bAllowAnimCurveEvaluation; // 0x6ea
	bool bDisableAnimCurves; // 0x6ea
	bool bCollideWithEnvironment; // 0x6ea
	bool bCollideWithAttachedChildren; // 0x6eb
	bool bLocalSpaceSimulation; // 0x6eb
	bool bResetAfterTeleport; // 0x6eb
	bool bDeferKinematicBoneUpdate; // 0x6eb
	bool bNoSkeletonUpdate; // 0x6eb
	bool bPauseAnims; // 0x6eb
	bool bUseRefPoseOnInitAnim; // 0x6eb
	bool bEnablePerPolyCollision; // 0x6ec
	bool bForceRefpose; // 0x6ec
	bool bOnlyAllowAutonomousTickPose; // 0x6ec
	bool bIsAutonomousTickPose; // 0x6ec
	bool bOldForceRefPose; // 0x6ec
	bool bShowPrePhysBones; // 0x6ec
	bool bRequiredBonesUpToDate; // 0x6ec
	bool bAnimTreeInitialised; // 0x6ec
	bool bIncludeComponentLocationIntoBounds; // 0x6ed
	bool bEnableLineCheckWithBounds; // 0x6ed
	bool bUseBendingElements; // 0x6ed
	bool bUseTetrahedralConstraints; // 0x6ed
	bool bUseThinShellVolumeConstraints; // 0x6ed
	bool bUseSelfCollisions; // 0x6ed
	bool bUseContinuousCollisionDetection; // 0x6ed
	bool bPropagateCurvesToSlaves; // 0x6ed
	bool bSkipKinematicUpdateWhenInterpolating; // 0x6ee
	bool bSkipBoundsUpdateWhenInterpolating; // 0x6ee
	bool bNeedsQueuedAnimEventsDispatched; // 0x6ee
	USHORT CachedAnimCurveUidVersion; // 0x6f0
	EClothMassMode MassMode; // 0x6f2
	float UniformMass; // 0x6f4
	float TotalMass; // 0x6f8
	float Density; // 0x6fc
	float MinPerParticleMass; // 0x700
	float ClothBlendWeight; // 0x704
	float EdgeStiffness; // 0x708
	float BendingStiffness; // 0x70c
	float AreaStiffness; // 0x710
	float VolumeStiffness; // 0x714
	float StrainLimitingStiffness; // 0x718
	float ShapeTargetStiffness; // 0x71c
	TArray DisallowedAnimCurves; // 0x720
	BodySetup* BodySetup; // 0x730
	MulticastInlineDelegateProperty OnConstraintBroken; // 0x740 property 0x1ab718ac000 hash 0xb7a5ed1a
	ClothingSimulationFactory* ClothingSimulationFactory; // 0x750
	float TeleportDistanceThreshold; // 0x828
	float TeleportRotationThreshold; // 0x82c
	int LastPoseTickFrame; // 0x838
	ClothingSimulationInteractor* ClothingInteractor; // 0x890
	MulticastInlineDelegateProperty OnAnimInitialized; // 0x960 property 0x1ab718ac180 hash 0xb7a5ed1a

	// Functions
	UnlinkAnimClassLayers 0x408ae hash f646f8e1 params:( Class InClass; );
	UnbindClothFromMasterPoseComponent 0x4089c hash 1ab61669 params:( None bRestoreSimulationSpace; );
	ToggleDisablePostProcessBlueprint 0x4088a hash ac47d2b5 params:(  );
	TermBodiesBelow 0x40881 hash b6d3d2ec params:( None ParentBoneName; );
	SuspendClothingSimulation 0x40873 hash c0a88e64 params:(  );
	Stop 0x3e2ef hash 7c8c8f2b params:(  );
	SnapshotPose 0x4086c hash 765b284c params:( PoseSnapshot Snapshot; );
	SetUpdateAnimationInEditor 0x4085e hash 9269e932 params:( None NewUpdateState; );
	SetTeleportRotationThreshold 0x4084f hash 16b31afd params:( None Threshold; );
	SetTeleportDistanceThreshold 0x40840 hash 340239f8 params:( None Threshold; );
	SetPosition 0x40839 hash d2089706 params:( None InPos;None bFireNotifies; );
	SetPlayRate 0x3fbb7 hash c22bc733 params:( None Rate; );
	SetPhysicsBlendWeight 0x4082d hash f2fa0581 params:( None PhysicsBlendWeight; );
	SetNotifyRigidBodyCollisionBelow 0x4081c hash 447ca76c params:( None bNewNotifyRigidBodyCollision;None BoneName;None bIncludeSelf; );
	SetMorphTarget 0x40814 hash eb62327e params:( None MorphTargetName;None Value;None bRemoveZeroWeight; );
	SetEnablePhysicsBlending 0x40807 hash 6874549e params:( None bNewBlendPhysics; );
	SetEnableGravityOnAllBodiesBelow 0x407f6 hash f86b4463 params:( None bEnableGravity;None BoneName;None bIncludeSelf; );
	SetEnableBodyGravity 0x407eb hash 63ac29ac params:( None bEnableGravity;None BoneName; );
	SetDisablePostProcessBlueprint 0x407db hash 917378df params:( None bInDisablePostProcess; );
	SetDisableAnimCurves 0x407d0 hash 5bef83c2 params:( None bInDisableAnimCurves; );
	SetConstraintProfileForAll 0x407c2 hash 3f314fa7 params:( None ProfileName;None bDefaultIfNotFound; );
	SetConstraintProfile 0x407b7 hash 2eb47c67 params:( None JointName;None ProfileName;None bDefaultIfNotFound; );
	SetClothMaxDistanceScale 0x407aa hash 88ea2744 params:( None Scale; );
	SetBodyNotifyRigidBodyCollision 0x40799 hash 40576ee1 params:( None bNewNotifyRigidBodyCollision;None BoneName; );
	SetAnimClass 0x40792 hash 57a800cc params:( Class NewClass; );
	SetAnimationMode 0x40789 hash 61065396 params:( EAnimationMode InAnimationMode; );
	SetAnimation 0x40782 hash 59cb6471 params:( AnimationAsset NewAnimToPlay; );
	SetAngularLimits 0x40779 hash 51f60f6d params:( None InBoneName;None Swing1LimitAngle;None TwistLimitAngle;None Swing2LimitAngle; );
	SetAllowedAnimCurvesEvaluation 0x40769 hash 9a2b70ee params:( List List;None bAllow; );
	SetAllowAnimCurveEvaluation 0x4075a hash 8039a592 params:( None bInAllow; );
	SetAllMotorsAngularVelocityDrive 0x40749 hash c36ad821 params:( None bEnableSwingDrive;None bEnableTwistDrive;None bSkipCustomPhysicsType; );
	SetAllMotorsAngularPositionDrive 0x40738 hash 7fb36547 params:( None bEnableSwingDrive;None bEnableTwistDrive;None bSkipCustomPhysicsType; );
	SetAllMotorsAngularDriveParams 0x40728 hash 85976296 params:( None InSpring;None InDamping;None InForceLimit;None bSkipCustomPhysicsType; );
	SetAllBodiesSimulatePhysics 0x40719 hash 6b61bfc7 params:( None bNewSimulate; );
	SetAllBodiesPhysicsBlendWeight 0x40709 hash d472d770 params:( None PhysicsBlendWeight;None bSkipCustomPhysicsType; );
	SetAllBodiesBelowSimulatePhysics 0x406f8 hash a38f1060 params:( None InBoneName;None bNewSimulate;None bIncludeSelf; );
	SetAllBodiesBelowPhysicsBlendWeight 0x406e5 hash e5b20d69 params:( None InBoneName;None PhysicsBlendWeight;None bSkipCustomPhysicsType;None bIncludeSelf; );
	ResumeClothingSimulation 0x406d8 hash 9c5cf4f3 params:(  );
	ResetClothTeleportMode 0x406cc hash 1e1c156 params:(  );
	ResetAnimInstanceDynamics 0x406be hash 334c99da params:( UnderlyingType InTeleportType; );
	ResetAllowedAnimCurveEvaluation 0x406ad hash 5e95412 params:(  );
	ResetAllBodiesSimulatePhysics 0x4069d hash 3285e5be params:(  );
	PlayAnimation 0x40695 hash 25d0c7b params:( AnimationAsset NewAnimToPlay;None bLooping; );
	Play 0x3fb72 hash 7c8ac63b params:( None bLooping; );
	OverrideAnimationData 0x40689 hash 4155a63f params:( AnimationAsset InAnimToPlay;None bIsLooping;None bIsPlaying;None Position;None PlayRate; );
	LinkAnimGraphByTag 0x4067f hash f102eea1 params:( None InTag;Class InClass; );
	LinkAnimClassLayers 0x40674 hash cea48fe params:( Class InClass; );
	K2_GetClosestPointOnPhysicsAsset 0x40663 hash e43835e8 params:( Vector WorldPosition;Vector ClosestWorldPosition;Vector Normal;None BoneName;None Distance;None ReturnValue; );
	IsPlaying 0x3e2d2 hash 5c6af535 params:( None ReturnValue; );
	IsClothingSimulationSuspended 0x40653 hash 6886df49 params:( None ReturnValue; );
	IsBodyGravityEnabled 0x40648 hash fdd04ba0 params:( None BoneName;None ReturnValue; );
	HasValidAnimationInstance 0x4063a hash 6c70ebe6 params:( None ReturnValue; );
	GetTeleportRotationThreshold 0x4062b hash f7632271 params:( None ReturnValue; );
	GetTeleportDistanceThreshold 0x4061c hash 14b2416c params:( None ReturnValue; );
	GetSkeletalCenterOfMass 0x4060f hash 9ab49f24 params:( Vector ReturnValue; );
	GetPostProcessInstance 0x40603 hash a2f7d05f params:( AnimInstance ReturnValue; );
	GetPosition 0x405fc hash 91b017fa params:( None ReturnValue; );
	GetPlayRate 0x3fb53 hash 81d34827 params:( None ReturnValue; );
	GetMorphTarget 0x405f4 hash 245f7ef2 params:( None MorphTargetName;None ReturnValue; );
	GetLinkedAnimLayerInstanceByGroup 0x405e2 hash 181a885b params:( None InGroup;AnimInstance ReturnValue; );
	GetLinkedAnimLayerInstanceByClass 0x405d0 hash 17cea044 params:( Class InClass;AnimInstance ReturnValue; );
	GetLinkedAnimGraphInstancesByTag 0x405bf hash ce6d8f12 params:( None InTag;OutLinkedInstances OutLinkedInstances; );
	GetLinkedAnimGraphInstanceByTag 0x405ae hash 40f7c1bf params:( None InTag;AnimInstance ReturnValue; );
	GetDisablePostProcessBlueprint 0x4059e hash 5e432d53 params:( None ReturnValue; );
	GetDisableAnimCurves 0x40593 hash ca195736 params:( None ReturnValue; );
	GetCurrentJointAngles 0x40587 hash de86b6a6 params:( None InBoneName;None Swing1Angle;None TwistAngle;None Swing2Angle; );
	GetClothMaxDistanceScale 0x4057a hash d5f894b8 params:( None ReturnValue; );
	GetClothingSimulationInteractor 0x40569 hash e64ecddd params:( ClothingSimulationInteractor ReturnValue; );
	GetBoneMass 0x40562 hash 9a0ec23d params:( None BoneName;None bScaleMass;None ReturnValue; );
	GetAnimInstance 0x40559 hash bd45251f params:( AnimInstance ReturnValue; );
	GetAnimClass 0x40552 hash c3fa040 params:( Class ReturnValue; );
	GetAnimationMode 0x40549 hash ce888d0a params:( EAnimationMode ReturnValue; );
	GetAllowedAnimCurveEvaluate 0x4053a hash adecaf0e params:( None ReturnValue; );
	ForceClothNextUpdateTeleportAndReset 0x40527 hash f7ca24b5 params:(  );
	ForceClothNextUpdateTeleport 0x40518 hash 26bdc7f params:(  );
	FindConstraintBoneName 0x4050c hash 91cee310 params:( None ConstraintIndex;None ReturnValue; );
	ClearMorphTargets 0x40502 hash ba778f2c params:(  );
	BreakConstraint 0x404f9 hash 6ee61a8f params:( Vector Impulse;Vector HitLocation;None InBoneName; );
	BindClothToMasterPoseComponent 0x404e9 hash 5c2c9b55 params:(  );
	AllowAnimCurveEvaluation 0x404dc hash 9e8a9526 params:( None NameOfCurve;None bAllow; );
	AddImpulseToAllBodiesBelow 0x404ce hash 78808a98 params:( Vector Impulse;None BoneName;None bVelChange;None bIncludeSelf; );
	AddForceToAllBodiesBelow 0x404c1 hash 4c917f88 params:( Vector Force;None BoneName;None bAccelChange;None bIncludeSelf; );
	AccumulateAllBodiesBelowPhysicsBlendWeight 0x404ab hash 708b3a1 params:( None InBoneName;None AddPhysicsBlendWeight;None bSkipCustomPhysicsType; );
};


instance 1ab5e050f40
class AnimInstance public : Object
{
	// Fields
	Skeleton* CurrentSkeleton; // 0x28
	BYTE RootMotionMode; // 0x30
	bool bUseMultiThreadedAnimationUpdate; // 0x31
	bool bUsingCopyPoseFromMesh; // 0x31
	bool bQueueMontageEvents; // 0x31
	MulticastInlineDelegateProperty OnMontageBlendingOut; // 0x38 property 0x1ab7180a580 hash 0xb7a5ed1a
	MulticastInlineDelegateProperty OnMontageStarted; // 0x48 property 0x1ab7180a600 hash 0xb7a5ed1a
	MulticastInlineDelegateProperty OnMontageEnded; // 0x58 property 0x1ab7180a680 hash 0xb7a5ed1a
	MulticastInlineDelegateProperty OnAllMontageInstancesEnded; // 0x68 property 0x1ab7180a700 hash 0xb7a5ed1a
	AnimNotifyQueue NotifyQueue; // 0x100
	TArray ActiveAnimNotifyState; // 0x170

	// Functions
	UnlockAIResources 0x40b51 hash 5c1b9796 params:( None bUnlockMovement;None UnlockAILogic; );
	UnlinkAnimClassLayers 0x408ae hash f646f8e1 params:( Class InClass; );
	TryGetPawnOwner 0x40b48 hash d38de7a5 params:( Pawn ReturnValue; );
	StopSlotAnimation 0x40b3e hash e6284cd params:( None InBlendOutTime;None SlotNodeName; );
	SnapshotPose 0x4086c hash 765b284c params:( PoseSnapshot Snapshot; );
	SetRootMotionMode 0x40b34 hash 51fdd190 params:( ERootMotionMode Value; );
	SetMorphTarget 0x40814 hash eb62327e params:( None MorphTargetName;None Value; );
	SavePoseSnapshot 0x40b2b hash ad964ffb params:( None SnapshotName; );
	ResetDynamics 0x40b23 hash 9e17aca0 params:( UnderlyingType InTeleportType; );
	PlaySlotAnimationAsDynamicMontage 0x40b11 hash abe27ec1 params:( AnimSequenceBase Asset;None SlotNodeName;None BlendInTime;None BlendOutTime;None InPlayRate;None LoopCount;None BlendOutTriggerTime;None InTimeToStartMontageAt;AnimMontage ReturnValue; );
	PlaySlotAnimation 0x40b07 hash 1b85b5dd params:( AnimSequenceBase Asset;None SlotNodeName;None BlendInTime;None BlendOutTime;None InPlayRate;None LoopCount;None ReturnValue; );
	Montage_Stop 0x40b00 hash da15bc75 params:( None InBlendOutTime;AnimMontage Montage; );
	Montage_SetPosition 0x40af5 hash 58e4ad10 params:( AnimMontage Montage;None NewPosition; );
	Montage_SetPlayRate 0x40aea hash 4907dd3d params:( AnimMontage Montage;None NewPlayRate; );
	Montage_SetNextSection 0x40ade hash ff122f params:( None SectionNameToChange;None NextSection;AnimMontage Montage; );
	Montage_Resume 0x40ad6 hash b3146ac0 params:( AnimMontage Montage; );
	Montage_Play 0x40acf hash da13f385 params:( AnimMontage MontageToPlay;None InPlayRate;UnderlyingType ReturnValueType;None InTimeToStartMontageAt;None bStopAllMontages;None ReturnValue; );
	Montage_Pause 0x40ac7 hash 1c8cb0ad params:( AnimMontage Montage; );
	Montage_JumpToSectionsEnd 0x40ab9 hash 805809cd params:( None SectionName;AnimMontage Montage; );
	Montage_JumpToSection 0x40aad hash 8a5c2ca3 params:( None SectionName;AnimMontage Montage; );
	Montage_IsPlaying 0x40aa3 hash 3c5600bf params:( AnimMontage Montage;None ReturnValue; );
	Montage_IsActive 0x40a9a hash 3b554027 params:( AnimMontage Montage;None ReturnValue; );
	Montage_GetPosition 0x40a8f hash 188c2e04 params:( AnimMontage Montage;None ReturnValue; );
	Montage_GetPlayRate 0x40a84 hash 8af5e31 params:( AnimMontage Montage;None ReturnValue; );
	Montage_GetIsStopped 0x40a79 hash 25bcb16a params:( AnimMontage Montage;None ReturnValue; );
	Montage_GetCurrentSection 0x40a6b hash 51344da7 params:( AnimMontage Montage;None ReturnValue; );
	Montage_GetBlendTime 0x40a60 hash db4b9523 params:( AnimMontage Montage;None ReturnValue; );
	LockAIResources 0x40a57 hash 13e96133 params:( None bLockMovement;None LockAILogic; );
	LinkAnimGraphByTag 0x4067f hash f102eea1 params:( None InTag;Class InClass; );
	LinkAnimClassLayers 0x40674 hash cea48fe params:( Class InClass; );
	IsSyncGroupBetweenMarkers 0x40a49 hash 56f9f48a params:( None InSyncGroupName;None PreviousMarker;None NextMarker;None bRespectMarkerOrder;None ReturnValue; );
	IsPlayingSlotAnimation 0x40a3d hash 2e78eb17 params:( AnimSequenceBase Asset;None SlotNodeName;None ReturnValue; );
	IsAnyMontagePlaying 0x40a32 hash ab1b9ac8 params:( None ReturnValue; );
	HasMarkerBeenHitThisFrame 0x40a24 hash df9a3c5 params:( None SyncGroup;None MarkerName;None ReturnValue; );
	GetTimeToClosestMarker 0x40a18 hash a6c27536 params:( None SyncGroup;None MarkerName;None OutMarkerTime;None ReturnValue; );
	GetSyncGroupPosition 0x40a0d hash 1c5ced24 params:( None InSyncGroupName;MarkerSyncAnimPosition ReturnValue; );
	GetRelevantAnimTimeRemainingFraction 0x409fa hash 67d9616a params:( None MachineIndex;None StateIndex;None ReturnValue; );
	GetRelevantAnimTimeRemaining 0x409eb hash 3a9461b4 params:( None MachineIndex;None StateIndex;None ReturnValue; );
	GetRelevantAnimTimeFraction 0x409dc hash 7d824410 params:( None MachineIndex;None StateIndex;None ReturnValue; );
	GetRelevantAnimTime 0x409d1 hash 7affe5a params:( None MachineIndex;None StateIndex;None ReturnValue; );
	GetRelevantAnimLength 0x409c5 hash a0b7fa0d params:( None MachineIndex;None StateIndex;None ReturnValue; );
	GetOwningComponent 0x409bb hash aa7aa3ea params:( SkeletalMeshComponent ReturnValue; );
	GetOwningActor 0x409b3 hash ff933b90 params:( Actor ReturnValue; );
	GetLinkedAnimLayerInstanceByGroup 0x405e2 hash 181a885b params:( None InGroup;AnimInstance ReturnValue; );
	GetLinkedAnimLayerInstanceByClass 0x405d0 hash 17cea044 params:( Class InClass;AnimInstance ReturnValue; );
	GetLinkedAnimGraphInstancesByTag 0x405bf hash ce6d8f12 params:( None InTag;OutLinkedInstances OutLinkedInstances; );
	GetLinkedAnimGraphInstanceByTag 0x405ae hash 40f7c1bf params:( None InTag;AnimInstance ReturnValue; );
	GetInstanceTransitionTimeElapsedFraction 0x4099e hash 6bedc828 params:( None MachineIndex;None TransitionIndex;None ReturnValue; );
	GetInstanceTransitionTimeElapsed 0x4098d hash fe44ea72 params:( None MachineIndex;None TransitionIndex;None ReturnValue; );
	GetInstanceTransitionCrossfadeDuration 0x40979 hash 1cf0b825 params:( None MachineIndex;None TransitionIndex;None ReturnValue; );
	GetInstanceStateWeight 0x4096d hash 9dc572c3 params:( None MachineIndex;None StateIndex;None ReturnValue; );
	GetInstanceMachineWeight 0x40960 hash 6298e017 params:( None MachineIndex;None ReturnValue; );
	GetInstanceCurrentStateElapsedTime 0x4094e hash 898201cb params:( None MachineIndex;None ReturnValue; );
	GetInstanceAssetPlayerTimeFromEndFraction 0x40938 hash ce6365b7 params:( None AssetPlayerIndex;None ReturnValue; );
	GetInstanceAssetPlayerTimeFromEnd 0x40926 hash fb996901 params:( None AssetPlayerIndex;None ReturnValue; );
	GetInstanceAssetPlayerTimeFraction 0x40914 hash 4d830dac params:( None AssetPlayerIndex;None ReturnValue; );
	GetInstanceAssetPlayerTime 0x40906 hash f93eebf6 params:( None AssetPlayerIndex;None ReturnValue; );
	GetInstanceAssetPlayerLength 0x408f7 hash 31b8bea9 params:( None AssetPlayerIndex;None ReturnValue; );
	GetCurveValue 0x25e95 hash 1c8dad67 params:( None CurveName;None ReturnValue; );
	GetCurrentStateName 0x408ec hash cb9c2faa params:( None MachineIndex;None ReturnValue; );
	GetCurrentActiveMontage 0x408df hash 74e4a3cf params:( AnimMontage ReturnValue; );
	GetAllCurveNames 0x408d6 hash 635aab97 params:( OutNames OutNames; );
	GetActiveCurveNames 0x408cb hash 7a2db35a params:( UnderlyingType CurveType;OutNames OutNames; );
	ClearMorphTargets 0x40502 hash ba778f2c params:(  );
	CalculateDirection 0x408c1 hash d339bd54 params:( Vector Velocity;Rotator BaseRotation;None ReturnValue; );
	BlueprintUpdateAnimation 0x22d65 hash 4e5b943d params:( None DeltaTimeX; );
	BlueprintPostEvaluateAnimation 0x22d55 hash 576f2257 params:(  );
	BlueprintInitializeAnimation 0x22d46 hash 29a8f98c params:(  );
	BlueprintBeginPlay 0x22d3c hash 623af295 params:(  );
};


instance 1ab5e058d40
class AudioComponent public : SceneComponent
{
	// Fields
	SoundBase* Sound; // 0x1f0
	TArray InstanceParameters; // 0x1f8
	SoundClass* SoundClassOverride; // 0x208
	bool bAutoDestroy; // 0x210
	bool bStopWhenOwnerDestroyed; // 0x210
	bool bShouldRemainActiveIfDropped; // 0x210
	bool bAllowSpatialization; // 0x210
	bool bOverrideAttenuation; // 0x210
	bool bOverrideSubtitlePriority; // 0x210
	bool bIsUISound; // 0x210
	bool bEnableLowPassFilter; // 0x210
	bool bOverridePriority; // 0x211
	bool bSuppressSubtitles; // 0x211
	bool bAutoManageAttachment; // 0x212
	FName AudioComponentUserID; // 0x218
	float PitchModulationMin; // 0x220
	float PitchModulationMax; // 0x224
	float VolumeModulationMin; // 0x228
	float VolumeModulationMax; // 0x22c
	float VolumeMultiplier; // 0x230
	int EnvelopeFollowerAttackTime; // 0x234
	int EnvelopeFollowerReleaseTime; // 0x238
	float Priority; // 0x23c
	float SubtitlePriority; // 0x240
	SoundEffectSourcePresetChain* SourceEffectChain; // 0x248
	float PitchMultiplier; // 0x250
	float LowPassFilterFrequency; // 0x254
	SoundAttenuation* AttenuationSettings; // 0x260
	SoundAttenuationSettings AttenuationOverrides; // 0x268
	SoundConcurrency* ConcurrencySettings; // 0x558
	SetProperty ConcurrencySet; // 0x560 property 0x1ab71165e20 hash 0xb0194396
	EAttachmentRule AutoAttachLocationRule; // 0x5bc
	EAttachmentRule AutoAttachRotationRule; // 0x5bd
	EAttachmentRule AutoAttachScaleRule; // 0x5be
	MulticastInlineDelegateProperty OnAudioFinished; // 0x5c0 property 0x1ab7180dc00 hash 0xb7a5ed1a
	MulticastInlineDelegateProperty OnAudioPlaybackPercent; // 0x5e8 property 0x1ab7180dc80 hash 0xb7a5ed1a
	MulticastInlineDelegateProperty OnAudioSingleEnvelopeValue; // 0x610 property 0x1ab7180dd00 hash 0xb7a5ed1a
	MulticastInlineDelegateProperty OnAudioMultiEnvelopeValue; // 0x638 property 0x1ab7180dd80 hash 0xb7a5ed1a
	SoundModulation Modulation; // 0x660
	DelegateProperty OnQueueSubtitles; // 0x670 property 0x1ab7180de80 hash 0xe1aec4e5
	WeakObjectProperty AutoAttachParent; // 0x680 property 0x1ab7180df00 hash 0x24388009
	FName AutoAttachSocketName; // 0x688

	// Functions
	StopDelayed 0x40d01 hash 41ef32e3 params:( None DelayTime; );
	Stop 0x3e2ef hash 7c8c8f2b params:(  );
	SetWaveParameter 0x40cf8 hash ab2ed445 params:( None InName;SoundWave InWave; );
	SetVolumeMultiplier 0x3e2e0 hash a2b02ad0 params:( None NewVolumeMultiplier; );
	SetUISound 0x40cf2 hash c7838a78 params:( None bInUISound; );
	SetSubmixSend 0x3e2d8 hash a875d853 params:( SoundSubmix Submix;None SendLevel; );
	SetSourceBusSendPreEffect 0x40ce4 hash 4324a12a params:( SoundSourceBus SoundSourceBus;None SourceBusSendLevel; );
	SetSourceBusSendPostEffect 0x40cd6 hash ad49589 params:( SoundSourceBus SoundSourceBus;None SourceBusSendLevel; );
	SetSound 0x40cd1 hash 8878803a params:( SoundBase NewSound; );
	SetPitchMultiplier 0x40cc7 hash 6cacc050 params:( None NewPitchMultiplier; );
	SetPaused 0x40cc1 hash 8f8bcc53 params:( None bPause; );
	SetLowPassFilterFrequency 0x3ea99 hash 74b7e1f2 params:( None InLowPassFilterFrequency; );
	SetLowPassFilterEnabled 0x40cb4 hash 558f8deb params:( None InLowPassFilterEnabled; );
	SetIntParameter 0x40cab hash 1630511d params:( None InName;None inInt; );
	SetFloatParameter 0x40ca1 hash 44c33de8 params:( None InName;None InFloat; );
	SetBoolParameter 0x40c98 hash 4c732b1e params:( None InName;None InBool; );
	Play 0x3fb72 hash 7c8ac63b params:( None StartTime; );
	IsPlaying 0x3e2d2 hash 5c6af535 params:( None ReturnValue; );
	HasCookedFFTData 0x40c8f hash 20474fb0 params:( None ReturnValue; );
	HasCookedAmplitudeEnvelopeData 0x40c7f hash 24c1af73 params:( None ReturnValue; );
	GetPlayState 0x40c78 hash bc58823c params:( UnderlyingType ReturnValue; );
	GetCookedFFTDataForAllPlayingSounds 0x40c65 hash d2e3ce4 params:( OutSoundWaveSpectralData OutSoundWaveSpectralData;None ReturnValue; );
	GetCookedFFTData 0x40c5c hash dc701a74 params:( FrequenciesToGet FrequenciesToGet;OutSoundWaveSpectralData OutSoundWaveSpectralData;None ReturnValue; );
	GetCookedEnvelopeDataForAllPlayingSounds 0x40c47 hash 5b7d94e2 params:( OutEnvelopeData OutEnvelopeData;None ReturnValue; );
	GetCookedEnvelopeData 0x40c3b hash da5a8732 params:( None OutEnvelopeData;None ReturnValue; );
	FadeOut 0x40c36 hash f9baf36d params:( None FadeOutDuration;None FadeVolumeLevel;UnderlyingType FadeCurve; );
	FadeIn 0x40c32 hash b23bf70c params:( None FadeInDuration;None FadeVolumeLevel;None StartTime;UnderlyingType FadeCurve; );
	BP_GetAttenuationSettingsToApply 0x40c21 hash 707247c params:( SoundAttenuationSettings OutAttenuationSettings;None ReturnValue; );
	AdjustVolume 0x40c1a hash 9b8bac48 params:( None AdjustVolumeDuration;None AdjustVolumeLevel;UnderlyingType FadeCurve; );
	AdjustAttenuation 0x40c10 hash e674439c params:( SoundAttenuationSettings InAttenuationSettings; );
};


instance 1ab5e057d80
class AssetImportData public : Object
{
	// Fields

};


instance 1ab5e055740
class AssetUserData public : Object
{
	// Fields

};


instance 1ab5e093340
class OnlineBlueprintCallProxyBase public : Object
{
	// Fields

	// Functions
	Activate 0x3df71 hash 5374ac56 params:(  );
};


instance 1ab5e0913c0
class Player public : Object
{
	// Fields
	PlayerController* PlayerController; // 0x30
	int CurrentNetSpeed; // 0x38
	int ConfiguredInternetSpeed; // 0x3c
	int ConfiguredLanSpeed; // 0x40

};


instance 1ab5e091600
class NetConnection public : Player
{
	// Fields
	TArray Children; // 0x48
	NetDriver* Driver; // 0x58
	PackageMap* PackageMapClass; // 0x60
	PackageMap* PackageMap; // 0x68
	TArray OpenChannels; // 0x70
	TArray SentTemporaries; // 0x80
	Actor* ViewTarget; // 0x90
	Actor* OwningActor; // 0x98
	int MaxPacket; // 0xa0
	bool InternalAck; // 0xa4
	UniqueNetIdRepl PlayerId; // 0x160
	double LastReceiveTime; // 0x1d0
	TArray ChannelsToTick; // 0x14a8

};


instance 1ab5e090f40
class NetDriver public : Object
{
	// Fields
	FString NetConnectionClassName; // 0x30
	FString ReplicationDriverClassName; // 0x40
	int MaxDownloadSize; // 0x50
	bool bClampListenServerTickRate; // 0x54
	int NetServerMaxTickRate; // 0x58
	int MaxNetTickRate; // 0x5c
	int MaxInternetClientRate; // 0x60
	int MaxClientRate; // 0x64
	float ServerTravelPause; // 0x68
	float SpawnPrioritySeconds; // 0x6c
	float RelevantTimeout; // 0x70
	float KeepAliveTime; // 0x74
	float InitialConnectTimeout; // 0x78
	float ConnectionTimeout; // 0x7c
	float TimeoutMultiplierForUnoptimizedBuilds; // 0x80
	bool bNoTimeouts; // 0x84
	bool bNeverApplyNetworkEmulationSettings; // 0x85
	NetConnection* ServerConnection; // 0x88
	TArray ClientConnections; // 0x90
	int RecentlyDisconnectedTrackingTime; // 0x100
	World* World; // 0x140
	Package* WorldPackage; // 0x148
	Object* NetConnectionClass; // 0x170
	Object* ReplicationDriverClass; // 0x178
	Property* RoleProperty; // 0x180
	Property* RemoteRoleProperty; // 0x188
	FName NetDriverName; // 0x190
	TArray ChannelDefinitions; // 0x198
	MapProperty ChannelDefinitionMap; // 0x1a8 property 0x1ab711657e0 hash 0xadd0fb88
	TArray ActorChannelPool; // 0x1f8
	float Time; // 0x210
	ReplicationDriver* ReplicationDriver; // 0x6e0

};


instance 1ab5e0901c0
class BlueprintAsyncActionBase public : Object
{
	// Fields

	// Functions
	Activate 0x3df71 hash 5374ac56 params:(  );
};


instance 1ab5e0988c0
class OnlineEngineInterface public : Object
{
	// Fields

};


instance 1ab5e098440
class DeveloperSettings public : Object
{
	// Fields

};


instance 1ab5e097fc0
class OnlineSession public : Object
{
	// Fields

};


instance 1ab5e095740
class Subsystem public : Object
{
	// Fields

};


instance 1ab5e095980
class DynamicSubsystem public : Subsystem
{
	// Fields

};


instance 1ab5e095bc0
class EngineSubsystem public : DynamicSubsystem
{
	// Fields

};


instance 1ab5e09c580
class MovementComponent public : ActorComponent
{
	// Fields
	SceneComponent* UpdatedComponent; // 0xb0
	PrimitiveComponent* UpdatedPrimitive; // 0xb8
	Vector Velocity; // 0xc4
	Vector PlaneConstraintNormal; // 0xd0
	Vector PlaneConstraintOrigin; // 0xdc
	bool bUpdateOnlyIfRendered; // 0xe8
	bool bAutoUpdateTickRegistration; // 0xe8
	bool bTickBeforeOwner; // 0xe8
	bool bAutoRegisterUpdatedComponent; // 0xe8
	bool bConstrainToPlane; // 0xe8
	bool bSnapToPlaneAtStart; // 0xe8
	bool bAutoRegisterPhysicsVolumeUpdates; // 0xe8
	bool bComponentShouldUpdatePhysicsVolume; // 0xe8
	EPlaneConstraintAxisSetting PlaneConstraintAxisSetting; // 0xeb

	// Functions
	StopMovementImmediately 0x42115 hash 40c41d8a params:(  );
	SnapUpdatedComponentToPlane 0x42106 hash 34fbba04 params:(  );
	SetUpdatedComponent 0x420fb hash d9d14f2b params:( SceneComponent NewUpdatedComponent; );
	SetPlaneConstraintOrigin 0x420ee hash 3b07d02e params:( Vector PlaneOrigin; );
	SetPlaneConstraintNormal 0x420e1 hash 388165ef params:( Vector PlaneNormal; );
	SetPlaneConstraintFromVectors 0x420d1 hash a39a6e20 params:( Vector Forward;Vector Up; );
	SetPlaneConstraintEnabled 0x420c3 hash 90535df1 params:( None bEnabled; );
	SetPlaneConstraintAxisSetting 0x420b3 hash 9ef7219 params:( UnderlyingType NewAxisSetting; );
	PhysicsVolumeChanged 0x420a8 hash 7cea62aa params:( PhysicsVolume NewVolume; );
	K2_MoveUpdatedComponent 0x4209b hash ed1c6df2 params:( Vector Delta;Rotator NewRotation;HitResult OutHit;None bSweep;None bTeleport;None ReturnValue; );
	K2_GetModifiedMaxSpeed 0x4208f hash d518b119 params:( None ReturnValue; );
	K2_GetMaxSpeedModifier 0x42083 hash 92aa0727 params:( None ReturnValue; );
	IsExceedingMaxSpeed 0x42078 hash 7e3bc8c4 params:( None MaxSpeed;None ReturnValue; );
	GetPlaneConstraintOrigin 0x4206b hash 88163da2 params:( Vector ReturnValue; );
	GetPlaneConstraintNormal 0x4205e hash 858fd363 params:( Vector ReturnValue; );
	GetPlaneConstraintAxisSetting 0x4204e hash a0680d params:( UnderlyingType ReturnValue; );
	GetPhysicsVolume 0x3e0be hash 788da600 params:( PhysicsVolume ReturnValue; );
	GetMaxSpeed 0x42047 hash a154b2fc params:( None ReturnValue; );
	GetGravityZ 0x42040 hash 136dd65 params:( None ReturnValue; );
	ConstrainNormalToPlane 0x42034 hash 94eeccf2 params:( Vector Normal;Vector ReturnValue; );
	ConstrainLocationToPlane 0x42027 hash c3a08ea2 params:( Vector Location;Vector ReturnValue; );
	ConstrainDirectionToPlane 0x42019 hash b6520eaa params:( Vector Direction;Vector ReturnValue; );
};


instance 1ab5e09c7c0
class NavMovementComponent public : MovementComponent
{
	// Fields
	NavAgentProperties NavAgentProps; // 0xf0
	float FixedPathBrakingDistance; // 0x120
	bool bUpdateNavAgentWithOwnersCollision; // 0x124
	bool bUseAccelerationForPaths; // 0x124
	bool bUseFixedBrakingDistanceForPaths; // 0x124
	MovementProperties MovementState; // 0x125
	Object* PathFollowingComp; // 0x128

	// Functions
	StopMovementKeepPathing 0x4214d hash 9934e6c6 params:(  );
	StopActiveMovement 0x42143 hash d01cf572 params:(  );
	IsSwimming 0x4213d hash f21f34c params:( None ReturnValue; );
	IsMovingOnGround 0x42134 hash 56221cfd params:( None ReturnValue; );
	IsFlying 0x4212f hash 1a11e26a params:( None ReturnValue; );
	IsFalling 0x42129 hash 41bbc35e params:( None ReturnValue; );
	IsCrouching 0x42122 hash ee214083 params:( None ReturnValue; );
};


instance 1ab5e09ca00
class PawnMovementComponent public : NavMovementComponent
{
	// Fields
	Pawn* PawnOwner; // 0x130

	// Functions
	K2_GetInputVector 0x42189 hash ca65a724 params:( Vector ReturnValue; );
	IsMoveInputIgnored 0x3f3b6 hash 911901b0 params:( None ReturnValue; );
	GetPendingInputVector 0x4217d hash 6614f00d params:( Vector ReturnValue; );
	GetPawnOwner 0x42176 hash 19164ec6 params:( Pawn ReturnValue; );
	GetLastInputVector 0x4216c hash 735051c params:( Vector ReturnValue; );
	ConsumeInputVector 0x42162 hash 8889f4a2 params:( Vector ReturnValue; );
	AddInputVector 0x4215a hash 9dc1b111 params:( Vector WorldVector;None bForce; );
};


instance 1ab5e09af00
class ShapeComponent public : PrimitiveComponent
{
	// Fields
	BodySetup* ShapeBodySetup; // 0x3d8
	NavAreaBase* AreaClass; // 0x3e0
	Color ShapeColor; // 0x3e8
	bool bDrawOnlyIfSelected; // 0x3ec
	bool bShouldCollideWhenPlacing; // 0x3ec
	bool bDynamicObstacle; // 0x3ec

};


instance 1ab5e09b140
class BoxComponent public : ShapeComponent
{
	// Fields
	Vector BoxExtent; // 0x3f0
	float LineThickness; // 0x3fc

	// Functions
	SetBoxExtent 0x4240e hash e18502f2 params:( Vector InBoxExtent;None bUpdateOverlaps; );
	GetUnscaledBoxExtent 0x42403 hash 53f7f1b5 params:( Vector ReturnValue; );
	GetScaledBoxExtent 0x423f9 hash dbd4e352 params:( Vector ReturnValue; );
};


instance 1ab5e09a840
class CameraComponent public : SceneComponent
{
	// Fields
	float FieldOfView; // 0x1f0
	float OrthoWidth; // 0x1f4
	float OrthoNearClipPlane; // 0x1f8
	float OrthoFarClipPlane; // 0x1fc
	float AspectRatio; // 0x200
	bool bConstrainAspectRatio; // 0x204
	bool bUseFieldOfViewForLOD; // 0x204
	bool bLockToHmd; // 0x204
	bool bUsePawnControlRotation; // 0x204
	BYTE ProjectionMode; // 0x205
	float PostProcessBlendWeight; // 0x240
	PostProcessSettings PostProcessSettings; // 0x270

	// Functions
	SetUseFieldOfViewForLOD 0x424d9 hash db7b9418 params:( None bInUseFieldOfViewForLOD; );
	SetProjectionMode 0x424cf hash 7f23b553 params:( ECameraProjectionMode InProjectionMode; );
	SetPostProcessBlendWeight 0x424c1 hash 7276c003 params:( None InPostProcessBlendWeight; );
	SetOrthoWidth 0x424b9 hash 6249e0dd params:( None InOrthoWidth; );
	SetOrthoNearClipPlane 0x424ad hash 5ada189b params:( None InOrthoNearClipPlane; );
	SetOrthoFarClipPlane 0x424a2 hash 35c6a8ee params:( None InOrthoFarClipPlane; );
	SetFieldOfView 0x4249a hash 52f930a5 params:( None InFieldOfView; );
	SetConstraintAspectRatio 0x4248d hash 335c1975 params:( None bInConstrainAspectRatio; );
	SetAspectRatio 0x42485 hash 74104a70 params:( None InAspectRatio; );
	RemoveBlendable 0x4247c hash 76b53e8c params:( BlendableInterface InBlendableObject; );
	OnCameraMeshHiddenChanged 0x4246e hash ba47156e params:(  );
	GetCameraView 0x42466 hash 6801aee9 params:( None DeltaTime;MinimalViewInfo DesiredView; );
	AddOrUpdateBlendable 0x4245b hash 236616eb params:( BlendableInterface InBlendableObject;None InWeight; );
};


instance 1ab5e09fb80
class StaticMeshComponent public : MeshComponent
{
	// Fields
	int ForcedLodModel; // 0x400
	int PreviousLODLevel; // 0x404
	int MinLOD; // 0x408
	int SubDivisionStepSize; // 0x40c
	StaticMesh* StaticMesh; // 0x410
	Color WireframeColorOverride; // 0x418
	bool bEvaluateWorldPositionOffset; // 0x41c
	bool bOverrideWireframeColor; // 0x41c
	bool bOverrideMinLod; // 0x41c
	bool bOverrideNavigationExport; // 0x41c
	bool bForceNavigationObstacle; // 0x41c
	bool bDisallowMeshPaintPerInstance; // 0x41c
	bool bIgnoreInstanceForTextureStreaming; // 0x41c
	bool bOverrideLightMapRes; // 0x41c
	bool bCastDistanceFieldIndirectShadow; // 0x41d
	bool bOverrideDistanceFieldSelfShadowBias; // 0x41d
	bool bUseSubDivisions; // 0x41d
	bool bUseDefaultCollision; // 0x41d
	bool bReverseCulling; // 0x41d
	int OverriddenLightMapRes; // 0x420
	float DistanceFieldIndirectShadowMinVisibility; // 0x424
	float DistanceFieldSelfShadowBias; // 0x428
	float StreamingDistanceMultiplier; // 0x42c
	TArray LODData; // 0x430
	TArray StreamingTextureData; // 0x440
	LightmassPrimitiveSettings LightmassSettings; // 0x450

	// Functions
	SetStaticMesh 0x425bb hash 610fef86 params:( StaticMesh NewMesh;None ReturnValue; );
	SetReverseCulling 0x425b1 hash eee44b9b params:( None ReverseCulling; );
	SetForcedLodModel 0x425a7 hash 69faa4f4 params:( None NewForcedLodModel; );
	SetDistanceFieldSelfShadowBias 0x42597 hash a669cb8f params:( None NewValue; );
	OnRep_StaticMesh 0x4258e hash 5813383d params:( StaticMesh OldStaticMesh; );
	GetLocalBounds 0x42586 hash fec7e2fb params:( Vector Min;Vector Max; );
};


instance 1ab5e09fdc0
class InstancedStaticMeshComponent public : StaticMeshComponent
{
	// Fields
	TArray PerInstanceSMData; // 0x468
	int InstancingRandomSeed; // 0x478
	int InstanceStartCullDistance; // 0x47c
	int InstanceEndCullDistance; // 0x480
	TArray InstanceReorderTable; // 0x488
	int NumPendingLightmaps; // 0x4e0
	TArray CachedMappings; // 0x4e8

	// Functions
	UpdateInstanceTransform 0x3fc24 hash 25c5c799 params:( None InstanceIndex;Transform NewInstanceTransform;None bWorldSpace;None bMarkRenderStateDirty;None bTeleport;None ReturnValue; );
	SetCullDistances 0x4260d hash 962161df params:( None StartCullDistance;None EndCullDistance; );
	RemoveInstance 0x3fc05 hash 5b373f08 params:( None InstanceIndex;None ReturnValue; );
	GetInstanceTransform 0x3fbfa hash 26888f16 params:( None InstanceIndex;Transform OutInstanceTransform;None bWorldSpace;None ReturnValue; );
	GetInstancesOverlappingSphere 0x425fd hash 46147cdb params:( Vector Center;None Radius;None bSphereInWorldSpace;ReturnValue ReturnValue; );
	GetInstancesOverlappingBox 0x425ef hash 782541d params:( Box Box;None bBoxInWorldSpace;ReturnValue ReturnValue; );
	GetInstanceCount 0x3fbf1 hash 29b68783 params:( None ReturnValue; );
	ClearInstances 0x3fbe9 hash 1504e9b4 params:(  );
	BatchUpdateInstancesTransforms 0x425df hash ac483d01 params:( None StartInstanceIndex;NewInstancesTransforms NewInstancesTransforms;None bWorldSpace;None bMarkRenderStateDirty;None bTeleport;None ReturnValue; );
	BatchUpdateInstancesTransform 0x425cf hash 52cbe2ce params:( None StartInstanceIndex;None NumInstances;Transform NewInstancesTransform;None bWorldSpace;None bMarkRenderStateDirty;None bTeleport;None ReturnValue; );
	AddInstanceWorldSpace 0x425c3 hash d83f1a57 params:( Transform WorldTransform;None ReturnValue; );
	AddInstance 0x3fbe2 hash 63a7de63 params:( Transform InstanceTransform;None ReturnValue; );
};


instance 1ab5e099640
class HierarchicalInstancedStaticMeshComponent public : InstancedStaticMeshComponent
{
	// Fields
	TArray SortedInstances; // 0x508
	int NumBuiltInstances; // 0x518
	Box BuiltInstanceBounds; // 0x520
	Box UnbuiltInstanceBounds; // 0x53c
	TArray UnbuiltInstanceBoundsList; // 0x558
	bool bEnableDensityScaling; // 0x568
	int OcclusionLayerNumNodes; // 0x570
	BoxSphereBounds CacheMeshExtendedBounds; // 0x574
	bool bDisableCollision; // 0x594
	int InstanceCountToRender; // 0x598

	// Functions
	RemoveInstances 0x42616 hash c21f207b params:( InstancesToRemove InstancesToRemove;None ReturnValue; );
};


instance 1ab5e09e980
class SphereComponent public : ShapeComponent
{
	// Fields
	float SphereRadius; // 0x3f0

	// Functions
	SetSphereRadius 0x42692 hash bf4a580 params:( None InSphereRadius;None bUpdateOverlaps; );
	GetUnscaledSphereRadius 0x42685 hash 4413c163 params:( None ReturnValue; );
	GetShapeScale 0x4267d hash f473123e params:( None ReturnValue; );
	GetScaledSphereRadius 0x42671 hash 92ed29e0 params:( None ReturnValue; );
};


instance 1ab5e0a64c0
class Controller public : Actor
{
	// Fields
	PlayerState* PlayerState; // 0x220
	MulticastInlineDelegateProperty OnInstigatedAnyDamage; // 0x230 property 0x1ab718ef900 hash 0xb7a5ed1a
	FName StateName; // 0x240
	Pawn* Pawn; // 0x248
	Character* Character; // 0x258
	SceneComponent* TransformComponent; // 0x260
	Rotator ControlRotation; // 0x280
	bool bAttachToPawn; // 0x28c

	// Functions
	UnPossess 0x42e12 hash 3d38f138 params:(  );
	StopMovement 0x42e0b hash e781d036 params:(  );
	SetInitialLocationAndRotation 0x42dfb hash 52c9db77 params:( Vector NewLocation;Rotator NewRotation; );
	SetIgnoreMoveInput 0x42df1 hash a4364e5c params:( None bNewMoveInput; );
	SetIgnoreLookInput 0x42de7 hash 22e127da params:( None bNewLookInput; );
	SetControlRotation 0x42ddd hash 292dc8a2 params:( Rotator NewRotation; );
	ResetIgnoreMoveInput 0x42dd2 hash d8d7ea73 params:(  );
	ResetIgnoreLookInput 0x42dc7 hash 5782c3f1 params:(  );
	ResetIgnoreInputFlags 0x42dbb hash 16bec929 params:(  );
	ReceiveUnPossess 0x25c0d hash bc2978bb params:( Pawn UnpossessedPawn; );
	ReceivePossess 0x25c05 hash 8c53d0b8 params:( Pawn PossessedPawn; );
	ReceiveInstigatedAnyDamage 0x25bf7 hash de481cfb params:( None Damage;DamageType DamageType;Actor DamagedActor;Actor DamageCauser; );
	Possess 0x42db6 hash 1d4105f5 params:( Pawn InPawn; );
	OnRep_PlayerState 0x3f3f0 hash 36e1aff6 params:(  );
	OnRep_Pawn 0x42db0 hash 9a5fc81e params:(  );
	LineOfSightTo 0x42da8 hash fd3881c4 params:( Actor Other;Vector ViewPoint;None bAlternateChecks;None ReturnValue; );
	K2_GetPawn 0x42da2 hash 1ee2fbd7 params:( Pawn ReturnValue; );
	IsPlayerController 0x42d98 hash a08b60b2 params:( None ReturnValue; );
	IsMoveInputIgnored 0x3f3b6 hash 911901b0 params:( None ReturnValue; );
	IsLookInputIgnored 0x42d8e hash c25c816e params:( None ReturnValue; );
	IsLocalPlayerController 0x42d81 hash 554ea9bd params:( None ReturnValue; );
	IsLocalController 0x42d77 hash 86c5b2d0 params:( None ReturnValue; );
	GetViewTarget 0x42d6f hash 1a4c2a27 params:( Actor ReturnValue; );
	GetDesiredRotation 0x42d65 hash f9025595 params:( Rotator ReturnValue; );
	GetControlRotation 0x3f352 hash 242f16 params:( Rotator ReturnValue; );
	ClientSetRotation 0x25bed hash 6f538460 params:( Rotator NewRotation;None bResetCamera; );
	ClientSetLocation 0x25be3 hash be20d469 params:( Vector NewLocation;Rotator NewRotation; );
	CastToPlayerController 0x42d59 hash 121488a4 params:( PlayerController ReturnValue; );
};


instance 1ab5e0ade40
class Brush public : Actor
{
	// Fields
	BYTE BrushType; // 0x218
	Color BrushColor; // 0x21c
	int PolyFlags; // 0x220
	bool bColored; // 0x224
	bool bSolidWhenSelected; // 0x224
	bool bPlaceableFromClassBrowser; // 0x224
	bool bNotForClientOrServer; // 0x224
	Model* Brush; // 0x228
	BrushComponent* BrushComponent; // 0x230
	bool bInManipulation; // 0x238
	TArray SavedSelections; // 0x240

};


instance 1ab5e0a4c00
class Volume public : Brush
{
	// Fields

};


instance 1ab5e0ad780
class AmbientSound public : Actor
{
	// Fields
	AudioComponent* AudioComponent; // 0x218

	// Functions
	Stop 0x3e2ef hash 7c8c8f2b params:(  );
	Play 0x3fb72 hash 7c8ac63b params:( None StartTime; );
	FadeOut 0x40c36 hash f9baf36d params:( None FadeOutDuration;None FadeVolumeLevel; );
	FadeIn 0x40c32 hash b23bf70c params:( None FadeInDuration;None FadeVolumeLevel; );
	AdjustVolume 0x40c1a hash 9b8bac48 params:( None AdjustVolumeDuration;None AdjustVolumeLevel; );
};


instance 1ab5e0ace80
class AnimNotify public : Object
{
	// Fields

	// Functions
	Received_Notify 0x233a3 hash 65bf89e4 params:( SkeletalMeshComponent MeshComp;AnimSequenceBase Animation;None ReturnValue; );
	GetNotifyName 0x2339b hash 82a9beff params:( None ReturnValue; );
};


instance 1ab5e0abec0
class AnimNotify_PlaySound public : AnimNotify
{
	// Fields
	SoundBase* Sound; // 0x38
	float VolumeMultiplier; // 0x40
	float PitchMultiplier; // 0x44
	bool bFollow; // 0x48
	FName AttachName; // 0x4c

};


instance 1ab5e0b37c0
class CameraShake public : Object
{
	// Fields
	bool bSingleInstance; // 0x28
	float OscillationDuration; // 0x2c
	float OscillationBlendInTime; // 0x30
	float OscillationBlendOutTime; // 0x34
	ROscillator RotOscillation; // 0x38
	VOscillator LocOscillation; // 0x5c
	FOscillator FOVOscillation; // 0x80
	float AnimPlayRate; // 0x8c
	float AnimScale; // 0x90
	float AnimBlendInTime; // 0x94
	float AnimBlendOutTime; // 0x98
	float RandomAnimSegmentDuration; // 0x9c
	CameraAnim* Anim; // 0xa0
	bool bRandomAnimSegment; // 0xa8
	PlayerCameraManager* CameraOwner; // 0xc0
	float ShakeScale; // 0x148
	float OscillatorTimeRemaining; // 0x14c
	CameraAnimInst* AnimInst; // 0x150

	// Functions
	ReceiveStopShake 0x252de hash af14ed9a params:( None bImmediately; );
	ReceivePlayShake 0x252d5 hash cee00eaa params:( None Scale; );
	ReceiveIsFinished 0x252cb hash 4280f72e params:( None ReturnValue; );
	BlueprintUpdateCameraShake 0x252bd hash 885eaa52 params:( None DeltaTime;None Alpha;MinimalViewInfo POV;MinimalViewInfo ModifiedPOV; );
};


instance 1ab5e0b3100
class CharacterMovementComponent public : PawnMovementComponent
{
	// Fields
	Character* CharacterOwner; // 0x148
	float GravityScale; // 0x150
	float MaxStepHeight; // 0x154
	float JumpZVelocity; // 0x158
	float JumpOffJumpZFactor; // 0x15c
	float WalkableFloorAngle; // 0x160
	float WalkableFloorZ; // 0x164
	BYTE MovementMode; // 0x168
	BYTE CustomMovementMode; // 0x169
	ENetworkSmoothingMode NetworkSmoothingMode; // 0x16a
	float GroundFriction; // 0x16c
	float MaxWalkSpeed; // 0x18c
	float MaxWalkSpeedCrouched; // 0x190
	float MaxSwimSpeed; // 0x194
	float MaxFlySpeed; // 0x198
	float MaxCustomMovementSpeed; // 0x19c
	float MaxAcceleration; // 0x1a0
	float MinAnalogWalkSpeed; // 0x1a4
	float BrakingFrictionFactor; // 0x1a8
	float BrakingFriction; // 0x1ac
	float BrakingSubStepTime; // 0x1b0
	float BrakingDecelerationWalking; // 0x1b4
	float BrakingDecelerationFalling; // 0x1b8
	float BrakingDecelerationSwimming; // 0x1bc
	float BrakingDecelerationFlying; // 0x1c0
	float AirControl; // 0x1c4
	float AirControlBoostMultiplier; // 0x1c8
	float AirControlBoostVelocityThreshold; // 0x1cc
	float FallingLateralFriction; // 0x1d0
	float CrouchedHalfHeight; // 0x1d4
	float Buoyancy; // 0x1d8
	float PerchRadiusThreshold; // 0x1dc
	float PerchAdditionalHeight; // 0x1e0
	Rotator RotationRate; // 0x1e4
	bool bUseSeparateBrakingFriction; // 0x1f0
	bool bApplyGravityWhileJumping; // 0x1f0
	bool bUseControllerDesiredRotation; // 0x1f0
	bool bOrientRotationToMovement; // 0x1f0
	bool bSweepWhileNavWalking; // 0x1f0
	bool bMovementInProgress; // 0x1f0
	bool bEnableScopedMovementUpdates; // 0x1f0
	bool bEnableServerDualMoveScopedMovementUpdates; // 0x1f1
	bool bForceMaxAccel; // 0x1f1
	bool bRunPhysicsWithNoController; // 0x1f1
	bool bForceNextFloorCheck; // 0x1f1
	bool bShrinkProxyCapsule; // 0x1f1
	bool bCanWalkOffLedges; // 0x1f1
	bool bCanWalkOffLedgesWhenCrouching; // 0x1f1
	bool bNetworkSkipProxyPredictionOnNetUpdate; // 0x1f2
	bool bNetworkAlwaysReplicateTransformUpdateTimestamp; // 0x1f2
	bool bDeferUpdateMoveComponent; // 0x1f2
	bool bEnablePhysicsInteraction; // 0x1f2
	bool bTouchForceScaledToMass; // 0x1f2
	bool bPushForceScaledToMass; // 0x1f2
	bool bPushForceUsingZOffset; // 0x1f2
	bool bScalePushForceToVelocity; // 0x1f3
	SceneComponent* DeferredUpdatedMoveComponent; // 0x1f8
	float MaxOutOfWaterStepHeight; // 0x200
	float OutofWaterZ; // 0x204
	float Mass; // 0x208
	float StandingDownwardForceScale; // 0x20c
	float InitialPushForceFactor; // 0x210
	float PushForceFactor; // 0x214
	float PushForcePointZOffsetFactor; // 0x218
	float TouchForceFactor; // 0x21c
	float MinTouchForce; // 0x220
	float MaxTouchForce; // 0x224
	float RepulsionForce; // 0x228
	Vector Acceleration; // 0x22c
	Quat LastUpdateRotation; // 0x240
	Vector LastUpdateLocation; // 0x250
	Vector LastUpdateVelocity; // 0x25c
	float ServerLastTransformUpdateTimeStamp; // 0x268
	float ServerLastClientGoodMoveAckTime; // 0x26c
	float ServerLastClientAdjustmentTime; // 0x270
	Vector PendingImpulseToApply; // 0x274
	Vector PendingForceToApply; // 0x280
	float AnalogInputModifier; // 0x28c
	float MaxSimulationTimeStep; // 0x29c
	int MaxSimulationIterations; // 0x2a0
	int MaxJumpApexAttemptsPerSimulation; // 0x2a4
	float MaxDepenetrationWithGeometry; // 0x2a8
	float MaxDepenetrationWithGeometryAsProxy; // 0x2ac
	float MaxDepenetrationWithPawn; // 0x2b0
	float MaxDepenetrationWithPawnAsProxy; // 0x2b4
	float NetworkSimulatedSmoothLocationTime; // 0x2b8
	float NetworkSimulatedSmoothRotationTime; // 0x2bc
	float ListenServerNetworkSimulatedSmoothLocationTime; // 0x2c0
	float ListenServerNetworkSimulatedSmoothRotationTime; // 0x2c4
	float NetProxyShrinkRadius; // 0x2c8
	float NetProxyShrinkHalfHeight; // 0x2cc
	float NetworkMaxSmoothUpdateDistance; // 0x2d0
	float NetworkNoSmoothUpdateDistance; // 0x2d4
	float NetworkMinTimeBetweenClientAckGoodMoves; // 0x2d8
	float NetworkMinTimeBetweenClientAdjustments; // 0x2dc
	float NetworkMinTimeBetweenClientAdjustmentsLargeCorrection; // 0x2e0
	float NetworkLargeClientCorrectionDistance; // 0x2e4
	float LedgeCheckThreshold; // 0x2e8
	float JumpOutOfWaterPitch; // 0x2ec
	FindFloorResult CurrentFloor; // 0x2f0
	BYTE DefaultLandMovementMode; // 0x384
	BYTE DefaultWaterMovementMode; // 0x385
	BYTE GroundMovementMode; // 0x386
	bool bMaintainHorizontalGroundVelocity; // 0x387
	bool bImpartBaseVelocityX; // 0x387
	bool bImpartBaseVelocityY; // 0x387
	bool bImpartBaseVelocityZ; // 0x387
	bool bImpartBaseAngularVelocity; // 0x387
	bool bJustTeleported; // 0x387
	bool bNetworkUpdateReceived; // 0x387
	bool bNetworkMovementModeChanged; // 0x387
	bool bIgnoreClientMovementErrorChecksAndCorrection; // 0x388
	bool bServerAcceptClientAuthoritativePosition; // 0x388
	bool bNotifyApex; // 0x388
	bool bCheatFlying; // 0x388
	bool bWantsToCrouch; // 0x388
	bool bCrouchMaintainsBaseLocation; // 0x388
	bool bIgnoreBaseRotation; // 0x388
	bool bFastAttachedMove; // 0x388
	bool bAlwaysCheckFloor; // 0x389
	bool bUseFlatBaseForFloorChecks; // 0x389
	bool bPerformingJumpOff; // 0x389
	bool bWantsToLeaveNavWalking; // 0x389
	bool bUseRVOAvoidance; // 0x389
	bool bRequestedMoveUseAcceleration; // 0x389
	bool bWasSimulatingRootMotion; // 0x389
	bool bAllowPhysicsRotationDuringAnimRootMotion; // 0x38a
	bool bHasRequestedVelocity; // 0x38a
	bool bRequestedMoveWithMaxSpeed; // 0x38a
	bool bWasAvoidanceUpdated; // 0x38a
	bool bProjectNavMeshWalking; // 0x38a
	bool bProjectNavMeshOnBothWorldChannels; // 0x38a
	float AvoidanceConsiderationRadius; // 0x39c
	Vector RequestedVelocity; // 0x3a0
	int AvoidanceUID; // 0x3ac
	NavAvoidanceMask AvoidanceGroup; // 0x3b0
	NavAvoidanceMask GroupsToAvoid; // 0x3b4
	NavAvoidanceMask GroupsToIgnore; // 0x3b8
	float AvoidanceWeight; // 0x3bc
	Vector PendingLaunchVelocity; // 0x3c0
	float NavMeshProjectionInterval; // 0x470
	float NavMeshProjectionTimer; // 0x474
	float NavMeshProjectionInterpSpeed; // 0x478
	float NavMeshProjectionHeightScaleUp; // 0x47c
	float NavMeshProjectionHeightScaleDown; // 0x480
	float NavWalkingFloorDistTolerance; // 0x484
	CharacterMovementComponentPostPhysicsTickFunction PostPhysicsTickFunction; // 0x488
	float MinTimeBetweenTimeStampResets; // 0x4d0
	RootMotionSourceGroup CurrentRootMotion; // 0x4d8
	RootMotionMovementParams RootMotionParams; // 0x660
	Vector AnimRootMotionVelocity; // 0x6a0

	// Functions
	SetWalkableFloorZ 0x435ea hash 50c4e890 params:( None InWalkableFloorZ; );
	SetWalkableFloorAngle 0x435de hash 81a0621d params:( None InWalkableFloorAngle; );
	SetMovementMode 0x435d5 hash 3eca4521 params:( EMovementMode NewMovementMode;None NewCustomMode; );
	SetGroupsToIgnoreMask 0x42223 hash 1eea3d44 params:( NavAvoidanceMask GroupMask; );
	SetGroupsToIgnore 0x42219 hash 85aafc38 params:( None GroupFlags; );
	SetGroupsToAvoidMask 0x4220e hash 99a29713 params:( NavAvoidanceMask GroupMask; );
	SetGroupsToAvoid 0x42205 hash d4f8c687 params:( None GroupFlags; );
	SetAvoidanceGroupMask 0x421e4 hash 25890c14 params:( NavAvoidanceMask GroupMask; );
	SetAvoidanceGroup 0x421da hash 6012e308 params:( None GroupFlags; );
	SetAvoidanceEnabled 0x421cf hash c06e326 params:( None bEnable; );
	K2_GetWalkableFloorZ 0x435ca hash 5179a3c0 params:( None ReturnValue; );
	K2_GetWalkableFloorAngle 0x435bd hash f79f354d params:( None ReturnValue; );
	K2_GetModifiedMaxAcceleration 0x435ad hash 539fdcb2 params:( None ReturnValue; );
	K2_FindFloor 0x435a6 hash fef76564 params:( Vector CapsuleLocation;FindFloorResult FloorResult; );
	K2_ComputeFloorDist 0x4359b hash 4b6049f4 params:( Vector CapsuleLocation;None LineDistance;None SweepDistance;None SweepRadius;FindFloorResult FloorResult; );
	IsWalking 0x43595 hash 5e593fce params:( None ReturnValue; );
	IsWalkable 0x4358f hash 297ca484 params:( HitResult Hit;None ReturnValue; );
	GetValidPerchRadius 0x43584 hash ebb0428f params:( None ReturnValue; );
	GetPerchRadiusThreshold 0x43577 hash 106533ec params:( None ReturnValue; );
	GetMovementBase 0x4356e hash 976ade4b params:( PrimitiveComponent ReturnValue; );
	GetMinAnalogSpeed 0x43564 hash 26bedfec params:( None ReturnValue; );
	GetMaxJumpHeightWithJumpTime 0x43555 hash dc376de7 params:( None ReturnValue; );
	GetMaxJumpHeight 0x4354c hash b0d4dfc0 params:( None ReturnValue; );
	GetMaxBrakingDeceleration 0x4353e hash b8a16298 params:( None ReturnValue; );
	GetMaxAcceleration 0x43534 hash 44908135 params:( None ReturnValue; );
	GetLastUpdateVelocity 0x43528 hash ebb06b4b params:( Vector ReturnValue; );
	GetLastUpdateRotation 0x4351c hash 4e24b70c params:( Rotator ReturnValue; );
	GetLastUpdateLocation 0x43510 hash 9cf20715 params:( Vector ReturnValue; );
	GetImpartedMovementBaseVelocity 0x434ff hash c7651c30 params:( Vector ReturnValue; );
	GetCurrentAcceleration 0x434f3 hash ffe5cbb2 params:( Vector ReturnValue; );
	GetCharacterOwner 0x434e9 hash bf5cae5d params:( Character ReturnValue; );
	GetAnalogInputModifier 0x434dd hash 41252f16 params:( None ReturnValue; );
	DisableMovement 0x434d4 hash bb581ba4 params:(  );
	ClearAccumulatedForces 0x434c8 hash 3da3ff6 params:(  );
	CapsuleTouched 0x434c0 hash 7528be1e params:( PrimitiveComponent OverlappedComp;Actor Other;PrimitiveComponent OtherComp;None OtherBodyIndex;None bFromSweep;HitResult SweepResult; );
	CalcVelocity 0x434b9 hash 31df2707 params:( None DeltaTime;None Friction;None bFluid;None BrakingDeceleration; );
	AddImpulse 0x3f5b9 hash 7a5fed params:( Vector Impulse;None bVelocityChange; );
	AddForce 0x3f59d hash 789f74dd params:( Vector Force; );
};


instance 1ab5e0b25c0
class Info public : Actor
{
	// Fields

};


instance 1ab5e0b2800
class GameStateBase public : Info
{
	// Fields
	GameModeBase* GameModeClass; // 0x218
	GameModeBase* AuthorityGameMode; // 0x220
	SpectatorPawn* SpectatorClass; // 0x228
	TArray PlayerArray; // 0x230
	bool bReplicatedHasBegunPlay; // 0x240
	float ReplicatedWorldTimeSeconds; // 0x244
	float ServerWorldTimeSecondsDelta; // 0x248
	float ServerWorldTimeSecondsUpdateFrequency; // 0x24c

	// Functions
	OnRep_SpectatorClass 0x436b7 hash cfbaeb3 params:(  );
	OnRep_ReplicatedWorldTimeSeconds 0x436a6 hash 6f97644b params:(  );
	OnRep_ReplicatedHasBegunPlay 0x43697 hash 749ba368 params:(  );
	OnRep_GameModeClass 0x4368c hash c7d3a1fd params:(  );
	HasMatchStarted 0x43683 hash c812c3a5 params:( None ReturnValue; );
	HasBegunPlay 0x4367c hash c59147a8 params:( None ReturnValue; );
	GetServerWorldTimeSeconds 0x4366e hash d4daa562 params:( None ReturnValue; );
	GetPlayerStartTime 0x43664 hash 93dfc98f params:( Controller Controller;None ReturnValue; );
	GetPlayerRespawnDelay 0x43658 hash ce8221e1 params:( Controller Controller;None ReturnValue; );
};


instance 1ab5e0b2a40
class GameState public : GameStateBase
{
	// Fields
	FName MatchState; // 0x258
	FName PreviousMatchState; // 0x260
	int ElapsedTime; // 0x268

	// Functions
	OnRep_MatchState 0x436cc hash 37ad376 params:(  );
	OnRep_ElapsedTime 0x436c2 hash 4613e235 params:(  );
};


instance 1ab5e0b0d00
class GameInstance public : Object
{
	// Fields
	TArray LocalPlayers; // 0x38
	OnlineSession* OnlineSession; // 0x48
	TArray ReferencedObjects; // 0x50

	// Functions
	ReceiveShutdown 0x27d9b hash c5778a64 params:(  );
	ReceiveInit 0x27d94 hash 2a9102bc params:(  );
	HandleTravelError 0x27d8a hash 76f10889 params:( ETravelFailure FailureType; );
	HandleNetworkError 0x27d80 hash 88d36ee5 params:( ENetworkFailure FailureType;None bIsServer; );
	DebugRemovePlayer 0x437e7 hash 5c871ec7 params:( None ControllerId; );
	DebugCreatePlayer 0x437dd hash ec53798d params:( None ControllerId; );
};


instance 1ab5e0b0640
class GameModeBase public : Info
{
	// Fields
	FString OptionsString; // 0x218
	GameSession* GameSessionClass; // 0x228
	GameStateBase* GameStateClass; // 0x230
	PlayerController* PlayerControllerClass; // 0x238
	PlayerState* PlayerStateClass; // 0x240
	HUD* HUDClass; // 0x248
	Pawn* DefaultPawnClass; // 0x250
	SpectatorPawn* SpectatorClass; // 0x258
	PlayerController* ReplaySpectatorPlayerControllerClass; // 0x260
	ServerStatReplicator* ServerStatReplicatorClass; // 0x268
	GameSession* GameSession; // 0x270
	GameStateBase* GameState; // 0x278
	ServerStatReplicator* ServerStatReplicator; // 0x280
	FText DefaultPlayerName; // 0x288
	bool bUseSeamlessTravel; // 0x2a0
	bool bStartPlayersAsSpectators; // 0x2a0
	bool bPauseable; // 0x2a0

	// Functions
	StartPlay 0x439c4 hash 16791e9 params:(  );
	SpawnDefaultPawnFor 0x27ee7 hash 48f11030 params:( Controller NewPlayer;Actor StartSpot;Pawn ReturnValue; );
	SpawnDefaultPawnAtTransform 0x27ed8 hash 843a6bda params:( Controller NewPlayer;Transform SpawnTransform;Pawn ReturnValue; );
	ShouldReset 0x27ed1 hash b1a97e37 params:( Actor ActorToReset;None ReturnValue; );
	ReturnToMainMenuHost 0x439b9 hash b2736000 params:(  );
	RestartPlayerAtTransform 0x439ac hash 34aac468 params:( Controller NewPlayer;Transform SpawnTransform; );
	RestartPlayerAtPlayerStart 0x4399e hash e7e44407 params:( Controller NewPlayer;Actor StartSpot; );
	RestartPlayer 0x43996 hash e330d597 params:( Controller NewPlayer; );
	ResetLevel 0x43990 hash aa49f60 params:(  );
	PlayerCanRestart 0x27ec8 hash 6d6e91a9 params:( PlayerController Player;None ReturnValue; );
	MustSpectate 0x27ec1 hash d8037a67 params:( PlayerController NewPlayerController;None ReturnValue; );
	K2_PostLogin 0x27eba hash bc029be0 params:( PlayerController NewPlayer; );
	K2_OnSwapPlayerControllers 0x27eac hash 970377d params:( PlayerController OldPC;PlayerController NewPC; );
	K2_OnRestartPlayer 0x27ea2 hash a443a8d0 params:( Controller NewPlayer; );
	K2_OnLogout 0x27e9b hash b7030898 params:( Controller ExitingController; );
	K2_OnChangeName 0x27e92 hash d02ef1a5 params:( Controller Other;None NewName;None bNameChange; );
	K2_FindPlayerStart 0x43986 hash 20a8531d params:( Controller Player;None IncomingName;Actor ReturnValue; );
	InitStartSpot 0x27e8a hash aec4046d params:( Actor StartSpot;Controller NewPlayer; );
	InitializeHUDForPlayer 0x27e7e hash 1fc4970c params:( PlayerController NewPlayer; );
	HasMatchStarted 0x43683 hash c812c3a5 params:( None ReturnValue; );
	HandleStartingNewPlayer 0x27e71 hash ae749474 params:( PlayerController NewPlayer; );
	GetNumSpectators 0x4397d hash 11c9587d params:( None ReturnValue; );
	GetNumPlayers 0x43975 hash 4fbbf1b5 params:( None ReturnValue; );
	GetDefaultPawnClassForController 0x27e60 hash bca86dc1 params:( Controller InController;Class ReturnValue; );
	FindPlayerStart 0x27e57 hash 6462fee1 params:( Controller Player;None IncomingName;Actor ReturnValue; );
	ChoosePlayerStart 0x27e4d hash eed73061 params:( Controller Player;Actor ReturnValue; );
	ChangeName 0x4396f hash 270afbcc params:( Controller Controller;None NewName;None bNameChange; );
	CanSpectate 0x27e46 hash a1d32690 params:( PlayerController Viewer;PlayerState ViewTarget;None ReturnValue; );
};


instance 1ab5e0b0880
class GameMode public : GameModeBase
{
	// Fields
	FName MatchState; // 0x2b8
	bool bDelayedStart; // 0x2c0
	int NumSpectators; // 0x2c4
	int NumPlayers; // 0x2c8
	int NumBots; // 0x2cc
	float MinRespawnDelay; // 0x2d0
	int NumTravellingPlayers; // 0x2d4
	LocalMessage* EngineMessageClass; // 0x2d8
	TArray InactivePlayerArray; // 0x2e0
	float InactivePlayerStateLifeSpan; // 0x2f0
	int MaxInactivePlayers; // 0x2f4
	bool bHandleDedicatedServerReplays; // 0x2f8

	// Functions
	StartMatch 0x439fb hash 2e1dcbc0 params:(  );
	SetBandwidthLimit 0x439f1 hash 26d16de5 params:( None AsyncIOBandwidthLimit; );
	Say 0x426ff hash b8820f2 params:( None Msg; );
	RestartGame 0x439ea hash da1b2364 params:(  );
	ReadyToStartMatch 0x27e18 hash b48d7438 params:( None ReturnValue; );
	ReadyToEndMatch 0x27e0f hash 6df5921 params:( None ReturnValue; );
	K2_OnSetMatchState 0x27e05 hash cd8a5df8 params:( None NewState; );
	IsMatchInProgress 0x439e0 hash d0d7fb5a params:( None ReturnValue; );
	HasMatchEnded 0x439d8 hash 593760ee params:( None ReturnValue; );
	GetMatchState 0x439d0 hash 540318b3 params:( None ReturnValue; );
	EndMatch 0x41566 hash 2be42ea9 params:(  );
	AbortMatch 0x439ca hash a03949aa params:(  );
};


instance 1ab5e0b91c0
class Engine public : Object
{
	// Fields
	Font* TinyFont; // 0x30
	SoftObjectPath TinyFontName; // 0x38
	Font* SmallFont; // 0x50
	SoftObjectPath SmallFontName; // 0x58
	Font* MediumFont; // 0x70
	SoftObjectPath MediumFontName; // 0x78
	Font* LargeFont; // 0x90
	SoftObjectPath LargeFontName; // 0x98
	Font* SubtitleFont; // 0xb0
	SoftObjectPath SubtitleFontName; // 0xb8
	TArray AdditionalFonts; // 0xd0
	TArray AdditionalFontNames; // 0xe8
	Console* ConsoleClass; // 0xf8
	SoftClassPath ConsoleClassName; // 0x100
	GameViewportClient* GameViewportClientClass; // 0x118
	SoftClassPath GameViewportClientClassName; // 0x120
	LocalPlayer* LocalPlayerClass; // 0x138
	SoftClassPath LocalPlayerClassName; // 0x140
	WorldSettings* WorldSettingsClass; // 0x158
	SoftClassPath WorldSettingsClassName; // 0x160
	SoftClassPath NavigationSystemClassName; // 0x178
	NavigationSystemBase* NavigationSystemClass; // 0x190
	SoftClassPath NavigationSystemConfigClassName; // 0x198
	NavigationSystemConfig* NavigationSystemConfigClass; // 0x1b0
	SoftClassPath AvoidanceManagerClassName; // 0x1b8
	AvoidanceManager* AvoidanceManagerClass; // 0x1d0
	PhysicsCollisionHandler* PhysicsCollisionHandlerClass; // 0x1d8
	SoftClassPath PhysicsCollisionHandlerClassName; // 0x1e0
	SoftClassPath GameUserSettingsClassName; // 0x1f8
	GameUserSettings* GameUserSettingsClass; // 0x210
	SoftClassPath AIControllerClassName; // 0x218
	GameUserSettings* GameUserSettings; // 0x230
	LevelScriptActor* LevelScriptActorClass; // 0x238
	SoftClassPath LevelScriptActorClassName; // 0x240
	SoftClassPath DefaultBlueprintBaseClassName; // 0x258
	SoftClassPath GameSingletonClassName; // 0x270
	Object* GameSingleton; // 0x288
	SoftClassPath AssetManagerClassName; // 0x290
	AssetManager* AssetManager; // 0x2a8
	Texture2D* DefaultTexture; // 0x2b0
	SoftObjectPath DefaultTextureName; // 0x2b8
	Texture* DefaultDiffuseTexture; // 0x2d0
	SoftObjectPath DefaultDiffuseTextureName; // 0x2d8
	Texture2D* DefaultBSPVertexTexture; // 0x2f0
	SoftObjectPath DefaultBSPVertexTextureName; // 0x2f8
	Texture2D* HighFrequencyNoiseTexture; // 0x310
	SoftObjectPath HighFrequencyNoiseTextureName; // 0x318
	Texture2D* DefaultBokehTexture; // 0x330
	SoftObjectPath DefaultBokehTextureName; // 0x338
	Texture2D* DefaultBloomKernelTexture; // 0x350
	SoftObjectPath DefaultBloomKernelTextureName; // 0x358
	Material* WireframeMaterial; // 0x370
	FString WireframeMaterialName; // 0x378
	Material* HairDefaultMaterial; // 0x388
	FString HairDefaultMaterialName; // 0x390
	Material* HairDebugMaterial; // 0x3a0
	FString HairDebugMaterialName; // 0x3a8
	Material* DebugMeshMaterial; // 0x3b8
	SoftObjectPath DebugMeshMaterialName; // 0x3c0
	Material* EmissiveMeshMaterial; // 0x3d8
	SoftObjectPath EmissiveMeshMaterialName; // 0x3e0
	Material* LevelColorationLitMaterial; // 0x3f8
	FString LevelColorationLitMaterialName; // 0x400
	Material* LevelColorationUnlitMaterial; // 0x410
	FString LevelColorationUnlitMaterialName; // 0x418
	Material* LightingTexelDensityMaterial; // 0x428
	FString LightingTexelDensityName; // 0x430
	Material* ShadedLevelColorationLitMaterial; // 0x440
	FString ShadedLevelColorationLitMaterialName; // 0x448
	Material* ShadedLevelColorationUnlitMaterial; // 0x458
	FString ShadedLevelColorationUnlitMaterialName; // 0x460
	Material* RemoveSurfaceMaterial; // 0x470
	SoftObjectPath RemoveSurfaceMaterialName; // 0x478
	Material* VertexColorMaterial; // 0x490
	FString VertexColorMaterialName; // 0x498
	Material* VertexColorViewModeMaterial_ColorOnly; // 0x4a8
	FString VertexColorViewModeMaterialName_ColorOnly; // 0x4b0
	Material* VertexColorViewModeMaterial_AlphaAsColor; // 0x4c0
	FString VertexColorViewModeMaterialName_AlphaAsColor; // 0x4c8
	Material* VertexColorViewModeMaterial_RedOnly; // 0x4d8
	FString VertexColorViewModeMaterialName_RedOnly; // 0x4e0
	Material* VertexColorViewModeMaterial_GreenOnly; // 0x4f0
	FString VertexColorViewModeMaterialName_GreenOnly; // 0x4f8
	Material* VertexColorViewModeMaterial_BlueOnly; // 0x508
	FString VertexColorViewModeMaterialName_BlueOnly; // 0x510
	SoftObjectPath DebugEditorMaterialName; // 0x520
	Material* ConstraintLimitMaterial; // 0x538
	MaterialInstanceDynamic* ConstraintLimitMaterialX; // 0x540
	MaterialInstanceDynamic* ConstraintLimitMaterialXAxis; // 0x548
	MaterialInstanceDynamic* ConstraintLimitMaterialY; // 0x550
	MaterialInstanceDynamic* ConstraintLimitMaterialYAxis; // 0x558
	MaterialInstanceDynamic* ConstraintLimitMaterialZ; // 0x560
	MaterialInstanceDynamic* ConstraintLimitMaterialZAxis; // 0x568
	MaterialInstanceDynamic* ConstraintLimitMaterialPrismatic; // 0x570
	Material* InvalidLightmapSettingsMaterial; // 0x578
	SoftObjectPath InvalidLightmapSettingsMaterialName; // 0x580
	Material* PreviewShadowsIndicatorMaterial; // 0x598
	SoftObjectPath PreviewShadowsIndicatorMaterialName; // 0x5a0
	Material* ArrowMaterial; // 0x5b8
	MaterialInstanceDynamic* ArrowMaterialYellow; // 0x5c0
	SoftObjectPath ArrowMaterialName; // 0x5c8
	LinearColor LightingOnlyBrightness; // 0x5e0
	TArray ShaderComplexityColors; // 0x5f0
	TArray QuadComplexityColors; // 0x600
	TArray LightComplexityColors; // 0x610
	TArray StationaryLightOverlapColors; // 0x620
	TArray LODColorationColors; // 0x630
	TArray HLODColorationColors; // 0x640
	TArray StreamingAccuracyColors; // 0x650
	float MaxPixelShaderAdditiveComplexityCount; // 0x660
	float MaxES2PixelShaderAdditiveComplexityCount; // 0x664
	float MaxES3PixelShaderAdditiveComplexityCount; // 0x668
	float MinLightMapDensity; // 0x66c
	float IdealLightMapDensity; // 0x670
	float MaxLightMapDensity; // 0x674
	bool bRenderLightMapDensityGrayscale; // 0x678
	float RenderLightMapDensityGrayscaleScale; // 0x67c
	float RenderLightMapDensityColorScale; // 0x680
	LinearColor LightMapDensityVertexMappedColor; // 0x684
	LinearColor LightMapDensitySelectedColor; // 0x694
	TArray StatColorMappings; // 0x6a8
	PhysicalMaterial* DefaultPhysMaterial; // 0x6b8
	SoftObjectPath DefaultPhysMaterialName; // 0x6c0
	TArray ActiveGameNameRedirects; // 0x6d8
	TArray ActiveClassRedirects; // 0x6e8
	TArray ActivePluginRedirects; // 0x6f8
	TArray ActiveStructRedirects; // 0x708
	Texture2D* PreIntegratedSkinBRDFTexture; // 0x718
	SoftObjectPath PreIntegratedSkinBRDFTextureName; // 0x720
	Texture2D* BlueNoiseTexture; // 0x738
	SoftObjectPath BlueNoiseTextureName; // 0x740
	Texture2D* MiniFontTexture; // 0x758
	SoftObjectPath MiniFontTextureName; // 0x760
	Texture* WeightMapPlaceholderTexture; // 0x778
	SoftObjectPath WeightMapPlaceholderTextureName; // 0x780
	Texture2D* LightMapDensityTexture; // 0x798
	SoftObjectPath LightMapDensityTextureName; // 0x7a0
	GameViewportClient* GameViewport; // 0x7c0
	TArray DeferredCommands; // 0x7c8
	int TickCycles; // 0x7d8
	int GameCycles; // 0x7dc
	int ClientCycles; // 0x7e0
	float NearClipPlane; // 0x7e4
	bool bHardwareSurveyEnabled; // 0x7e8
	bool bSubtitlesEnabled; // 0x7e8
	bool bSubtitlesForcedOff; // 0x7e8
	int MaximumLoopIterationCount; // 0x7ec
	bool bCanBlueprintsTickByDefault; // 0x7f0
	bool bOptimizeAnimBlueprintMemberVariableAccess; // 0x7f0
	bool bAllowMultiThreadedAnimationUpdate; // 0x7f0
	bool bEnableEditorPSysRealtimeLOD; // 0x7f0
	bool bSmoothFrameRate; // 0x7f0
	bool bUseFixedFrameRate; // 0x7f0
	float FixedFrameRate; // 0x7f4
	FloatRange SmoothedFrameRateRange; // 0x7f8
	EngineCustomTimeStep* DefaultCustomTimeStep; // 0x808
	EngineCustomTimeStep* CurrentCustomTimeStep; // 0x810
	SoftClassPath CustomTimeStepClassName; // 0x818
	TimecodeProvider* DefaultTimecodeProvider; // 0x830
	TimecodeProvider* CustomTimecodeProvider; // 0x838
	SoftClassPath DefaultTimecodeProviderClassName; // 0x840
	SoftClassPath TimecodeProviderClassName; // 0x858
	FrameRate DefaultTimecodeFrameRate; // 0x870
	bool bCheckForMultiplePawnsSpawnedInAFrame; // 0x878
	int NumPawnsAllowedToBeSpawnedInAFrame; // 0x87c
	bool bShouldGenerateLowQualityLightmaps; // 0x880
	Color C_WorldBox; // 0x884
	Color C_BrushWire; // 0x888
	Color C_AddWire; // 0x88c
	Color C_SubtractWire; // 0x890
	Color C_SemiSolidWire; // 0x894
	Color C_NonSolidWire; // 0x898
	Color C_WireBackground; // 0x89c
	Color C_ScaleBoxHi; // 0x8a0
	Color C_VolumeCollision; // 0x8a4
	Color C_BSPCollision; // 0x8a8
	Color C_OrthoBackground; // 0x8ac
	Color C_Volume; // 0x8b0
	Color C_BrushShape; // 0x8b4
	float StreamingDistanceFactor; // 0x8b8
	DirectoryPath GameScreenshotSaveDirectory; // 0x8c0
	ETransitionType TransitionType; // 0x8d0
	FString TransitionDescription; // 0x8d8
	FString TransitionGameMode; // 0x8e8
	float MeshLODRange; // 0x8f8
	bool bAllowMatureLanguage; // 0x8fc
	float CameraRotationThreshold; // 0x900
	float CameraTranslationThreshold; // 0x904
	float PrimitiveProbablyVisibleTime; // 0x908
	float MaxOcclusionPixelsFraction; // 0x90c
	bool bPauseOnLossOfFocus; // 0x910
	int MaxParticleResize; // 0x914
	int MaxParticleResizeWarn; // 0x918
	TArray PendingDroppedNotes; // 0x920
	float NetClientTicksPerSecond; // 0x930
	float DisplayGamma; // 0x934
	float MinDesiredFrameRate; // 0x938
	LinearColor DefaultSelectedMaterialColor; // 0x93c
	LinearColor SelectedMaterialColor; // 0x94c
	LinearColor SelectionOutlineColor; // 0x95c
	LinearColor SubduedSelectionOutlineColor; // 0x96c
	LinearColor SelectedMaterialColorOverride; // 0x97c
	bool bIsOverridingSelectedColor; // 0x98c
	bool bEnableOnScreenDebugMessages; // 0x990
	bool bEnableOnScreenDebugMessagesDisplay; // 0x990
	bool bSuppressMapWarnings; // 0x990
	bool bDisableAILogging; // 0x990
	int bEnableVisualLogRecordingOnStart; // 0x994
	int ScreenSaverInhibitorSemaphore; // 0x99c
	bool bLockReadOnlyLevels; // 0x9a0
	FString ParticleEventManagerClassPath; // 0x9a8
	float SelectionHighlightIntensity; // 0x9c8
	float BSPSelectionHighlightIntensity; // 0x9cc
	float SelectionHighlightIntensityBillboards; // 0x9d0
	TArray NetDriverDefinitions; // 0xc00
	TArray ServerActors; // 0xc10
	TArray RuntimeServerActors; // 0xc20
	float NetErrorLogInterval; // 0xc30
	bool bStartedLoadMapMovie; // 0xc34
	int NextWorldContextHandle; // 0xc50

};


instance 1ab5e0b8d40
class ScriptViewportClient public : Object
{
	// Fields

};


instance 1ab5e0b8f80
class GameViewportClient public : ScriptViewportClient
{
	// Fields
	Console* ViewportConsole; // 0x40
	TArray DebugProperties; // 0x48
	World* World; // 0x78
	GameInstance* GameInstance; // 0x80

	// Functions
	SSSwapControllers 0x43a55 hash 16fa1b3d params:(  );
	ShowTitleSafeArea 0x43a4b hash 503b41e0 params:(  );
	SetConsoleTarget 0x43a42 hash 6ccae9ab params:( None PlayerIndex; );
};


instance 1ab5e0b8440
class HUD public : Actor
{
	// Fields
	PlayerController* PlayerOwner; // 0x218
	bool bLostFocusPaused; // 0x220
	bool bShowHUD; // 0x220
	bool bShowDebugInfo; // 0x220
	int CurrentTargetIndex; // 0x224
	bool bShowHitBoxDebugInfo; // 0x228
	bool bShowOverlays; // 0x228
	bool bEnableDebugTextShadow; // 0x228
	TArray PostRenderedActors; // 0x230
	TArray DebugDisplay; // 0x248
	TArray ToggledDebugCategories; // 0x258
	Canvas* Canvas; // 0x268
	Canvas* DebugCanvas; // 0x270
	TArray DebugTextList; // 0x278
	Actor* ShowDebugTargetDesiredClass; // 0x288
	Actor* ShowDebugTargetActor; // 0x290

	// Functions
	ShowHUD 0x43b2d hash f394efe7 params:(  );
	ShowDebugToggleSubCategory 0x43b1f hash 12ea2037 params:( None Category; );
	ShowDebugForReticleTargetToggle 0x43b0e hash 12b12c5 params:( Class DesiredClass; );
	ShowDebug 0x43b08 hash 2c5178cd params:( None DebugType; );
	RemoveDebugText 0x283d9 hash 1375eb7f params:( Actor SrcActor;None bLeaveDurationText; );
	RemoveAllDebugStrings 0x283cd hash 5d0c7dbd params:(  );
	ReceiveHitBoxRelease 0x283c2 hash 33ce15f7 params:( None BoxName; );
	ReceiveHitBoxEndCursorOver 0x283b4 hash 8d777e07 params:( None BoxName; );
	ReceiveHitBoxClick 0x283aa hash 41c3a51c params:( None BoxName; );
	ReceiveHitBoxBeginCursorOver 0x2839b hash de038895 params:( None BoxName; );
	ReceiveDrawHUD 0x28393 hash f6546a97 params:( None SizeX;None SizeY; );
	Project 0x43b03 hash 23f32c5c params:( Vector Location;Vector ReturnValue; );
	PreviousDebugTarget 0x43af8 hash 554a3a30 params:(  );
	NextDebugTarget 0x43aef hash 76526ed2 params:(  );
	GetTextSize 0x43ae8 hash 4d4fcd85 params:( None Text;None OutWidth;None OutHeight;Font Font;None Scale; );
	GetOwningPlayerController 0x43ada hash f503cb48 params:( PlayerController ReturnValue; );
	GetOwningPawn 0x43ad2 hash b27180ed params:( Pawn ReturnValue; );
	GetActorsInSelectionRectangle 0x43ac2 hash acfba103 params:( Class ClassFilter;Vector2D FirstPoint;Vector2D SecondPoint;OutActors OutActors;None bIncludeNonCollidingComponents;None bActorMustBeFullyEnclosed; );
	DrawTextureSimple 0x43ab8 hash 9f53a80e params:( Texture Texture;None ScreenX;None ScreenY;None Scale;None bScalePosition; );
	DrawTexture 0x43ab1 hash 50f163e4 params:( Texture Texture;None ScreenX;None ScreenY;None ScreenW;None ScreenH;None TextureU;None TextureV;None TextureUWidth;None TextureVHeight;LinearColor TintColor;EBlendMode BlendMode;None Scale;None bScalePosition;None Rotation;Vector2D RotPivot; );
	DrawText 0x43aac hash 6f7c7a18 params:( None Text;LinearColor TextColor;None ScreenX;None ScreenY;Font Font;None Scale;None bScalePosition; );
	DrawRect 0x43aa7 hash 6f7b5ea1 params:( LinearColor RectColor;None ScreenX;None ScreenY;None ScreenW;None ScreenH; );
	DrawMaterialTriangle 0x43a9c hash c3beb078 params:( MaterialInterface Material;Vector2D V0_Pos;Vector2D V1_Pos;Vector2D V2_Pos;Vector2D V0_UV;Vector2D V1_UV;Vector2D V2_UV;LinearColor V0_Color;LinearColor V1_Color;LinearColor V2_Color; );
	DrawMaterialSimple 0x43a92 hash 949c584c params:( MaterialInterface Material;None ScreenX;None ScreenY;None ScreenW;None ScreenH;None Scale;None bScalePosition; );
	DrawMaterial 0x43a8b hash bb023da2 params:( MaterialInterface Material;None ScreenX;None ScreenY;None ScreenW;None ScreenH;None MaterialU;None MaterialV;None MaterialUWidth;None MaterialVHeight;None Scale;None bScalePosition;None Rotation;Vector2D RotPivot; );
	DrawLine 0x43a86 hash 6f7826bb params:( None StartScreenX;None StartScreenY;None EndScreenX;None EndScreenY;LinearColor LineColor;None LineThickness; );
	Deproject 0x43a80 hash d89eb2c5 params:( None ScreenX;None ScreenY;Vector WorldPosition;Vector WorldDirection; );
	AddHitBox 0x43a7a hash 90cc5cdc params:( Vector2D Position;Vector2D Size;None InName;None bConsumesInput;None Priority; );
	AddDebugText 0x2838c hash 29fa763a params:( None DebugText;Actor SrcActor;None Duration;Vector Offset;Vector DesiredOffset;Color TextColor;None bSkipOverwriteCheck;None bAbsoluteLocation;None bKeepAttachedToActor;Font InFont;None FontScale;None bDrawShadow; );
};


instance 1ab5e0bde40
class PhysicalMaterial public : Object
{
	// Fields
	float Friction; // 0x28
	BYTE FrictionCombineMode; // 0x2c
	bool bOverrideFrictionCombineMode; // 0x2d
	float Restitution; // 0x30
	BYTE RestitutionCombineMode; // 0x34
	bool bOverrideRestitutionCombineMode; // 0x35
	float Density; // 0x38
	float RaiseMassToPower; // 0x3c
	float DestructibleDamageThresholdScale; // 0x40
	PhysicalMaterialPropertyBase* PhysicalMaterialProperty; // 0x48
	BYTE SurfaceType; // 0x50
	float TireFrictionScale; // 0x54
	TArray TireFrictionScales; // 0x58

};


instance 1ab5e0bd9c0
class PlayerController public : Controller
{
	// Fields
	Player* Player; // 0x290
	Pawn* AcknowledgedPawn; // 0x298
	InterpTrackInstDirector* ControllingDirTrackInst; // 0x2a0
	HUD* MyHUD; // 0x2a8
	PlayerCameraManager* PlayerCameraManager; // 0x2b0
	PlayerCameraManager* PlayerCameraManagerClass; // 0x2b8
	bool bAutoManageActiveCameraTarget; // 0x2c0
	Rotator TargetViewRotation; // 0x2c4
	float SmoothTargetViewRotationSpeed; // 0x2dc
	TArray HiddenActors; // 0x2e8
	TArray HiddenPrimitiveComponents; // 0x2f8
	float LastSpectatorStateSynchTime; // 0x30c
	Vector LastSpectatorSyncLocation; // 0x310
	Rotator LastSpectatorSyncRotation; // 0x31c
	int ClientCap; // 0x328
	CheatManager* CheatManager; // 0x330
	CheatManager* CheatClass; // 0x338
	PlayerInput* PlayerInput; // 0x340
	TArray ActiveForceFeedbackEffects; // 0x348
	bool bPlayerIsWaiting; // 0x3c8
	BYTE NetPlayerIndex; // 0x3cc
	NetConnection* PendingSwapConnection; // 0x408
	NetConnection* NetConnection; // 0x410
	float InputYawScale; // 0x424
	float InputPitchScale; // 0x428
	float InputRollScale; // 0x42c
	bool bShowMouseCursor; // 0x430
	bool bEnableClickEvents; // 0x430
	bool bEnableTouchEvents; // 0x430
	bool bEnableMouseOverEvents; // 0x430
	bool bEnableTouchOverEvents; // 0x430
	bool bForceFeedbackEnabled; // 0x430
	float ForceFeedbackScale; // 0x434
	TArray ClickEventKeys; // 0x438
	BYTE DefaultMouseCursor; // 0x448
	BYTE CurrentMouseCursor; // 0x449
	BYTE DefaultClickTraceChannel; // 0x44a
	BYTE CurrentClickTraceChannel; // 0x44b
	float HitResultTraceDistance; // 0x44c
	USHORT SeamlessTravelCount; // 0x450
	USHORT LastCompletedSeamlessTravelCount; // 0x452
	InputComponent* InactiveStateInputComponent; // 0x4c8
	bool bShouldPerformFullTickWhenPaused; // 0x4d0
	TouchInterface* CurrentTouchInterface; // 0x4e8
	SpectatorPawn* SpectatorPawn; // 0x540
	bool bIsLocalPlayerController; // 0x54c
	Vector SpawnLocation; // 0x550

	// Functions
	WasInputKeyJustReleased 0x4423f hash 9823d1d4 params:( Key Key;None ReturnValue; );
	WasInputKeyJustPressed 0x44233 hash f51f46a5 params:( Key Key;None ReturnValue; );
	ToggleSpeaking 0x4422b hash 24f6b399 params:( None bInSpeaking; );
	TestServerLevelVisibilityChange 0x4421a hash 2217aa62 params:( None PackageName;None Filename; );
	SwitchLevel 0x44213 hash 9b377daf params:( None URL; );
	StopHapticEffect 0x4420a hash 47907ab1 params:( UnderlyingType Hand; );
	StartFire 0x42cec hash 1620b79 params:( None FireModeNum; );
	SetVirtualJoystickVisibility 0x441fb hash 1ccfe810 params:( None bVisible; );
	SetViewTargetWithBlend 0x441ef hash 7f790c74 params:( Actor NewViewTarget;None BlendTime;EViewTargetBlendFunction BlendFunc;None BlendExp;None bLockOutgoing; );
	SetName 0x441ea hash ecd9e292 params:( None S; );
	SetMouseLocation 0x441e1 hash 3bb81ad3 params:( None X;None Y; );
	SetMouseCursorWidget 0x441d6 hash f18100bc params:( EMouseCursor Cursor;UserWidget CursorWidget; );
	SetHapticsByValue 0x441cc hash 45da1e15 params:( None Frequency;None Amplitude;UnderlyingType Hand; );
	SetDisableHaptics 0x441c2 hash 2908fb71 params:( None bNewDisabled; );
	SetControllerLightColor 0x441b5 hash d3c264ac params:( Color Color; );
	SetCinematicMode 0x441ac hash b26baf43 params:( None bInCinematicMode;None bHidePlayer;None bAffectsHUD;None bAffectsMovement;None bAffectsTurning; );
	SetAudioListenerOverride 0x4419f hash 49422369 params:( SceneComponent AttachToComponent;Vector Location;Rotator Rotation; );
	SetAudioListenerAttenuationOverride 0x4418c hash 8c3a2435 params:( SceneComponent AttachToComponent;Vector AttenuationLocationOVerride; );
	ServerViewSelf 0x32624 hash 345a3821 params:( ViewTargetTransitionParams TransitionParams; );
	ServerViewPrevPlayer 0x32619 hash 33e55a21 params:(  );
	ServerViewNextPlayer 0x3260e hash 306cce03 params:(  );
	ServerVerifyViewTarget 0x32602 hash 24428ab3 params:(  );
	ServerUpdateMultipleLevelsVisibility 0x325ef hash f4e70a7e params:( LevelVisibilities LevelVisibilities; );
	ServerUpdateLevelVisibility 0x325e0 hash f9a6c39f params:( UpdateLevelVisibilityLevelInfo LevelVisibility; );
	ServerUpdateCamera 0x325d6 hash 4ba0a788 params:( Vector_NetQuantize CamLoc;None CamPitchAndYaw; );
	ServerUnmutePlayer 0x325cc hash 9e1307e7 params:( UniqueNetIdRepl PlayerId; );
	ServerToggleAILogging 0x256de hash a90cca2f params:(  );
	ServerShortTimeout 0x325c2 hash e466ed53 params:(  );
	ServerSetSpectatorWaiting 0x325b4 hash b5856230 params:( None bWaiting; );
	ServerSetSpectatorLocation 0x325a6 hash 65bc0416 params:( Vector NewLoc;Rotator NewRot; );
	ServerRestartPlayer 0x3259b hash c2a00c6e params:(  );
	ServerPause 0x32594 hash f4eb29fa params:(  );
	ServerNotifyLoadedWorld 0x32587 hash 7fec6fa6 params:( None WorldPackageName; );
	ServerMutePlayer 0x3257e hash 6cfbb1a4 params:( UniqueNetIdRepl PlayerId; );
	ServerExecRPC 0x32576 hash c2190646 params:( None Msg; );
	ServerExec 0x44186 hash 1eac2281 params:( None Msg; );
	ServerCheckClientPossessionReliable 0x32563 hash a71d4f4f params:(  );
	ServerCheckClientPossession 0x32554 hash 4a0f374f params:(  );
	ServerChangeName 0x3254b hash bb46ca03 params:( None S; );
	ServerCamera 0x32544 hash 73f8bc85 params:( None NewMode; );
	ServerAcknowledgePossession 0x32535 hash 6e005496 params:( Pawn P; );
	SendToConsole 0x4417e hash 349837c5 params:( None Command; );
	RestartLevel 0x44177 hash 1ddc62a2 params:(  );
	ResetControllerLightColor 0x44169 hash 2f6c2723 params:(  );
	ProjectWorldLocationToScreen 0x4415a hash 1394e4e0 params:( Vector WorldLocation;Vector2D ScreenLocation;None bPlayerViewportRelative;None ReturnValue; );
	PlayHapticEffect 0x44151 hash 9589c9c1 params:( HapticFeedbackEffect_Base HapticEffect;UnderlyingType Hand;None Scale;None bLoop; );
	PlayDynamicForceFeedback 0x44144 hash d75493f4 params:( None Intensity;None Duration;None bAffectsLeftLarge;None bAffectsLeftSmall;None bAffectsRightLarge;None bAffectsRightSmall;EDynamicForceFeedbackAction Action;LatentActionInfo LatentInfo; );
	Pause 0xb98f hash dddda23 params:(  );
	OnServerStartedVisualLogger 0x32526 hash 864a8f04 params:( None bIsLogging; );
	LocalTravel 0x4413d hash 1a5ef4fe params:( None URL; );
	K2_ClientPlayForceFeedback 0x4412f hash a0b7318a params:( ForceFeedbackEffect ForceFeedbackEffect;None Tag;None bLooping;None bIgnoreTimeDilation;None bPlayWhilePaused; );
	IsInputKeyDown 0x44127 hash 6d9464d2 params:( Key Key;None ReturnValue; );
	GetViewportSize 0x4411e hash ebc32c20 params:( None SizeX;None SizeY; );
	GetSpectatorPawn 0x44115 hash f2a57350 params:( SpectatorPawn ReturnValue; );
	GetMousePosition 0x4410c hash 8024f5e3 params:( None LocationX;None LocationY;None ReturnValue; );
	GetInputVectorKeyState 0x44100 hash f129652 params:( Key Key;Vector ReturnValue; );
	GetInputTouchState 0x440f6 hash f79d4919 params:( ETouchIndex FingerIndex;None LocationX;None LocationY;None bIsCurrentlyPressed; );
	GetInputMouseDelta 0x440ec hash a2e028e8 params:( None DeltaX;None DeltaY; );
	GetInputMotionState 0x440e1 hash b253ea0c params:( Vector Tilt;Vector RotationRate;Vector Gravity;Vector Acceleration; );
	GetInputKeyTimeDown 0x440d6 hash 9531a085 params:( Key Key;None ReturnValue; );
	GetInputAnalogStickState 0x440c9 hash 17ed89c6 params:( EControllerAnalogStick WhichStick;None StickX;None StickY; );
	GetInputAnalogKeyState 0x440bd hash 6efff1d1 params:( Key Key;None ReturnValue; );
	GetHUD 0x440b9 hash b4e1cdc6 params:( HUD ReturnValue; );
	GetHitResultUnderFingerForObjects 0x440a7 hash e383b133 params:( ETouchIndex FingerIndex;ObjectTypes ObjectTypes;None bTraceComplex;HitResult HitResult;None ReturnValue; );
	GetHitResultUnderFingerByChannel 0x44096 hash b6613556 params:( ETouchIndex FingerIndex;ETraceTypeQuery TraceChannel;None bTraceComplex;HitResult HitResult;None ReturnValue; );
	GetHitResultUnderFinger 0x44089 hash 26857aa2 params:( ETouchIndex FingerIndex;ECollisionChannel TraceChannel;None bTraceComplex;HitResult HitResult;None ReturnValue; );
	GetHitResultUnderCursorForObjects 0x44077 hash f53462f6 params:( ObjectTypes ObjectTypes;None bTraceComplex;HitResult HitResult;None ReturnValue; );
	GetHitResultUnderCursorByChannel 0x44066 hash 52113ab9 params:( ETraceTypeQuery TraceChannel;None bTraceComplex;HitResult HitResult;None ReturnValue; );
	GetHitResultUnderCursor 0x44059 hash 20618ca5 params:( ECollisionChannel TraceChannel;None bTraceComplex;HitResult HitResult;None ReturnValue; );
	GetFocalLocation 0x44050 hash 3c535e3 params:( Vector ReturnValue; );
	FOV 0x4404d hash b87e730 params:( None NewFOV; );
	EnableCheats 0x44046 hash a6117d64 params:(  );
	DeprojectScreenPositionToWorld 0x44036 hash e5aea585 params:( None ScreenX;None ScreenY;Vector WorldLocation;Vector WorldDirection;None ReturnValue; );
	DeprojectMousePositionToWorld 0x44026 hash 62eb7f2e params:( Vector WorldLocation;Vector WorldDirection;None ReturnValue; );
	ConsoleKey 0x44020 hash e9e140c1 params:( Key Key; );
	ClientWasKicked 0x3251d hash baca0b5a params:( None KickReason; );
	ClientVoiceHandshakeComplete 0x3250e hash a387885a params:(  );
	ClientUpdateMultipleLevelsStreamingStatus 0x324f8 hash 3b3d0bec params:( LevelStatuses LevelStatuses; );
	ClientUpdateLevelStreamingStatus 0x324e7 hash c6539cad params:( None PackageName;None bNewShouldBeLoaded;None bNewShouldBeVisible;None bNewShouldBlockOnLoad;None LODIndex; );
	ClientUnmutePlayer 0x324dd hash 2f098ecf params:( UniqueNetIdRepl PlayerId; );
	ClientTravelInternal 0x324d2 hash 95b833cf params:( None URL;ETravelType TravelType;None bSeamless;Guid MapPackageGuid; );
	ClientTravel 0x44019 hash 3ac33ad2 params:( None URL;ETravelType TravelType;None bSeamless;Guid MapPackageGuid; );
	ClientTeamMessage 0x324c8 hash df70e0d0 params:( PlayerState SenderPlayerState;None S;None Type;None MsgLifeTime; );
	ClientStopForceFeedback 0x324bb hash 4010303e params:( ForceFeedbackEffect ForceFeedbackEffect;None Tag; );
	ClientStopCameraShake 0x324af hash dc63c37f params:( Class Shake;None bImmediately; );
	ClientStopCameraAnim 0x324a4 hash 7b010398 params:( CameraAnim AnimToStop; );
	ClientStartOnlineSession 0x32497 hash 61717f5b params:(  );
	ClientSpawnCameraLensEffect 0x32488 hash c32ba9b5 params:( Class LensEffectEmitterClass; );
	ClientSetViewTarget 0x3247d hash 61f736f2 params:( Actor A;ViewTargetTransitionParams TransitionParams; );
	ClientSetSpectatorWaiting 0x3246f hash 66d21418 params:( None bWaiting; );
	ClientSetHUD 0x32468 hash 378c78f1 params:( Class NewHUDClass; );
	ClientSetForceMipLevelsToBeResident 0x32455 hash 58859db8 params:( MaterialInterface Material;None ForceDuration;None CinematicTextureGroups; );
	ClientSetCinematicMode 0x32449 hash d2bcc5a2 params:( None bInCinematicMode;None bAffectsMovement;None bAffectsTurning;None bAffectsHUD; );
	ClientSetCameraMode 0x3243e hash afa7e59e params:( None NewCamMode; );
	ClientSetCameraFade 0x32433 hash afa3d369 params:( None bEnableFading;Color FadeColor;Vector2D FadeAlpha;None FadeTime;None bFadeAudio; );
	ClientSetBlockOnAsyncLoading 0x32424 hash 3c96f54 params:(  );
	ClientReturnToMainMenuWithTextReason 0x32411 hash 33c212aa params:( None ReturnReason; );
	ClientReturnToMainMenu 0x32405 hash 78fac2a1 params:( None ReturnReason; );
	ClientRetryClientRestart 0x323f8 hash b910251e params:( Pawn NewPawn; );
	ClientRestart 0x323f0 hash dc279be9 params:( Pawn NewPawn; );
	ClientReset 0x323e9 hash ac477e27 params:(  );
	ClientRepObjRef 0x323e0 hash 474dd6e3 params:( Object Object; );
	ClientReceiveLocalizedMessage 0x323d0 hash 84fad043 params:( Class Message;None Switch;PlayerState RelatedPlayerState;PlayerState RelatedPlayerState;Object OptionalObject; );
	ClientPrestreamTextures 0x323c3 hash 852d84bb params:( Actor ForcedActor;None ForceDuration;None bEnableStreaming;None CinematicTextureGroups; );
	ClientPrepareMapChange 0x323b7 hash e5d16f37 params:( None LevelName;None bFirst;None Blast; );
	ClientPlaySoundAtLocation 0x323a9 hash 332e0711 params:( SoundBase Sound;Vector Location;None VolumeMultiplier;None PitchMultiplier; );
	ClientPlaySound 0x323a0 hash b264c683 params:( SoundBase Sound;None VolumeMultiplier;None PitchMultiplier; );
	ClientPlayForceFeedback_Internal 0x3238f hash d53cef6a params:( ForceFeedbackEffect ForceFeedbackEffect;ForceFeedbackParameters Params; );
	ClientPlayCameraShake 0x32383 hash 79e7708f params:( Class Shake;None Scale;ECameraAnimPlaySpace PlaySpace;Rotator UserPlaySpaceRot; );
	ClientPlayCameraAnim 0x32378 hash 513b4ea8 params:( CameraAnim AnimToPlay;None Scale;None Rate;None BlendInTime;None BlendOutTime;None bLoop;None bRandomStartTime;ECameraAnimPlaySpace Space;Rotator CustomPlaySpace; );
	ClientMutePlayer 0x3236f hash 89535e8c params:( UniqueNetIdRepl PlayerId; );
	ClientMessage 0x32367 hash 5b43de49 params:( None S;None Type;None MsgLifeTime; );
	ClientIgnoreMoveInput 0x3235b hash 6cc40def params:( None bIgnore; );
	ClientIgnoreLookInput 0x3234f hash eb6ee76d params:( None bIgnore; );
	ClientGotoState 0x32346 hash fe0ba1be params:( None NewState; );
	ClientGameEnded 0x3233d hash df46275e params:( Actor EndGameFocus;None bIsWinner; );
	ClientForceGarbageCollection 0x3232e hash 40f9bc88 params:(  );
	ClientFlushLevelStreaming 0x32320 hash 5c2238a8 params:(  );
	ClientEndOnlineSession 0x32314 hash 151da784 params:(  );
	ClientEnableNetworkVoice 0x32307 hash c881b84b params:( None bEnable; );
	ClientCommitMapChange 0x322fb hash 4792fbf1 params:(  );
	ClientClearCameraLensEffects 0x322ec hash 6fd8c526 params:(  );
	ClientCapBandwidth 0x322e2 hash 2ae895ad params:( None Cap; );
	ClientCancelPendingMapChange 0x322d3 hash 74bdf93 params:(  );
	ClientAddTextureStreamingLoc 0x322c4 hash 3ed2d106 params:( Vector InLoc;None Duration;None bOverrideLocation; );
	ClearAudioListenerOverride 0x4400b hash b4d26a44 params:(  );
	ClearAudioListenerAttenuationOverride 0x43ff7 hash 9838c30 params:(  );
	CanRestartPlayer 0x43fee hash b99342a9 params:( None ReturnValue; );
	Camera 0x15e hash ab4171ce params:( None NewMode; );
	AddYawInput 0x43fe7 hash 4561c74f params:( None Val; );
	AddRollInput 0x43fe0 hash ae127817 params:( None Val; );
	AddPitchInput 0x43fd8 hash a0556a56 params:( None Val; );
	ActivateTouchInterface 0x43fcc hash 28e2104a params:( TouchInterface NewTouchInterface; );
};


instance 1ab5e0b9d00
class DamageType public : Object
{
	// Fields
	bool bCausedByWorld; // 0x28
	bool bScaleMomentumByMass; // 0x28
	bool bRadialDamageVelChange; // 0x28
	float DamageImpulse; // 0x2c
	float DestructibleImpulse; // 0x30
	float DestructibleDamageSpreadScale; // 0x34
	float DamageFalloff; // 0x38

};


instance 1ab5e0f3a00
class SkyLight public : Info
{
	// Fields
	SkyLightComponent* LightComponent; // 0x218
	bool bEnabled; // 0x220

	// Functions
	OnRep_bEnabled 0x456da hash f2b2e395 params:(  );
};


instance 1ab5e0f3340
class StreamableRenderAsset public : Object
{
	// Fields
	double ForceMipLevelsToBeResidentTimestamp; // 0x28
	int NumCinematicMipLevels; // 0x30
	int StreamingIndex; // 0x34
	int CachedCombinedLODBias; // 0x38
	BYTE CachedNumResidentLODs; // 0x3c
	bool bCachedReadyForStreaming; // 0x3d
	bool NeverStream; // 0x3d
	bool bGlobalForceMipLevelsToBeResident; // 0x3d
	bool bIsStreamable; // 0x3d
	bool bHasStreamingUpdatePending; // 0x3d
	bool bForceMiplevelsToBeResident; // 0x3d
	bool bIgnoreStreamingMipBias; // 0x3d
	bool bUseCinematicMipLevels; // 0x3d

};


instance 1ab5e0f3580
class Texture public : StreamableRenderAsset
{
	// Fields
	Guid LightingGuid; // 0x48
	int LODBias; // 0x58
	BYTE CompressionSettings; // 0x5c
	BYTE Filter; // 0x5d
	ETextureMipLoadOptions MipLoadOptions; // 0x5e
	BYTE LODGroup; // 0x5f
	bool SRGB; // 0x60
	bool bNoTiling; // 0x60
	bool VirtualTextureStreaming; // 0x60
	bool CompressionYCoCg; // 0x60
	bool bAsyncResourceReleaseHasBeenStarted; // 0x60
	TArray AssetUserData; // 0x68

};


instance 1ab5e0f2a40
class TextureCube public : Texture
{
	// Fields

};


instance 1ab5e0f7d80
class StaticMeshActor public : Actor
{
	// Fields
	StaticMeshComponent* StaticMeshComponent; // 0x218
	bool bStaticMeshReplicateMovement; // 0x220
	ENavDataGatheringMode NavigationGeometryGatheringMode; // 0x221

	// Functions
	SetMobility 0x3e294 hash e597035a params:( EComponentMobility InMobility; );
};


instance 1ab5e0fdc00
class MaterialInterface public : Object
{
	// Fields
	SubsurfaceProfile* SubsurfaceProfile; // 0x38
	LightmassMaterialInterfaceSettings LightmassSettings; // 0x50
	TArray TextureStreamingData; // 0x60
	TArray AssetUserData; // 0x70

	// Functions
	SetForceMipLevelsToBeResident 0x45fbb hash 7acb64f9 params:( None OverrideForceMiplevelsToBeResident;None bForceMiplevelsToBeResidentValue;None ForceDuration;None CinematicTextureGroups;None bFastResponse; );
	GetPhysicalMaterial 0x45fb0 hash 2c0b8571 params:( PhysicalMaterial ReturnValue; );
	GetBaseMaterial 0x45fa7 hash 76aaa52f params:( Material ReturnValue; );
};


instance 1ab5e0fde40
class MaterialInstance public : MaterialInterface
{
	// Fields
	PhysicalMaterial* PhysMaterial; // 0x88
	MaterialInterface* Parent; // 0x90
	bool bHasStaticPermutationResource; // 0x98
	bool bOverrideSubsurfaceProfile; // 0x98
	TArray ScalarParameterValues; // 0xa0
	TArray VectorParameterValues; // 0xb0
	TArray TextureParameterValues; // 0xc0
	TArray RuntimeVirtualTextureParameterValues; // 0xd0
	TArray FontParameterValues; // 0xe0
	MaterialInstanceBasePropertyOverrides BasePropertyOverrides; // 0xf0
	TArray PermutationTextureReferences; // 0x108
	StaticParameterSet StaticParameters; // 0x118

};


instance 1ab5e0f4c00
class MaterialInstanceConstant public : MaterialInstance
{
	// Fields

	// Functions
	K2_GetVectorParameterValue 0x45fe8 hash 12f87352 params:( None ParameterName;LinearColor ReturnValue; );
	K2_GetTextureParameterValue 0x45fd9 hash 6fbf5d50 params:( None ParameterName;Texture ReturnValue; );
	K2_GetScalarParameterValue 0x45fcb hash 2eeab515 params:( None ParameterName;None ReturnValue; );
};


instance 1ab5e0fc340
class MaterialExpressionCustomOutput public : MaterialExpression
{
	// Fields

};


instance 1ab5e0fb140
class EngineCustomTimeStep public : Object
{
	// Fields

};


instance 1ab5e0febc0
class AnimNotifyState public : Object
{
	// Fields

	// Functions
	Received_NotifyTick 0x235d3 hash eca9b78f params:( SkeletalMeshComponent MeshComp;AnimSequenceBase Animation;None FrameDeltaTime;None ReturnValue; );
	Received_NotifyEnd 0x235c9 hash 4cfd237b params:( SkeletalMeshComponent MeshComp;AnimSequenceBase Animation;None ReturnValue; );
	Received_NotifyBegin 0x235be hash 8098d009 params:( SkeletalMeshComponent MeshComp;AnimSequenceBase Animation;None TotalDuration;None ReturnValue; );
	GetNotifyName 0x2339b hash 82a9beff params:( None ReturnValue; );
};


instance 1ab5e127fc0
class DynamicBlueprintBinding public : Object
{
	// Fields

};


instance 1ab5e1276c0
class BlueprintGeneratedClass public : Class
{
	// Fields
	int NumReplicatedProperties; // 0x210
	bool bHasNativizedParent; // 0x214
	bool bHasCookedComponentInstancingData; // 0x214
	TArray DynamicBindingObjects; // 0x218
	TArray ComponentTemplates; // 0x228
	TArray Timelines; // 0x238
	TArray ComponentClassOverrides; // 0x248
	SimpleConstructionScript* SimpleConstructionScript; // 0x258
	InheritableComponentHandler* InheritableComponentHandler; // 0x260
	StructProperty* UberGraphFramePointerProperty; // 0x268
	Function* UberGraphFunction; // 0x270
	MapProperty CookedComponentInstancingData; // 0x278 property 0x1ab711652e0 hash 0xadd0fb88

};


instance 1ab5e1252c0
class CameraActor public : Actor
{
	// Fields
	BYTE AutoActivateForPlayer; // 0x218
	CameraComponent* CameraComponent; // 0x220
	SceneComponent* SceneComponent; // 0x228
	bool bConstrainAspectRatio; // 0x238
	float AspectRatio; // 0x23c
	float FOVAngle; // 0x240
	float PostProcessBlendWeight; // 0x244
	PostProcessSettings PostProcessSettings; // 0x250

	// Functions
	GetAutoActivatePlayerIndex 0x47abb hash a9222eb4 params:( None ReturnValue; );
};


instance 1ab5e12d300
class SoundWave public : SoundBase
{
	// Fields
	int CompressionQuality; // 0x160
	int StreamingPriority; // 0x164
	ESoundwaveSampleRateSettings SampleRateQuality; // 0x168
	BYTE SoundGroup; // 0x16a
	bool bLooping; // 0x16b
	bool bStreaming; // 0x16b
	bool bSeekableStreaming; // 0x16b
	ESoundWaveLoadingBehavior LoadingBehavior; // 0x16c
	bool bMature; // 0x16d
	bool bManualWordWrap; // 0x16d
	bool bSingleLine; // 0x16d
	bool bIsAmbisonics; // 0x16d
	TArray FrequenciesToAnalyze; // 0x170
	TArray CookedSpectralTimeData; // 0x180
	TArray CookedEnvelopeTimeData; // 0x190
	int InitialChunkSize; // 0x1a0
	FString SpokenText; // 0x1e8
	float SubtitlePriority; // 0x1f8
	float Volume; // 0x1fc
	float Pitch; // 0x200
	int NumChannels; // 0x204
	int SampleRate; // 0x208
	TArray Subtitles; // 0x218
	CurveTable* Curves; // 0x228
	CurveTable* InternalCurves; // 0x230

};


instance 1ab5e12d540
class SoundWaveProcedural public : SoundWave
{
	// Fields

};


instance 1ab5e1349c0
class BlueprintCore public : Object
{
	// Fields
	Object* SkeletonGeneratedClass; // 0x28
	Object* GeneratedClass; // 0x30
	bool bLegacyNeedToPurgeSkelRefs; // 0x38
	Guid BlueprintGuid; // 0x3c

};


instance 1ab5e12e080
class Blueprint public : BlueprintCore
{
	// Fields
	Object* ParentClass; // 0x50
	BYTE BlueprintType; // 0x58
	bool bRecompileOnLoad; // 0x59
	bool bHasBeenRegenerated; // 0x59
	bool bIsRegeneratingOnLoad; // 0x59
	int BlueprintSystemVersion; // 0x5c
	SimpleConstructionScript* SimpleConstructionScript; // 0x60
	TArray ComponentTemplates; // 0x68
	TArray Timelines; // 0x78
	TArray ComponentClassOverrides; // 0x88
	InheritableComponentHandler* InheritableComponentHandler; // 0x98

};


instance 1ab5e131600
class Model public : Object
{
	// Fields

};


instance 1ab5e131180
class Channel public : Object
{
	// Fields
	NetConnection* Connection; // 0x28

};


instance 1ab5e1313c0
class ActorChannel public : Channel
{
	// Fields
	Actor* Actor; // 0x70
	TArray CreateSubObjects; // 0x160

};


instance 1ab5e130880
class AnimationAsset public : Object
{
	// Fields
	Skeleton* Skeleton; // 0x38
	TArray MetaData; // 0x60
	TArray AssetUserData; // 0x70

};


instance 1ab5e130ac0
class BlendSpaceBase public : AnimationAsset
{
	// Fields
	bool bRotationBlendInMeshSpace; // 0x88
	float AnimLength; // 0x8c
	InterpolationParameter InterpolationParam; // 0x90
	float TargetWeightInterpolationSpeedPerSec; // 0xa8
	BYTE NotifyTriggerMode; // 0xac
	TArray PerBoneBlend; // 0xb0
	int SampleIndexWithMarkers; // 0xc0
	TArray SampleData; // 0xc8
	TArray GridSamples; // 0xd8
	BlendParameter BlendParameters; // 0xe8

};


instance 1ab5e130d00
class BlendSpace public : BlendSpaceBase
{
	// Fields
	BYTE AxisToScaleAnimation; // 0x148

};


instance 1ab5e130f40
class AimOffsetBlendSpace public : BlendSpace
{
	// Fields

};


instance 1ab5e130400
class BlendSpace1D public : BlendSpaceBase
{
	// Fields
	bool bScaleAnimation; // 0x148

};


instance 1ab5e130640
class AimOffsetBlendSpace1D public : BlendSpace1D
{
	// Fields

};


instance 1ab5e1301c0
class AISystemBase public : Object
{
	// Fields
	SoftClassPath AISystemClassName; // 0x28
	FName AISystemModuleName; // 0x40
	bool bInstantiateAISystemOnClient; // 0x50

};


instance 1ab5e139400
class AnimationSettings public : DeveloperSettings
{
	// Fields
	int CompressCommandletVersion; // 0x38
	TArray KeyEndEffectorsMatchNameArray; // 0x40
	AnimCompress* DefaultCompressionAlgorithm; // 0x50
	BYTE RotationCompressionFormat; // 0x58
	BYTE TranslationCompressionFormat; // 0x59
	float MaxCurveError; // 0x5c
	float AlternativeCompressionThreshold; // 0x60
	bool ForceRecompression; // 0x64
	bool bOnlyCheckForMissingSkeletalMeshes; // 0x65
	bool bForceBelowThreshold; // 0x66
	bool bFirstRecompressUsingCurrentOrDefault; // 0x67
	bool bRaiseMaxErrorToExisting; // 0x68
	bool bTryExhaustiveSearch; // 0x69
	bool bEnableSegmenting; // 0x6a
	bool bEnablePerformanceLog; // 0x6b
	bool bStripAnimationDataOnDedicatedServer; // 0x6c
	bool bTickAnimationOnSkeletalMeshInit; // 0x6d

};


instance 1ab5e1391c0
class AnimBlueprint public : Blueprint
{
	// Fields
	Skeleton* TargetSkeleton; // 0xa8
	TArray Groups; // 0xb0
	bool bUseMultiThreadedAnimationUpdate; // 0xc0
	bool bWarnAboutBlueprintUsage; // 0xc1

};


instance 1ab5e138f80
class AnimBlueprintGeneratedClass public : BlueprintGeneratedClass
{
	// Fields
	TArray BakedStateMachines; // 0x308
	Skeleton* TargetSkeleton; // 0x318
	TArray AnimNotifies; // 0x320
	MapProperty OrderedSavedPoseIndicesMap; // 0x330 property 0x1ab711679a0 hash 0xadd0fb88
	TArray SyncGroupNames; // 0x400
	TArray EvaluateGraphExposedInputs; // 0x410
	MapProperty GraphAssetPlayerInformation; // 0x420 property 0x1ab71167a40 hash 0xadd0fb88
	MapProperty GraphBlendOptions; // 0x470 property 0x1ab71167ae0 hash 0xadd0fb88

};


instance 1ab5e138d40
class AnimClassData public : Object
{
	// Fields
	TArray BakedStateMachines; // 0x30
	Skeleton* TargetSkeleton; // 0x40
	TArray AnimNotifies; // 0x48
	MapProperty OrderedSavedPoseIndicesMap; // 0x58 property 0x1ab711677c0 hash 0xadd0fb88
	TArray AnimBlueprintFunctions; // 0xa8
	TArray AnimNodeProperties; // 0xb8
	TArray LinkedAnimGraphNodeProperties; // 0xc8
	TArray LinkedAnimLayerNodeProperties; // 0xd8
	TArray PreUpdateNodeProperties; // 0xe8
	TArray DynamicResetNodeProperties; // 0xf8
	TArray StateMachineNodeProperties; // 0x108
	TArray InitializationNodeProperties; // 0x118
	MapProperty GraphNameAssetPlayers; // 0x128 property 0x1ab71167860 hash 0xadd0fb88
	TArray SyncGroupNames; // 0x178
	TArray EvaluateGraphExposedInputs; // 0x188
	MapProperty GraphBlendOptions; // 0x198 property 0x1ab71167900 hash 0xadd0fb88

};


instance 1ab5e138b00
class AnimClassInterface public : Interface
{
	// Fields

};


instance 1ab5e138440
class AnimSequenceBase public : AnimationAsset
{
	// Fields
	TArray Notifies; // 0x80
	float SequenceLength; // 0x90
	float RateScale; // 0x94
	RawCurveTracks RawCurveData; // 0x98

	// Functions
	GetPlayLength 0x488d0 hash 360c29bd params:( None ReturnValue; );
};


instance 1ab5e138680
class AnimCompositeBase public : AnimSequenceBase
{
	// Fields

};


instance 1ab5e1388c0
class AnimComposite public : AnimCompositeBase
{
	// Fields
	AnimTrack AnimationTrack; // 0xa8

};


instance 1ab5e138200
class AnimCompress public : Object
{
	// Fields
	FString Description; // 0x28
	bool bNeedsSkeleton; // 0x38
	bool bEnableSegmenting; // 0x38
	int IdealNumFramesPerSegment; // 0x3c
	int MaxNumFramesPerSegment; // 0x40
	BYTE TranslationCompressionFormat; // 0x44
	BYTE RotationCompressionFormat; // 0x45
	BYTE ScaleCompressionFormat; // 0x46
	float MaxCurveError; // 0x48

};


instance 1ab5e137fc0
class AnimCompress_Automatic public : AnimCompress
{
	// Fields
	float MaxEndEffectorError; // 0x50
	bool bRunCurrentDefaultCompressor; // 0x54
	bool bAutoReplaceIfExistingErrorTooGreat; // 0x54
	bool bRaiseMaxErrorToExisting; // 0x54
	bool bTryExhaustiveSearch; // 0x54

};


instance 1ab5e137d80
class AnimCompress_BitwiseCompressOnly public : AnimCompress
{
	// Fields

};


instance 1ab5e137b40
class AnimCompress_LeastDestructive public : AnimCompress
{
	// Fields

};


instance 1ab5e1376c0
class AnimCompress_RemoveLinearKeys public : AnimCompress
{
	// Fields
	float MaxPosDiff; // 0x50
	float MaxAngleDiff; // 0x54
	float MaxScaleDiff; // 0x58
	float MaxEffectorDiff; // 0x5c
	float MinEffectorDiff; // 0x60
	float EffectorDiffSocket; // 0x64
	float ParentKeyScale; // 0x68
	bool bRetarget; // 0x6c
	bool bActuallyFilterLinearKeys; // 0x6c
	bool bOptimizeForForwardPlayback; // 0x6c
	bool bUseDecompression; // 0x6c
	bool bUseMultithreading; // 0x6c

};


instance 1ab5e137900
class AnimCompress_PerTrackCompression public : AnimCompress_RemoveLinearKeys
{
	// Fields
	float MaxZeroingThreshold; // 0x70
	float MaxPosDiffBitwise; // 0x74
	float MaxAngleDiffBitwise; // 0x78
	float MaxScaleDiffBitwise; // 0x7c
	TArray AllowedRotationFormats; // 0x80
	TArray AllowedTranslationFormats; // 0x90
	TArray AllowedScaleFormats; // 0xa0
	bool bResampleAnimation; // 0xb0
	float ResampledFramerate; // 0xb4
	int MinKeysForResampling; // 0xb8
	bool bUseAdaptiveError; // 0xbc
	bool bUseOverrideForEndEffectors; // 0xbc
	int TrackHeightBias; // 0xc0
	float ParentingDivisor; // 0xc4
	float ParentingDivisorExponent; // 0xc8
	bool bUseAdaptiveError2; // 0xcc
	float RotationErrorSourceRatio; // 0xd0
	float TranslationErrorSourceRatio; // 0xd4
	float ScaleErrorSourceRatio; // 0xd8
	float MaxErrorPerTrackRatio; // 0xdc
	float PerturbationProbeSize; // 0xe0

};


instance 1ab5e137480
class AnimCompress_RemoveEverySecondKey public : AnimCompress
{
	// Fields
	int MinKeys; // 0x50
	bool bStartAtSecondKey; // 0x54

};


instance 1ab5e137240
class AnimCompress_RemoveTrivialKeys public : AnimCompress
{
	// Fields
	float MaxPosDiff; // 0x50
	float MaxAngleDiff; // 0x54
	float MaxScaleDiff; // 0x58

};


instance 1ab5e137000
class AnimCurveCompressionCodec public : Object
{
	// Fields

};


instance 1ab5e136dc0
class AnimCurveCompressionCodec_CompressedRichCurve public : AnimCurveCompressionCodec
{
	// Fields

};


instance 1ab5e136b80
class AnimCurveCompressionCodec_UniformIndexable public : AnimCurveCompressionCodec
{
	// Fields

};


instance 1ab5e136940
class AnimCurveCompressionCodec_UniformlySampled public : AnimCurveCompressionCodec
{
	// Fields

};


instance 1ab5e136700
class AnimCurveCompressionSettings public : Object
{
	// Fields
	AnimCurveCompressionCodec* Codec; // 0x28

};


instance 1ab5e1364c0
class AnimLayerInterface public : Interface
{
	// Fields

};


instance 1ab5e136280
class AnimMetaData public : Object
{
	// Fields

};


instance 1ab5e136040
class AnimMontage public : AnimCompositeBase
{
	// Fields
	AlphaBlend BlendIn; // 0xa8
	float BlendInTime; // 0xd8
	AlphaBlend BlendOut; // 0xe0
	float BlendOutTime; // 0x110
	float BlendOutTriggerTime; // 0x114
	FName SyncGroup; // 0x118
	int SyncSlotIndex; // 0x120
	MarkerSyncData MarkerData; // 0x128
	TArray CompositeSections; // 0x148
	TArray SlotAnimTracks; // 0x158
	TArray BranchingPoints; // 0x168
	bool bEnableRootMotionTranslation; // 0x178
	bool bEnableRootMotionRotation; // 0x179
	bool bEnableAutoBlendOut; // 0x17a
	BYTE RootMotionRootLock; // 0x17b
	TArray BranchingPointMarkers; // 0x180
	TArray BranchingPointStateNotifyIndices; // 0x190
	TimeStretchCurve TimeStretchCurve; // 0x1a0
	FName TimeStretchCurveName; // 0x1c8

	// Functions
	GetDefaultBlendOutTime 0x489c8 hash e5f71416 params:( None ReturnValue; );
};


instance 1ab5e135e00
class AnimNotify_PauseClothingSimulation public : AnimNotify
{
	// Fields

};


instance 1ab5e135bc0
class AnimNotify_PlayParticleEffect public : AnimNotify
{
	// Fields
	ParticleSystem* PSTemplate; // 0x38
	Vector LocationOffset; // 0x40
	Rotator RotationOffset; // 0x4c
	Vector Scale; // 0x58
	bool Attached; // 0x80
	FName SocketName; // 0x84

};


instance 1ab5e135980
class AnimNotify_ResetClothingSimulation public : AnimNotify
{
	// Fields

};


instance 1ab5e135740
class AnimNotify_ResetDynamics public : AnimNotify
{
	// Fields

};


instance 1ab5e135500
class AnimNotify_ResumeClothingSimulation public : AnimNotify
{
	// Fields

};


instance 1ab5e1352c0
class AnimNotifyState_DisableRootMotion public : AnimNotifyState
{
	// Fields

};


instance 1ab5e135080
class AnimNotifyState_TimedParticleEffect public : AnimNotifyState
{
	// Fields
	ParticleSystem* PSTemplate; // 0x30
	FName SocketName; // 0x38
	Vector LocationOffset; // 0x40
	Rotator RotationOffset; // 0x4c
	bool bDestroyAtEnd; // 0x58

};


instance 1ab5e134e40
class AnimNotifyState_Trail public : AnimNotifyState
{
	// Fields
	ParticleSystem* PSTemplate; // 0x30
	FName FirstSocketName; // 0x38
	FName SecondSocketName; // 0x40
	BYTE WidthScaleMode; // 0x48
	FName WidthScaleCurve; // 0x4c
	bool bRecycleSpawnedSystems; // 0x54

	// Functions
	OverridePSTemplate 0x236a1 hash ae4d2044 params:( SkeletalMeshComponent MeshComp;AnimSequenceBase Animation;ParticleSystem ReturnValue; );
};


instance 1ab5e134c00
class AnimSequence public : AnimSequenceBase
{
	// Fields
	int NumFrames; // 0xa8
	TArray TrackToSkeletonMapTable; // 0xb0
	AnimCurveCompressionSettings* CurveCompressionSettings; // 0xd0
	BYTE AdditiveAnimType; // 0x1a8
	BYTE RefPoseType; // 0x1a9
	AnimSequence* RefPoseSeq; // 0x1b0
	int RefFrameIndex; // 0x1b8
	FName RetargetSource; // 0x1bc
	EAnimInterpolationType Interpolation; // 0x1c4
	bool bEnableRootMotion; // 0x1c5
	BYTE RootMotionRootLock; // 0x1c6
	bool bForceRootLock; // 0x1c7
	bool bUseNormalizedRootMotionScale; // 0x1c8
	bool bRootMotionSettingsCopiedFromMontage; // 0x1c9
	TArray AuthoredSyncMarkers; // 0x1d0

};


instance 1ab5e13de40
class AnimSet public : Object
{
	// Fields
	bool bAnimRotationOnly; // 0x28
	TArray TrackBoneNames; // 0x30
	TArray LinkupCache; // 0x40
	TArray BoneUseAnimTranslation; // 0x50
	TArray ForceUseMeshTranslation; // 0x60
	TArray UseTranslationBoneNames; // 0x70
	TArray ForceMeshTranslationBoneNames; // 0x80
	FName PreviewSkelMeshName; // 0x90
	FName BestRatioSkelMeshName; // 0x98

};


instance 1ab5e13dc00
class AnimSingleNodeInstance public : AnimInstance
{
	// Fields
	AnimationAsset* CurrentAsset; // 0x268
	DelegateProperty PostEvaluateAnimEvent; // 0x270 property 0x1ab71c22000 hash 0xe1aec4e5

	// Functions
	StopAnim 0x48abc hash 16bb330 params:(  );
	SetReverse 0x48ab6 hash 2459178d params:( None bInReverse; );
	SetPreviewCurveOverride 0x48aa9 hash e8f6cd18 params:( None PoseName;None Value;None bRemoveIfZero; );
	SetPositionWithPreviousTime 0x48a9a hash 671e162e params:( None InPosition;None InPreviousTime;None bFireNotifies; );
	SetPosition 0x40839 hash d2089706 params:( None InPosition;None bFireNotifies; );
	SetPlayRate 0x3fbb7 hash c22bc733 params:( None InPlayRate; );
	SetPlaying 0x48a94 hash 99478885 params:( None bIsPlaying; );
	SetLooping 0x3fb91 hash 6d567709 params:( None bIsLooping; );
	SetBlendSpaceInput 0x48a8a hash 113fe9f2 params:( Vector InBlendInput; );
	SetAnimationAsset 0x48a80 hash 80fa1211 params:( AnimationAsset NewAsset;None bIsLooping;None InPlayRate; );
	PlayAnim 0x48a7b hash b4cef240 params:( None bIsLooping;None InPlayRate;None InStartPosition; );
	GetLength 0x413a9 hash 10a63807 params:( None ReturnValue; );
	GetAnimationAsset 0x48a71 hash 9ec37a05 params:( AnimationAsset ReturnValue; );
};


instance 1ab5e13d9c0
class AnimStateMachineTypes public : Object
{
	// Fields

};


instance 1ab5e13d780
class AnimStreamable public : AnimSequenceBase
{
	// Fields
	int NumFrames; // 0xa8
	EAnimInterpolationType Interpolation; // 0xac
	FName RetargetSource; // 0xb0
	AnimCurveCompressionSettings* CurveCompressionSettings; // 0xc8
	bool bEnableRootMotion; // 0xd0
	BYTE RootMotionRootLock; // 0xd1
	bool bForceRootLock; // 0xd2
	bool bUseNormalizedRootMotionScale; // 0xd3

};


instance 1ab5e13d540
class ApplicationLifecycleComponent public : ActorComponent
{
	// Fields
	MulticastInlineDelegateProperty ApplicationWillDeactivateDelegate; // 0xb0 property 0x1ab712f2b00 hash 0xb7a5ed1a
	MulticastInlineDelegateProperty ApplicationHasReactivatedDelegate; // 0xc0 property 0x1ab712f2b80 hash 0xb7a5ed1a
	MulticastInlineDelegateProperty ApplicationWillEnterBackgroundDelegate; // 0xd0 property 0x1ab712f2c00 hash 0xb7a5ed1a
	MulticastInlineDelegateProperty ApplicationHasEnteredForegroundDelegate; // 0xe0 property 0x1ab712f2c80 hash 0xb7a5ed1a
	MulticastInlineDelegateProperty ApplicationWillTerminateDelegate; // 0xf0 property 0x1ab712f2d00 hash 0xb7a5ed1a
	MulticastInlineDelegateProperty ApplicationShouldUnloadResourcesDelegate; // 0x100 property 0x1ab712f2d80 hash 0xb7a5ed1a
	MulticastInlineDelegateProperty ApplicationReceivedStartupArgumentsDelegate; // 0x110 property 0x1ab712f2e80 hash 0xb7a5ed1a
	MulticastInlineDelegateProperty OnTemperatureChangeDelegate; // 0x120 property 0x1ab712f3000 hash 0xb7a5ed1a
	MulticastInlineDelegateProperty OnLowPowerModeDelegate; // 0x130 property 0x1ab712f3100 hash 0xb7a5ed1a

};


instance 1ab5e13d300
class ArrowComponent public : PrimitiveComponent
{
	// Fields
	Color ArrowColor; // 0x3d8
	float ArrowSize; // 0x3dc
	float ScreenSize; // 0x3e0
	bool bIsScreenSizeScaled; // 0x3e4
	bool bTreatAsASprite; // 0x3e4

	// Functions
	SetArrowColor 0x48aed hash 7d4cb73b params:( LinearColor NewColor; );
};


instance 1ab5e13d0c0
class AssetExportTask public : Object
{
	// Fields
	Object* Object; // 0x28
	Exporter* Exporter; // 0x30
	FString Filename; // 0x38
	bool bSelected; // 0x48
	bool bReplaceIdentical; // 0x49
	bool bPrompt; // 0x4a
	bool bAutomated; // 0x4b
	bool bUseFileArchive; // 0x4c
	bool bWriteEmptyFiles; // 0x4d
	TArray IgnoreObjectList; // 0x50
	Object* Options; // 0x60
	TArray Errors; // 0x68

};


instance 1ab5e13ce80
class AssetManager public : Object
{
	// Fields
	TArray ObjectReferenceList; // 0x2c0
	bool bIsGlobalAsyncScanEnvironment; // 0x2d0
	bool bShouldGuessTypeAndName; // 0x2d1
	bool bShouldUseSynchronousLoad; // 0x2d2
	bool bIsLoadingFromPakFiles; // 0x2d3
	bool bShouldAcquireMissingChunksOnLoad; // 0x2d4
	bool bOnlyCookProductionAssets; // 0x2d5
	bool bIsBulkScanning; // 0x2d6
	bool bIsPrimaryAssetDirectoryCurrent; // 0x2d7
	bool bIsManagementDatabaseCurrent; // 0x2d8
	bool bUpdateManagementDatabaseAfterScan; // 0x2d9
	bool bIncludeOnlyOnDiskAssets; // 0x2da
	int NumberOfSpawnedNotifications; // 0x2dc

};


instance 1ab5e13cc40
class AssetManagerSettings public : DeveloperSettings
{
	// Fields
	TArray PrimaryAssetTypesToScan; // 0x38
	TArray DirectoriesToExclude; // 0x48
	TArray PrimaryAssetRules; // 0x58
	TArray CustomPrimaryAssetRules; // 0x68
	bool bOnlyCookProductionAssets; // 0x78
	bool bShouldManagerDetermineTypeAndName; // 0x79
	bool bShouldGuessTypeAndNameInEditor; // 0x7a
	bool bShouldAcquireMissingChunksOnLoad; // 0x7b
	TArray PrimaryAssetIdRedirects; // 0x80
	TArray PrimaryAssetTypeRedirects; // 0x90
	TArray AssetPathRedirects; // 0xa0
	SetProperty MetaDataTagsForAssetRegistry; // 0xb0 property 0x1ab71167720 hash 0xb0194396

};


instance 1ab5e13ca00
class AssetMappingTable public : Object
{
	// Fields
	TArray MappedAssets; // 0x28

};


instance 1ab5e13c7c0
class AsyncActionHandleSaveGame public : BlueprintAsyncActionBase
{
	// Fields
	MulticastInlineDelegateProperty Completed; // 0x30 property 0x1ab71c22180 hash 0xb7a5ed1a
	SaveGame* SaveGameObject; // 0x60

	// Functions
	AsyncSaveGameToSlot 0x48b34 hash 56ce8951 params:( Object WorldContextObject;SaveGame SaveGameObject;None SlotName;None UserIndex;AsyncActionHandleSaveGame ReturnValue; );
	AsyncLoadGameFromSlot 0x48b28 hash ee0e8373 params:( Object WorldContextObject;None SlotName;None UserIndex;AsyncActionHandleSaveGame ReturnValue; );
};


instance 1ab5e13c580
class AsyncActionLoadPrimaryAssetBase public : BlueprintAsyncActionBase
{
	// Fields

};


instance 1ab5e13c340
class AsyncActionLoadPrimaryAsset public : AsyncActionLoadPrimaryAssetBase
{
	// Fields
	MulticastInlineDelegateProperty Completed; // 0x78 property 0x1ab71c24000 hash 0xb7a5ed1a

	// Functions
	AsyncLoadPrimaryAsset 0x48b5f hash 14b89527 params:( Object WorldContextObject;PrimaryAssetId PrimaryAsset;LoadBundles LoadBundles;AsyncActionLoadPrimaryAsset ReturnValue; );
};


instance 1ab5e13c100
class AsyncActionLoadPrimaryAssetClass public : AsyncActionLoadPrimaryAssetBase
{
	// Fields
	MulticastInlineDelegateProperty Completed; // 0x78 property 0x1ab71c23d80 hash 0xb7a5ed1a

	// Functions
	AsyncLoadPrimaryAssetClass 0x48b7c hash b850341d params:( Object WorldContextObject;PrimaryAssetId PrimaryAsset;LoadBundles LoadBundles;AsyncActionLoadPrimaryAssetClass ReturnValue; );
};


instance 1ab5e13bec0
class AsyncActionLoadPrimaryAssetList public : AsyncActionLoadPrimaryAssetBase
{
	// Fields
	MulticastInlineDelegateProperty Completed; // 0x78 property 0x1ab71c23a80 hash 0xb7a5ed1a

	// Functions
	AsyncLoadPrimaryAssetList 0x48b9b hash 3be84b63 params:( Object WorldContextObject;PrimaryAssetList PrimaryAssetList;LoadBundles LoadBundles;AsyncActionLoadPrimaryAssetList ReturnValue; );
};


instance 1ab5e13bc80
class AsyncActionLoadPrimaryAssetClassList public : AsyncActionLoadPrimaryAssetBase
{
	// Fields
	MulticastInlineDelegateProperty Completed; // 0x78 property 0x1ab71c23780 hash 0xb7a5ed1a

	// Functions
	AsyncLoadPrimaryAssetClassList 0x48bbc hash f827559 params:( Object WorldContextObject;PrimaryAssetList PrimaryAssetList;LoadBundles LoadBundles;AsyncActionLoadPrimaryAssetClassList ReturnValue; );
};


instance 1ab5e13ba40
class AsyncActionChangePrimaryAssetBundles public : AsyncActionLoadPrimaryAssetBase
{
	// Fields
	MulticastInlineDelegateProperty Completed; // 0x78 property 0x1ab71c23200 hash 0xb7a5ed1a

	// Functions
	AsyncChangeBundleStateForPrimaryAssetList 0x48bf7 hash 8da1c96b params:( Object WorldContextObject;PrimaryAssetList PrimaryAssetList;AddBundles AddBundles;RemoveBundles RemoveBundles;AsyncActionChangePrimaryAssetBundles ReturnValue; );
	AsyncChangeBundleStateForMatchingPrimaryAssets 0x48bdf hash 631636ad params:( Object WorldContextObject;NewBundles NewBundles;OldBundles OldBundles;AsyncActionChangePrimaryAssetBundles ReturnValue; );
};


instance 1ab5e13b800
class AtmosphericFog public : Info
{
	// Fields
	AtmosphericFogComponent* AtmosphericFogComponent; // 0x218

};


instance 1ab5e13b5c0
class AtmosphericFogComponent public : SceneComponent
{
	// Fields
	float SunMultiplier; // 0x1f0
	float FogMultiplier; // 0x1f4
	float DensityMultiplier; // 0x1f8
	float DensityOffset; // 0x1fc
	float DistanceScale; // 0x200
	float AltitudeScale; // 0x204
	float DistanceOffset; // 0x208
	float GroundOffset; // 0x20c
	float StartDistance; // 0x210
	float SunDiscScale; // 0x214
	float DefaultBrightness; // 0x218
	Color DefaultLightColor; // 0x21c
	bool bDisableSunDisk; // 0x220
	bool bAtmosphereAffectsSunIlluminance; // 0x220
	bool bDisableGroundScattering; // 0x220
	AtmospherePrecomputeParameters PrecomputeParams; // 0x224
	Texture2D* TransmittanceTexture; // 0x250
	Texture2D* IrradianceTexture; // 0x258

	// Functions
	StartPrecompute 0x48ca3 hash d822d5d7 params:(  );
	SetSunMultiplier 0x48c9a hash 5e7adf6e params:( None NewSunMultiplier; );
	SetStartDistance 0x48c91 hash 6768fc2a params:( None NewStartDistance; );
	SetPrecomputeParams 0x48c86 hash ce1d6859 params:( None DensityHeight;None MaxScatteringOrder;None InscatterAltitudeSampleNum; );
	SetFogMultiplier 0x48c7d hash 8b6a3ed4 params:( None NewFogMultiplier; );
	SetDistanceScale 0x48c74 hash 3bb2e9c4 params:( None NewDistanceScale; );
	SetDistanceOffset 0x48c6a hash a8f4a563 params:( None NewDistanceOffset; );
	SetDensityOffset 0x48c61 hash 72035b58 params:( None NewDensityOffset; );
	SetDensityMultiplier 0x48c56 hash db7543b8 params:( None NewDensityMultiplier; );
	SetDefaultLightColor 0x48c4b hash 905809ed params:( LinearColor NewLightColor; );
	SetDefaultBrightness 0x48c40 hash f34fe42f params:( None NewBrightness; );
	SetAltitudeScale 0x48c37 hash a15bd035 params:( None NewAltitudeScale; );
	DisableSunDisk 0x48c2f hash d162e9ba params:( None NewSunDisk; );
	DisableGroundScattering 0x48c22 hash 494757dc params:( None NewGroundScattering; );
};


instance 1ab5e13b380
class AudioSettings public : DeveloperSettings
{
	// Fields
	SoftObjectPath DefaultSoundClassName; // 0x38
	SoftObjectPath DefaultMediaSoundClassName; // 0x50
	SoftObjectPath DefaultSoundConcurrencyName; // 0x68
	SoftObjectPath DefaultBaseSoundMix; // 0x80
	SoftObjectPath VoiPSoundClass; // 0x98
	EVoiceSampleRate VoiPSampleRate; // 0xb0
	float VoipBufferingDelay; // 0xb4
	float DefaultReverbSendLevel; // 0xb8
	bool bEnableLegacyReverb; // 0xbc
	int MaximumConcurrentStreams; // 0xc0
	float GlobalMinPitchScale; // 0xc4
	float GlobalMaxPitchScale; // 0xc8
	TArray QualityLevels; // 0xd0
	bool bAllowPlayWhenSilent; // 0xe0
	bool bDisableMasterEQ; // 0xe0
	bool bAllowCenterChannel3DPanning; // 0xe0
	int NumStoppingSources; // 0xe4
	EPanningMethod PanningMethod; // 0xe8
	EMonoChannelUpmixMethod MonoChannelUpmixMethod; // 0xe9
	FString DialogueFilenameFormat; // 0xf0

};


instance 1ab5e13b140
class AudioVolume public : Volume
{
	// Fields
	float Priority; // 0x250
	bool bEnabled; // 0x254
	ReverbSettings Settings; // 0x258
	InteriorSettings AmbientZoneSettings; // 0x278

	// Functions
	SetReverbSettings 0x48cd3 hash cd75ef08 params:( ReverbSettings NewReverbSettings; );
	SetPriority 0x48ccc hash a20f31f3 params:( None NewPriority; );
	SetInteriorSettings 0x48cc1 hash ffc4d8ee params:( InteriorSettings NewInteriorSettings; );
	SetEnabled 0x48cbb hash 4f24ac5c params:( None bNewEnabled; );
	OnRep_bEnabled 0x456da hash f2b2e395 params:(  );
};


instance 1ab5e13af00
class AutomationTestSettings public : Object
{
	// Fields
	TArray EngineTestModules; // 0x28
	TArray EditorTestModules; // 0x38
	SoftObjectPath AutomationTestmap; // 0x48
	TArray EditorPerformanceTestMaps; // 0x60
	TArray AssetsToOpen; // 0x70
	BuildPromotionTestSettings BuildPromotionTest; // 0x80
	MaterialEditorPromotionSettings MaterialEditorPromotionTest; // 0x270
	ParticleEditorPromotionSettings ParticleEditorPromotionTest; // 0x2a0
	BlueprintEditorPromotionSettings BlueprintEditorPromotionTest; // 0x2b0
	TArray TestLevelFolders; // 0x2e0
	TArray ExternalTools; // 0x2f0
	TArray ImportExportTestDefinitions; // 0x300
	TArray LaunchOnSettings; // 0x310
	IntPoint DefaultScreenshotResolution; // 0x320

};


instance 1ab5e13acc0
class AvoidanceManager public : Object
{
	// Fields
	float DefaultTimeToLive; // 0x30
	float LockTimeAfterAvoid; // 0x34
	float LockTimeAfterClean; // 0x38
	float DeltaTimeToPredict; // 0x3c
	float ArtificialRadiusExpansion; // 0x40
	float TestHeightDifference; // 0x44
	float HeightCheckMargin; // 0x48

	// Functions
	RegisterMovementComponent 0x48d15 hash ec11b968 params:( MovementComponent MovementComp;None AvoidanceWeight;None ReturnValue; );
	GetObjectCount 0x48d0d hash f77979e5 params:( None ReturnValue; );
	GetNewAvoidanceUID 0x48d03 hash ce9b31fb params:( None ReturnValue; );
	GetAvoidanceVelocityForComponent 0x48cf2 hash 589cdd8 params:( MovementComponent MovementComp;Vector ReturnValue; );
};


instance 1ab5e13aa80
class BandwidthTestActor public : Actor
{
	// Fields
	BandwidthTestGenerator BandwidthGenerator; // 0x218

};


instance 1ab5e13a840
class BillboardComponent public : PrimitiveComponent
{
	// Fields
	Texture2D* Sprite; // 0x3d8
	bool bIsScreenSizeScaled; // 0x3e0
	float ScreenSize; // 0x3e4
	float U; // 0x3e8
	float UL; // 0x3ec
	float V; // 0x3f0
	float VL; // 0x3f4

	// Functions
	SetUV 0x48d3f hash e164cfc params:( None NewU;None NewUL;None NewV;None NewVL; );
	SetSpriteAndUV 0x48d37 hash 5ae96c26 params:( Texture2D NewSprite;None NewU;None NewUL;None NewV;None NewVL; );
	SetSprite 0x3fc80 hash 9798e808 params:( Texture2D NewSprite; );
};


instance 1ab5e13a600
class BlendableInterface public : Interface
{
	// Fields

};


instance 1ab5e13a180
class Skeleton public : Object
{
	// Fields
	TArray BoneTree; // 0x38
	TArray RefLocalPoses; // 0x48
	Guid VirtualBoneGuid; // 0x170
	TArray VirtualBones; // 0x180
	TArray Sockets; // 0x190
	SmartNameContainer SmartNames; // 0x1f0
	TArray BlendProfiles; // 0x270
	TArray SlotGroups; // 0x280
	TArray AssetUserData; // 0x358

};


instance 1ab5e13a3c0
class BlendProfile public : Object
{
	// Fields
	Skeleton* OwningSkeleton; // 0x30
	TArray ProfileEntries; // 0x38

};


instance 1ab5e139f40
class BlockingVolume public : Volume
{
	// Fields

};


instance 1ab5e139d00
class BlueprintExtension public : Object
{
	// Fields

};


instance 1ab5e139ac0
class BlueprintMapLibrary public : BlueprintFunctionLibrary
{
	// Fields

	// Functions
	SetMapPropertyByName 0x48da4 hash b277f290 params:( Object Object;None PropertyName;Value_Key Value; );
	Map_Values 0x48d9e hash 4d602cb2 params:( TargetMap_Key TargetMap;Values Values; );
	Map_Remove 0x48d98 hash 44546130 params:( TargetMap_Key TargetMap;None Key;None ReturnValue; );
	Map_Length 0x48d92 hash 3655d784 params:( TargetMap_Key TargetMap;None ReturnValue; );
	Map_Keys 0x48d8d hash c275133e params:( TargetMap_Key TargetMap;Keys Keys; );
	Map_Find 0x48d88 hash c27264e3 params:( TargetMap_Key TargetMap;None Key;None Value;None ReturnValue; );
	Map_Contains 0x48d81 hash d7809261 params:( TargetMap_Key TargetMap;None Key;None ReturnValue; );
	Map_Clear 0x48d7b hash 108a36a9 params:( TargetMap_Key TargetMap; );
	Map_Add 0x48d76 hash 15683aab params:( TargetMap_Key TargetMap;None Key;None Value; );
};


instance 1ab5e139880
class BlueprintPathsLibrary public : BlueprintFunctionLibrary
{
	// Fields

	// Functions
	VideoCaptureDir 0x490c4 hash 6e205c8f params:( None ReturnValue; );
	ValidatePath 0x490bd hash 58742f3c params:( None InPath;None bDidSucceed;None OutReason; );
	Split 0x490b9 hash e1c35d1 params:( None InPath;None PathPart;None FilenamePart;None ExtensionPart; );
	SourceConfigDir 0x490b0 hash 6e31ef2b params:( None ReturnValue; );
	ShouldSaveToUserDir 0x490a5 hash 30637024 params:( None ReturnValue; );
	ShaderWorkingDir 0x4909c hash 702fd63c params:( None ReturnValue; );
	SetProjectFilePath 0x49092 hash 45b3c915 params:( None NewGameProjectFilePath; );
	SetExtension 0x4908b hash a35182ae params:( None InPath;None InNewExtension;None ReturnValue; );
	ScreenShotDir 0x49083 hash 7b922ca2 params:( None ReturnValue; );
	SandboxesDir 0x4907c hash edd4042b params:( None ReturnValue; );
	RootDir 0x49077 hash b6ed1c28 params:( None ReturnValue; );
	RemoveDuplicateSlashes 0x4906b hash b913a2a1 params:( None InPath;None OutPath; );
	ProjectUserDir 0x49063 hash af8cf69a params:( None ReturnValue; );
	ProjectSavedDir 0x4905a hash 85dd3cae params:( None ReturnValue; );
	ProjectPluginsDir 0x49050 hash 23b182dd params:( None ReturnValue; );
	ProjectPersistentDownloadDir 0x49041 hash f93f2404 params:( None ReturnValue; );
	ProjectModsDir 0x49039 hash 3e54e1ee params:( None ReturnValue; );
	ProjectLogDir 0x49031 hash 73ec5b5d params:( None ReturnValue; );
	ProjectIntermediateDir 0x49025 hash 6125b936 params:( None ReturnValue; );
	ProjectDir 0x4901f hash 9b674e1b params:( None ReturnValue; );
	ProjectContentDir 0x49015 hash b631a4b6 params:( None ReturnValue; );
	ProjectConfigDir 0x4900c hash 8047b6f1 params:( None ReturnValue; );
	ProfilingDir 0x49005 hash 8fa26aee params:( None ReturnValue; );
	NormalizeFilename 0x48ffb hash ef9913d7 params:( None InPath;None OutPath; );
	NormalizeDirectoryName 0x48fef hash a8bbbfac params:( None InPath;None OutPath; );
	MakeValidFileName 0x48fe5 hash b42b65f4 params:( None inString;None InReplacementChar;None ReturnValue; );
	MakeStandardFilename 0x48fda hash 27c66135 params:( None InPath;None OutPath; );
	MakePlatformFilename 0x48fcf hash 8a7e57e9 params:( None InPath;None OutPath; );
	MakePathRelativeTo 0x48fc5 hash 459eb4cf params:( None InPath;None InRelativeTo;None OutPath;None ReturnValue; );
	LaunchDir 0x48fbf hash 422eaa1f params:( None ReturnValue; );
	IsSamePath 0x48fb9 hash 7a5490f4 params:( None PathA;None PathB;None ReturnValue; );
	IsRestrictedPath 0x48fb0 hash ddfdc27 params:( None InPath;None ReturnValue; );
	IsRelative 0x48faa hash bf72045d params:( None InPath;None ReturnValue; );
	IsProjectFilePathSet 0x48f9f hash b5103a31 params:( None ReturnValue; );
	IsDrive 0x48f9a hash 86b047b params:( None InPath;None ReturnValue; );
	HasProjectPersistentDownloadDir 0x48f89 hash 3aa24320 params:( None ReturnValue; );
	GetToolTipLocalizationPaths 0x48f7a hash d9944639 params:( ReturnValue ReturnValue; );
	GetRestrictedFolderNames 0x48f6d hash 6fa4ebce params:( ReturnValue ReturnValue; );
	GetRelativePathToRoot 0x48f61 hash dacb22b5 params:( None ReturnValue; );
	GetPropertyNameLocalizationPaths 0x48f50 hash 26c05b4 params:( ReturnValue ReturnValue; );
	GetProjectFilePath 0x48f46 hash 1caa2f89 params:( None ReturnValue; );
	GetPath 0x48f41 hash 51202332 params:( None InPath;None ReturnValue; );
	GetInvalidFileSystemChars 0x48f33 hash 97397642 params:( None ReturnValue; );
	GetGameLocalizationPaths 0x48f26 hash fa8fcce8 params:( ReturnValue ReturnValue; );
	GetExtension 0x48f1f hash 57e92222 params:( None InPath;None bIncludeDot;None ReturnValue; );
	GetEngineLocalizationPaths 0x48f11 hash c3c4c6c4 params:( ReturnValue ReturnValue; );
	GetEditorLocalizationPaths 0x48f03 hash 78ccf195 params:( ReturnValue ReturnValue; );
	GetCleanFilename 0x48efa hash 345b4709 params:( None InPath;None ReturnValue; );
	GetBaseFilename 0x48ef1 hash 56042201 params:( None InPath;None bRemovePath;None ReturnValue; );
	GeneratedConfigDir 0x48ee7 hash cc9333c9 params:( None ReturnValue; );
	GameUserDeveloperDir 0x48edc hash 3f4eb643 params:( None ReturnValue; );
	GameSourceDir 0x48ed4 hash d197a08f params:( None ReturnValue; );
	GameDevelopersDir 0x48eca hash 6423c997 params:( None ReturnValue; );
	GameAgnosticSavedDir 0x48ebf hash 406832a9 params:( None ReturnValue; );
	FileExists 0x48eb9 hash cbc6ab05 params:( None InPath;None ReturnValue; );
	FeaturePackDir 0x48eb1 hash 7097592f params:( None ReturnValue; );
	EnterprisePluginsDir 0x48ea6 hash 3e1ea5e7 params:( None ReturnValue; );
	EnterpriseFeaturePackDir 0x48e99 hash ece894d0 params:( None ReturnValue; );
	EnterpriseDir 0x48e91 hash 61462865 params:( None ReturnValue; );
	EngineVersionAgnosticUserDir 0x48e82 hash 104addb7 params:( None ReturnValue; );
	EngineUserDir 0x48e7a hash 10f9cd39 params:( None ReturnValue; );
	EngineSourceDir 0x48e71 hash 6e73a66b params:( None ReturnValue; );
	EngineSavedDir 0x48e69 hash 14e4e72d params:( None ReturnValue; );
	EnginePluginsDir 0x48e60 hash 934dc91c params:( None ReturnValue; );
	EngineIntermediateDir 0x48e54 hash ce52bed5 params:( None ReturnValue; );
	EngineDir 0x48e4e hash d18bad3a params:( None ReturnValue; );
	EngineContentDir 0x48e45 hash 25cdeaf5 params:( None ReturnValue; );
	EngineConfigDir 0x48e3c hash f044b150 params:( None ReturnValue; );
	DirectoryExists 0x48e33 hash 18a7699a params:( None InPath;None ReturnValue; );
	DiffDir 0x48e2e hash 72944bfd params:( None ReturnValue; );
	CreateTempFilename 0x48e24 hash 786b9a50 params:( None Path;None Prefix;None Extension;None ReturnValue; );
	ConvertToSandboxPath 0x48e19 hash 4e7b225 params:( None InPath;None InSandboxName;None ReturnValue; );
	ConvertRelativePathToFull 0x48e0b hash c136c9c5 params:( None InPath;None InBasePath;None ReturnValue; );
	ConvertFromSandboxPath 0x48dff hash 79b855f6 params:( None InPath;None InSandboxName;None ReturnValue; );
	Combine 0x48dfa hash 34161b02 params:( InPaths InPaths;None ReturnValue; );
	CollapseRelativeDirectories 0x48deb hash 208cd3f1 params:( None InPath;None OutPath;None ReturnValue; );
	CloudDir 0x48de6 hash d5e9783b params:( None ReturnValue; );
	ChangeExtension 0x48ddd hash bc657028 params:( None InPath;None InNewExtension;None ReturnValue; );
	BugItDir 0x48dd8 hash 88b710ff params:( None ReturnValue; );
	AutomationTransientDir 0x48dcc hash a8b0f09d params:( None ReturnValue; );
	AutomationLogDir 0x48dc3 hash f33dd107 params:( None ReturnValue; );
	AutomationDir 0x48dbb hash 1e429405 params:( None ReturnValue; );
};


instance 1ab5e139640
class PlatformGameInstance public : GameInstance
{
	// Fields
	MulticastInlineDelegateProperty ApplicationWillDeactivateDelegate; // 0x168 property 0x1ab712f8080 hash 0xb7a5ed1a
	MulticastInlineDelegateProperty ApplicationHasReactivatedDelegate; // 0x178 property 0x1ab712f8100 hash 0xb7a5ed1a
	MulticastInlineDelegateProperty ApplicationWillEnterBackgroundDelegate; // 0x188 property 0x1ab712f8180 hash 0xb7a5ed1a
	MulticastInlineDelegateProperty ApplicationHasEnteredForegroundDelegate; // 0x198 property 0x1ab712f8280 hash 0xb7a5ed1a
	MulticastInlineDelegateProperty ApplicationWillTerminateDelegate; // 0x1a8 property 0x1ab712f8300 hash 0xb7a5ed1a
	MulticastInlineDelegateProperty ApplicationShouldUnloadResourcesDelegate; // 0x1b8 property 0x1ab712f8380 hash 0xb7a5ed1a
	MulticastInlineDelegateProperty ApplicationReceivedStartupArgumentsDelegate; // 0x1c8 property 0x1ab712f6380 hash 0xb7a5ed1a
	MulticastInlineDelegateProperty ApplicationRegisteredForRemoteNotificationsDelegate; // 0x1d8 property 0x1ab712f6500 hash 0xb7a5ed1a
	MulticastInlineDelegateProperty ApplicationRegisteredForUserNotificationsDelegate; // 0x1e8 property 0x1ab712f6580 hash 0xb7a5ed1a
	MulticastInlineDelegateProperty ApplicationFailedToRegisterForRemoteNotificationsDelegate; // 0x1f8 property 0x1ab712f6600 hash 0xb7a5ed1a
	MulticastInlineDelegateProperty ApplicationReceivedRemoteNotificationDelegate; // 0x208 property 0x1ab712f6700 hash 0xb7a5ed1a
	MulticastInlineDelegateProperty ApplicationReceivedLocalNotificationDelegate; // 0x218 property 0x1ab712f6800 hash 0xb7a5ed1a
	MulticastInlineDelegateProperty ApplicationReceivedScreenOrientationChangedNotificationDelegate; // 0x228 property 0x1ab712f6900 hash 0xb7a5ed1a

};


instance 1ab5e13fdc0
class BlueprintPlatformLibrary public : BlueprintFunctionLibrary
{
	// Fields

	// Functions
	ScheduleLocalNotificationFromNow 0x4915e hash 74ed452c params:( None inSecondsFromNow;None Title;None Body;None Action;None ActivationEvent;None ReturnValue; );
	ScheduleLocalNotificationBadgeFromNow 0x4914a hash 4791595f params:( None inSecondsFromNow;None ActivationEvent; );
	ScheduleLocalNotificationBadgeAtTime 0x49137 hash a141667b params:( DateTime FireDateTime;None LocalTime;None ActivationEvent;None ReturnValue; );
	ScheduleLocalNotificationAtTime 0x49126 hash ffb88ca8 params:( DateTime FireDateTime;None LocalTime;None Title;None Body;None Action;None ActivationEvent;None ReturnValue; );
	GetLaunchNotification 0x4911a hash bd2674a7 params:( None NotificationLaunchedApp;None ActivationEvent;None FireDate; );
	GetDeviceOrientation 0x4910f hash 6c4af941 params:( EScreenOrientation ReturnValue; );
	ClearAllLocalNotifications 0x49101 hash 905bce0a params:(  );
	CancelLocalNotificationById 0x490f2 hash 43cf5ac5 params:( None NotificationId; );
	CancelLocalNotification 0x490e5 hash fcba06bd params:( None ActivationEvent; );
};


instance 1ab5e13fb80
class BlueprintSetLibrary public : BlueprintFunctionLibrary
{
	// Fields

	// Functions
	SetSetPropertyByName 0x491c6 hash e1858d1e params:( Object Object;None PropertyName;Value Value; );
	Set_Union 0x491c0 hash b1ac07d9 params:( A A;B B;Result Result; );
	Set_ToArray 0x491b9 hash 7f563cf2 params:( A A;Result Result; );
	Set_RemoveItems 0x491b0 hash d0c49320 params:( TargetSet TargetSet;Items Items; );
	Set_Remove 0x491aa hash df8cdf7e params:( TargetSet TargetSet;None Item;None ReturnValue; );
	Set_Length 0x491a4 hash d18e55d2 params:( TargetSet TargetSet;None ReturnValue; );
	Set_Intersection 0x4919b hash 35459487 params:( A A;B B;Result Result; );
	Set_Difference 0x49193 hash da0e1cfb params:( A A;B B;Result Result; );
	Set_Contains 0x4918c hash 22d1dc2f params:( TargetSet TargetSet;None ItemToFind;None ReturnValue; );
	Set_Clear 0x49186 hash b0652337 params:( TargetSet TargetSet; );
	Set_AddItems 0x4917f hash e13a3c3b params:( TargetSet TargetSet;NewItems NewItems; );
	Set_Add 0x4917a hash ece2abb9 params:( TargetSet TargetSet;None NewItem; );
};


instance 1ab5e13f940
class BodySetup public : Object
{
	// Fields
	KAggregateGeom AggGeom; // 0x28
	FName BoneName; // 0x80
	BYTE PhysicsType; // 0x88
	bool bAlwaysFullAnimWeight; // 0x89
	bool bConsiderForBounds; // 0x89
	bool bMeshCollideAll; // 0x89
	bool bDoubleSidedGeometry; // 0x89
	bool bGenerateNonMirroredCollision; // 0x89
	bool bSharedCookedData; // 0x89
	bool bGenerateMirroredCollision; // 0x89
	BYTE CollisionReponse; // 0x8b
	BYTE CollisionTraceFlag; // 0x8c
	PhysicalMaterial* PhysMaterial; // 0x90
	WalkableSlopeOverride WalkableSlopeOverride; // 0x98
	BodyInstance DefaultInstance; // 0x110
	Vector BuildScale3D; // 0x228

};


instance 1ab5e13f700
class BoneMaskFilter public : Object
{
	// Fields
	TArray BlendPoses; // 0x28

};


instance 1ab5e13f280
class BookmarkBase public : Object
{
	// Fields

};


instance 1ab5e13f4c0
class BookMark public : BookmarkBase
{
	// Fields
	Vector Location; // 0x28
	Rotator Rotation; // 0x34
	TArray HiddenLevels; // 0x40

};


instance 1ab5e13f040
class BookMark2D public : BookmarkBase
{
	// Fields
	float Zoom2D; // 0x28
	IntPoint Location; // 0x2c

};


instance 1ab5e13ebc0
class ReflectionCapture public : Actor
{
	// Fields
	ReflectionCaptureComponent* CaptureComponent; // 0x218

};


instance 1ab5e13ee00
class BoxReflectionCapture public : ReflectionCapture
{
	// Fields

};


instance 1ab5e13e740
class ReflectionCaptureComponent public : SceneComponent
{
	// Fields
	BillboardComponent* CaptureOffsetComponent; // 0x1f0
	EReflectionSourceType ReflectionSourceType; // 0x1f8
	TextureCube* Cubemap; // 0x200
	float SourceCubemapAngle; // 0x208
	float Brightness; // 0x20c
	Vector CaptureOffset; // 0x210
	Guid MapBuildDataId; // 0x21c

};


instance 1ab5e13e980
class BoxReflectionCaptureComponent public : ReflectionCaptureComponent
{
	// Fields
	float BoxTransitionDistance; // 0x268
	BoxComponent* PreviewInfluenceBox; // 0x270
	BoxComponent* PreviewCaptureBox; // 0x278

};


instance 1ab5e13e500
class Breakpoint public : Object
{
	// Fields
	bool bEnabled; // 0x28
	EdGraphNode* Node; // 0x30
	bool bStepOnce; // 0x38
	bool bStepOnce_WasPreviouslyDisabled; // 0x38
	bool bStepOnce_RemoveAfterHit; // 0x38

};


instance 1ab5e13e2c0
class BrushBuilder public : Object
{
	// Fields
	FString BitmapFilename; // 0x28
	FString ToolTip; // 0x38
	bool NotifyBadParams; // 0x48
	TArray Vertices; // 0x50
	TArray Polys; // 0x60
	FName Layer; // 0x70
	bool MergeCoplanars; // 0x78

};


instance 1ab5e13e080
class BrushComponent public : PrimitiveComponent
{
	// Fields
	Model* Brush; // 0x3d8
	BodySetup* BrushBodySetup; // 0x3e0

};


instance 1ab5e1449c0
class BrushShape public : Brush
{
	// Fields

};


instance 1ab5e144780
class ButtonStyleAsset public : Object
{
	// Fields
	ButtonStyle ButtonStyle; // 0x28

};


instance 1ab5e144540
class CameraAnim public : Object
{
	// Fields
	InterpGroup* CameraInterpGroup; // 0x28
	float AnimLength; // 0x30
	Box BoundingBox; // 0x34
	bool bRelativeToInitialTransform; // 0x50
	bool bRelativeToInitialFOV; // 0x50
	float BaseFOV; // 0x54
	PostProcessSettings BasePostProcessSettings; // 0x60
	float BasePostProcessBlendWeight; // 0x590

};


instance 1ab5e144300
class CameraAnimInst public : Object
{
	// Fields
	CameraAnim* CamAnim; // 0x28
	InterpGroupInst* InterpGroupInst; // 0x30
	float PlayRate; // 0x50
	InterpTrackMove* MoveTrack; // 0x68
	InterpTrackInstMove* MoveInst; // 0x70
	BYTE PlaySpace; // 0x78

	// Functions
	Stop 0x3e2ef hash 7c8c8f2b params:( None bImmediate; );
	SetScale 0x4925d hash 88719659 params:( None NewDuration; );
	SetDuration 0x49256 hash 89ea1c57 params:( None NewDuration; );
};


instance 1ab5e1440c0
class CameraBlockingVolume public : Volume
{
	// Fields

};


instance 1ab5e143e80
class CameraModifier public : Object
{
	// Fields
	bool bDebug; // 0x28
	bool bExclusive; // 0x28
	BYTE Priority; // 0x2c
	PlayerCameraManager* CameraOwner; // 0x30
	float AlphaInTime; // 0x38
	float AlphaOutTime; // 0x3c
	float Alpha; // 0x40

	// Functions
	IsDisabled 0x49286 hash 180b9b39 params:( None ReturnValue; );
	GetViewTarget 0x42d6f hash 1a4c2a27 params:( Actor ReturnValue; );
	EnableModifier 0x4927e hash c404317b params:(  );
	DisableModifier 0x49275 hash 919fdb88 params:( None bImmediate; );
	BlueprintModifyPostProcess 0x251c1 hash bc9feea7 params:( None DeltaTime;None PostProcessBlendWeight;PostProcessSettings PostProcessSettings; );
	BlueprintModifyCamera 0x251b5 hash 4b50850b params:( None DeltaTime;Vector ViewLocation;Rotator ViewRotation;None FOV;Vector NewViewLocation;Rotator NewViewRotation;None NewFOV; );
};


instance 1ab5e143c40
class CameraModifier_CameraShake public : CameraModifier
{
	// Fields
	TArray ActiveShakes; // 0x48
	MapProperty ExpiredPooledShakesMap; // 0x58 property 0x1ab71168ee0 hash 0xadd0fb88
	float SplitScreenShakeScale; // 0xa8

};


instance 1ab5e143a00
class Canvas public : Object
{
	// Fields
	float OrgX; // 0x28
	float OrgY; // 0x2c
	float ClipX; // 0x30
	float ClipY; // 0x34
	Color DrawColor; // 0x38
	bool bCenterX; // 0x3c
	bool bCenterY; // 0x3c
	bool bNoSmooth; // 0x3c
	int SizeX; // 0x40
	int SizeY; // 0x44
	Plane ColorModulate; // 0x50
	Texture2D* DefaultTexture; // 0x60
	Texture2D* GradientTexture0; // 0x68
	ReporterGraph* ReporterGraph; // 0x70

	// Functions
	K2_TextSize 0x492fc hash 67273e1 params:( Font RenderFont;None RenderText;Vector2D Scale;Vector2D ReturnValue; );
	K2_StrLen 0x492f6 hash 9258e019 params:( Font RenderFont;None RenderText;Vector2D ReturnValue; );
	K2_Project 0x492f0 hash f1b60498 params:( Vector WorldLocation;Vector ReturnValue; );
	K2_DrawTriangle 0x492e7 hash 50b91cc5 params:( Texture RenderTexture;Triangles Triangles; );
	K2_DrawTexture 0x492df hash 789dfa20 params:( Texture RenderTexture;Vector2D ScreenPosition;Vector2D ScreenSize;Vector2D CoordinatePosition;Vector2D CoordinateSize;LinearColor RenderColor;EBlendMode BlendMode;None Rotation;Vector2D PivotPoint; );
	K2_DrawText 0x492d8 hash f59a59d4 params:( Font RenderFont;None RenderText;Vector2D ScreenPosition;Vector2D Scale;LinearColor RenderColor;None Kerning;LinearColor ShadowColor;Vector2D ShadowOffset;None bCentreX;None bCentreY;None bOutlined;LinearColor OutlineColor; );
	K2_DrawPolygon 0x492d0 hash 5b31f957 params:( Texture RenderTexture;Vector2D ScreenPosition;Vector2D Radius;None NumberOfSides;LinearColor RenderColor; );
	K2_DrawMaterialTriangle 0x492c3 hash 706e0a34 params:( MaterialInterface RenderMaterial;Triangles Triangles; );
	K2_DrawMaterial 0x492ba hash d8419b5e params:( MaterialInterface RenderMaterial;Vector2D ScreenPosition;Vector2D ScreenSize;Vector2D CoordinatePosition;Vector2D CoordinateSize;None Rotation;Vector2D PivotPoint; );
	K2_DrawLine 0x492b3 hash f5960677 params:( Vector2D ScreenPositionA;Vector2D ScreenPositionB;None Thickness;LinearColor RenderColor; );
	K2_DrawBox 0x492ad hash 55046218 params:( Vector2D ScreenPosition;Vector2D ScreenSize;None Thickness;LinearColor RenderColor; );
	K2_DrawBorder 0x492a5 hash 9c4cb7ad params:( Texture BorderTexture;Texture BackgroundTexture;Texture LeftBorderTexture;Texture RightBorderTexture;Texture TopBorderTexture;Texture BottomBorderTexture;Vector2D ScreenPosition;Vector2D ScreenSize;Vector2D CoordinatePosition;Vector2D CoordinateSize;LinearColor RenderColor;Vector2D BorderScale;Vector2D BackgroundScale;None Rotation;Vector2D PivotPoint;Vector2D CornerSize; );
	K2_Deproject 0x4929e hash 22788a01 params:( Vector2D ScreenPosition;Vector WorldOrigin;Vector WorldDirection; );
};


instance 1ab5e143340
class TextureRenderTarget public : Texture
{
	// Fields
	float TargetGamma; // 0xd0

};


instance 1ab5e143580
class TextureRenderTarget2D public : TextureRenderTarget
{
	// Fields
	int SizeX; // 0xd8
	int SizeY; // 0xdc
	LinearColor ClearColor; // 0xe0
	BYTE AddressX; // 0xf0
	BYTE AddressY; // 0xf1
	bool bForceLinearGamma; // 0xf2
	bool bHDR; // 0xf2
	bool bGPUSharedFlag; // 0xf2
	BYTE RenderTargetFormat; // 0xf3
	bool bAutoGenerateMips; // 0xf4
	BYTE MipsSamplerFilter; // 0xf5
	BYTE MipsAddressU; // 0xf6
	BYTE MipsAddressV; // 0xf7
	BYTE OverrideFormat; // 0xf8

};


instance 1ab5e1437c0
class CanvasRenderTarget2D public : TextureRenderTarget2D
{
	// Fields
	MulticastInlineDelegateProperty OnCanvasRenderTargetUpdate; // 0x100 property 0x1ab71c2d400 hash 0xb7a5ed1a
	WeakObjectProperty World; // 0x110 property 0x1ab71c2d480 hash 0x24388009
	bool bShouldClearRenderTargetOnReceiveUpdate; // 0x118

	// Functions
	UpdateResource 0x49333 hash 38ce770 params:(  );
	ReceiveUpdate 0x253b6 hash 2efbbaeb params:( Canvas Canvas;None Width;None Height; );
	GetSize 0x4696a hash 5121eb20 params:( None Width;None Height; );
	CreateCanvasRenderTarget2D 0x49325 hash c54195b2 params:( Object WorldContextObject;Class CanvasRenderTarget2DClass;None Width;None Height;CanvasRenderTarget2D ReturnValue; );
};


instance 1ab5e143100
class CapsuleComponent public : ShapeComponent
{
	// Fields
	float CapsuleHalfHeight; // 0x3f0
	float CapsuleRadius; // 0x3f4

	// Functions
	SetCapsuleSize 0x493fd hash 79e41d19 params:( None InRadius;None InHalfHeight;None bUpdateOverlaps; );
	SetCapsuleRadius 0x493f4 hash 806deae6 params:( None Radius;None bUpdateOverlaps; );
	SetCapsuleHalfHeight 0x493e9 hash 72910fd2 params:( None HalfHeight;None bUpdateOverlaps; );
	GetUnscaledCapsuleSize_WithoutHemisphere 0x493d4 hash 7c1dde99 params:( None OutRadius;None OutHalfHeightWithoutHemisphere; );
	GetUnscaledCapsuleSize 0x493c8 hash 54cdc89c params:( None OutRadius;None OutHalfHeight; );
	GetUnscaledCapsuleRadius 0x493bb hash bc708329 params:( None ReturnValue; );
	GetUnscaledCapsuleHalfHeight_WithoutHemisphere 0x493a3 hash 52db9bd2 params:( None ReturnValue; );
	GetUnscaledCapsuleHalfHeight 0x49394 hash a2dc1195 params:( None ReturnValue; );
	GetShapeScale 0x4267d hash f473123e params:( None ReturnValue; );
	GetScaledCapsuleSize_WithoutHemisphere 0x49380 hash b6c2f0b6 params:( None OutRadius;None OutHalfHeightWithoutHemisphere; );
	GetScaledCapsuleSize 0x49375 hash 47ad9579 params:( None OutRadius;None OutHalfHeight; );
	GetScaledCapsuleRadius 0x49369 hash e676fb46 params:( None ReturnValue; );
	GetScaledCapsuleHalfHeight_WithoutHemisphere 0x49352 hash 85df0faf params:( None ReturnValue; );
	GetScaledCapsuleHalfHeight 0x49344 hash dd6b5032 params:( None ReturnValue; );
};


instance 1ab5e142ec0
class ChaosPhysicalMaterial public : Object
{
	// Fields
	float Friction; // 0x28
	float Restitution; // 0x2c
	float SleepingLinearVelocityThreshold; // 0x30
	float SleepingAngularVelocityThreshold; // 0x34

};


instance 1ab5e142c80
class CheatManager public : Object
{
	// Fields
	DebugCameraController* DebugCameraControllerRef; // 0x28
	DebugCameraController* DebugCameraControllerClass; // 0x30

	// Functions
	Walk 0x495dd hash 7c8e6f74 params:(  );
	ViewSelf 0x495d8 hash 60a563aa params:(  );
	ViewPlayer 0x495d2 hash 19067ded params:( None S; );
	ViewClass 0x495cc hash 7433fad6 params:( Class DesiredClass; );
	ViewActor 0x495c6 hash 740b2ab9 params:( None ActorName; );
	UpdateSafeArea 0x495be hash 9cc140a0 params:(  );
	ToggleServerStatReplicatorUpdateStatNet 0x495a9 hash 152b0475 params:(  );
	ToggleServerStatReplicatorClientOverwrite 0x49593 hash 49cfb3b5 params:(  );
	ToggleDebugCamera 0x49589 hash 790af9d7 params:(  );
	ToggleAILogging 0x49580 hash 30f48198 params:(  );
	TestCollisionDistance 0x49574 hash e7d04e7c params:(  );
	Teleport 0x4956f hash 63573c94 params:(  );
	Summon 0x4956b hash d1fe07a4 params:( None ClassName; );
	StreamLevelOut 0x49563 hash 611f52c1 params:( None PackageName; );
	StreamLevelIn 0x4955b hash dc27bbe0 params:( None PackageName; );
	SpawnServerStatReplicator 0x4954d hash 8269d556 params:(  );
	Slomo 0x49549 hash e1a118f params:( None NewTimeDilation; );
	SetWorldOrigin 0x49541 hash 3195e701 params:(  );
	SetMouseSensitivityToDefault 0x49532 hash ebc4218d params:(  );
	ServerToggleAILogging 0x256de hash a90cca2f params:(  );
	ReceiveInitCheatManager 0x256d1 hash 6bf6bfbc params:(  );
	ReceiveEndPlay 0x22209 hash 3a1b8675 params:(  );
	PlayersOnly 0x4952b hash 8c105be7 params:(  );
	OnlyLoadLevel 0x49523 hash 3f26dd7f params:( None PackageName; );
	LogLoc 0x4951f hash c1398185 params:(  );
	InvertMouse 0x49518 hash f26e9b86 params:(  );
	God 0x49515 hash b87ef9f params:(  );
	Ghost 0x49511 hash d3ebaca params:(  );
	FreezeFrame 0x4950a hash fa966791 params:( None Delay; );
	Fly 0x49507 hash b87eb10 params:(  );
	FlushLog 0x49502 hash a88c0de9 params:(  );
	EnableDebugCamera 0x494f8 hash d623e33c params:(  );
	DumpVoiceMutingState 0x494ed hash 36b871c6 params:(  );
	DumpPartyState 0x494e5 hash dd9a9c6c params:(  );
	DumpOnlineSessionState 0x494d9 hash 829af645 params:(  );
	DumpChatState 0x494d1 hash 2562ea5c params:(  );
	DisableDebugCamera 0x494c7 hash df1e6e29 params:(  );
	DestroyTarget 0x494bf hash cf61d96 params:(  );
	DestroyServerStatReplicator 0x494b0 hash cc50a0d7 params:(  );
	DestroyPawns 0x494a9 hash 45edb518 params:( Class aClass; );
	DestroyAllPawnsExceptTarget 0x4949a hash ce623e1 params:(  );
	DestroyAll 0x49494 hash 52935e48 params:( Class aClass; );
	DebugCapsuleSweepSize 0x49488 hash d36c3178 params:( None HalfHeight;None Radius; );
	DebugCapsuleSweepPawn 0x4947c hash d36a69f3 params:(  );
	DebugCapsuleSweepComplex 0x4946f hash 848428b5 params:( None bTraceComplex; );
	DebugCapsuleSweepClear 0x49463 hash 3fd22424 params:(  );
	DebugCapsuleSweepChannel 0x49456 hash 7355d5f6 params:( ECollisionChannel Channel; );
	DebugCapsuleSweepCapture 0x49449 hash 641492d1 params:(  );
	DebugCapsuleSweep 0x4943f hash a4bcc8bd params:(  );
	DamageTarget 0x49438 hash f5525f8b params:( None DamageAmount; );
	CheatScript 0x49431 hash 9b41ea3f params:( None ScriptName; );
	ChangeSize 0x4942b hash 270ddd66 params:( None F; );
	BugItStringCreator 0x49421 hash 7839bf07 params:( Vector ViewLocation;Rotator ViewRotation;None GoString;None LocString; );
	BugItGo 0x4941c hash f4a0b356 params:( None X;None Y;None Z;None Pitch;None Yaw;None Roll; );
	BugIt 0x49418 hash ceb39c0 params:( None ScreenShotDescription; );
};


instance 1ab5e142a40
class CheckBoxStyleAsset public : Object
{
	// Fields
	CheckBoxStyle CheckBoxStyle; // 0x28

};


instance 1ab5e142800
class ChildActorComponent public : SceneComponent
{
	// Fields
	Actor* ChildActorClass; // 0x1f0
	Actor* ChildActor; // 0x1f8
	Actor* ChildActorTemplate; // 0x200

	// Functions
	SetChildActorClass 0x495f5 hash b28eb524 params:( Class InClass; );
};


instance 1ab5e1425c0
class ChildConnection public : NetConnection
{
	// Fields
	NetConnection* Parent; // 0x19c0

};


instance 1ab5e142140
class PlatformInterfaceBase public : Object
{
	// Fields
	TArray AllDelegates; // 0x28

};


instance 1ab5e142380
class CloudStorageBase public : PlatformInterfaceBase
{
	// Fields
	TArray LocalCloudFiles; // 0x38
	bool bSuppressDelegateCalls; // 0x48

};


instance 1ab5e141f00
class CollisionProfile public : DeveloperSettings
{
	// Fields
	TArray Profiles; // 0x38
	TArray DefaultChannelResponses; // 0x48
	TArray EditProfiles; // 0x58
	TArray ProfileRedirects; // 0x68
	TArray CollisionChannelRedirects; // 0x78

};


instance 1ab5e141cc0
class Commandlet public : Object
{
	// Fields
	FString HelpDescription; // 0x28
	FString HelpUsage; // 0x38
	FString HelpWebLink; // 0x48
	TArray HelpParamNames; // 0x58
	TArray HelpParamDescriptions; // 0x68
	bool IsServer; // 0x78
	bool IsClient; // 0x78
	bool IsEditor; // 0x78
	bool LogToConsole; // 0x78
	bool ShowErrorCount; // 0x78
	bool ShowProgress; // 0x78

};


instance 1ab5e141a80
class ComponentDelegateBinding public : DynamicBlueprintBinding
{
	// Fields
	TArray ComponentDelegateBindings; // 0x28

};


instance 1ab5e141600
class CurveTable public : Object
{
	// Fields

};


instance 1ab5e141840
class CompositeCurveTable public : CurveTable
{
	// Fields
	TArray ParentTables; // 0xa0
	TArray OldParentTables; // 0xb0

};


instance 1ab5e141180
class DataTable public : Object
{
	// Fields
	ScriptStruct* RowStruct; // 0x28
	bool bStripFromClientBuilds; // 0x80
	bool bIgnoreExtraFields; // 0x80
	bool bIgnoreMissingFields; // 0x80
	FString ImportKeyField; // 0x88

};


instance 1ab5e1413c0
class CompositeDataTable public : DataTable
{
	// Fields
	TArray ParentTables; // 0xc8
	TArray OldParentTables; // 0xd8

};


instance 1ab5e140f40
class Console public : Object
{
	// Fields
	LocalPlayer* ConsoleTargetPlayer; // 0x38
	Texture2D* DefaultTexture_Black; // 0x40
	Texture2D* DefaultTexture_White; // 0x48
	TArray HistoryBuffer; // 0x68

};


instance 1ab5e140d00
class ControlChannel public : Channel
{
	// Fields

};


instance 1ab5e140ac0
class StreamingSettings public : DeveloperSettings
{
	// Fields
	bool AsyncLoadingThreadEnabled; // 0x38
	bool WarnIfTimeLimitExceeded; // 0x38
	float TimeLimitExceededMultiplier; // 0x3c
	float TimeLimitExceededMinTime; // 0x40
	int MinBulkDataSizeForAsyncLoading; // 0x44
	bool UseBackgroundLevelStreaming; // 0x48
	bool AsyncLoadingUseFullTimeLimit; // 0x48
	float AsyncLoadingTimeLimit; // 0x4c
	float PriorityAsyncLoadingExtraTime; // 0x50
	float LevelStreamingActorsUpdateTimeLimit; // 0x54
	float PriorityLevelStreamingActorsUpdateExtraTime; // 0x58
	int LevelStreamingComponentsRegistrationGranularity; // 0x5c
	float LevelStreamingUnregisterComponentsTimeLimit; // 0x60
	int LevelStreamingComponentsUnregistrationGranularity; // 0x64
	bool EventDrivenLoaderEnabled; // 0x68
	bool FlushStreamingOnExit; // 0x68

};


instance 1ab5e140880
class GarbageCollectionSettings public : DeveloperSettings
{
	// Fields
	float TimeBetweenPurgingPendingKillObjects; // 0x38
	bool FlushStreamingOnGC; // 0x3c
	bool AllowParallelGC; // 0x3c
	bool IncrementalBeginDestroyEnabled; // 0x3c
	bool MultithreadedDestructionEnabled; // 0x3c
	bool CreateGCClusters; // 0x3c
	bool ActorClusteringEnabled; // 0x3c
	bool BlueprintClusteringEnabled; // 0x3c
	bool UseDisregardForGCOnDedicatedServers; // 0x3c
	int MinGCClusterSize; // 0x40
	int NumRetriesBeforeForcingGC; // 0x44
	int MaxObjectsNotConsideredByGC; // 0x48
	int SizeOfPermanentObjectPool; // 0x4c
	int MaxObjectsInGame; // 0x50
	int MaxObjectsInEditor; // 0x54

};


instance 1ab5e140640
class CullDistanceVolume public : Volume
{
	// Fields
	TArray CullDistances; // 0x250
	bool bEnabled; // 0x260

};


instance 1ab5e140400
class CurveBase public : Object
{
	// Fields

	// Functions
	GetValueRange 0x49696 hash 78d0096f params:( None MinValue;None MaxValue; );
	GetTimeRange 0x4968f hash 367c2601 params:( None MinTime;None MaxTime; );
};


instance 1ab5e1401c0
class CurveEdPresetCurve public : Object
{
	// Fields

};


instance 1ab5e149400
class CurveFloat public : CurveBase
{
	// Fields
	RichCurve FloatCurve; // 0x30
	bool bIsEventCurve; // 0xb0

	// Functions
	GetFloatValue 0x496ae hash 1dfe4eb8 params:( None InTime;None ReturnValue; );
};


instance 1ab5e1491c0
class CurveLinearColor public : CurveBase
{
	// Fields
	RichCurve FloatCurves; // 0x30
	float AdjustHue; // 0x230
	float AdjustSaturation; // 0x234
	float AdjustBrightness; // 0x238
	float AdjustBrightnessCurve; // 0x23c
	float AdjustVibrance; // 0x240
	float AdjustMinAlpha; // 0x244
	float AdjustMaxAlpha; // 0x248

	// Functions
	GetLinearColorValue 0x496cd hash b47a777c params:( None InTime;LinearColor ReturnValue; );
	GetClampedLinearColorValue 0x496bf hash 19dea252 params:( None InTime;LinearColor ReturnValue; );
};


instance 1ab5e148d40
class Texture2D public : Texture
{
	// Fields
	int LevelIndex; // 0xd0
	int FirstResourceMemMip; // 0xd4
	bool bTemporarilyDisableStreaming; // 0xd8
	BYTE AddressX; // 0xd9
	BYTE AddressY; // 0xda
	IntPoint ImportedSize; // 0xdc

	// Functions
	Blueprint_GetSizeY 0x496f4 hash 62766e8d params:( None ReturnValue; );
	Blueprint_GetSizeX 0x496ea hash 62766e8c params:( None ReturnValue; );
};


instance 1ab5e148f80
class CurveLinearColorAtlas public : Texture2D
{
	// Fields
	int TextureSize; // 0x100
	TArray GradientCurves; // 0x108

	// Functions
	GetCurvePosition 0x496fe hash 82c5abf params:( CurveLinearColor InCurve;None Position;None ReturnValue; );
};


instance 1ab5e148b00
class CurveSourceInterface public : Interface
{
	// Fields

	// Functions
	GetCurveValue 0x25e95 hash 1c8dad67 params:( None CurveName;None ReturnValue; );
	GetCurves 0x25e8f hash fccbc1dd params:( OutValues OutValues; );
	GetBindingName 0x25e87 hash f615a9c1 params:( None ReturnValue; );
};


instance 1ab5e1488c0
class CurveVector public : CurveBase
{
	// Fields
	RichCurve FloatCurves; // 0x30

	// Functions
	GetVectorValue 0x49719 hash e9f70ad5 params:( None InTime;Vector ReturnValue; );
};


instance 1ab5e148680
class PrimaryDataAsset public : DataAsset
{
	// Fields

};


instance 1ab5e148440
class DataTableFunctionLibrary public : BlueprintFunctionLibrary
{
	// Fields

	// Functions
	GetDataTableRowNames 0x4976a hash 75ebbb13 params:( DataTable Table;OutRowNames OutRowNames; );
	GetDataTableRowFromName 0x4975d hash 58581e54 params:( DataTable Table;None RowName;TableRowBase OutRow;None ReturnValue; );
	GetDataTableColumnAsString 0x4974f hash 6ece9ca0 params:( DataTable DataTable;None PropertyName;ReturnValue ReturnValue; );
	EvaluateCurveTableRow 0x49743 hash d7c7bd61 params:( CurveTable CurveTable;None RowName;None InXY;EEvaluateCurveTableResult OutResult;None OutXY;None ContextString; );
	DoesDataTableRowExist 0x49737 hash ae8043f7 params:( DataTable Table;None RowName;None ReturnValue; );
};


instance 1ab5e148200
class DebugCameraController public : PlayerController
{
	// Fields
	bool bShowSelectedInfo; // 0x568
	bool bIsFrozenRendering; // 0x568
	bool bIsOrbitingSelectedActor; // 0x568
	bool bOrbitPivotUseCenter; // 0x568
	bool bEnableBufferVisualization; // 0x568
	bool bEnableBufferVisualizationFullMode; // 0x568
	bool bIsBufferVisualizationInputSetup; // 0x568
	bool bLastDisplayEnabled; // 0x568
	DrawFrustumComponent* DrawFrustum; // 0x570
	Actor* SelectedActor; // 0x578
	PrimitiveComponent* SelectedComponent; // 0x580
	HitResult SelectedHitPoint; // 0x588
	PlayerController* OriginalControllerRef; // 0x610
	Player* OriginalPlayer; // 0x618
	float SpeedScale; // 0x620
	float InitialMaxSpeed; // 0x624
	float InitialAccel; // 0x628
	float InitialDecel; // 0x62c

	// Functions
	ToggleDisplay 0x497a4 hash c47bfd3d params:(  );
	ShowDebugSelectedInfo 0x49798 hash a1160a42 params:(  );
	SetPawnMovementSpeedScale 0x4978a hash 7aa0786b params:( None NewSpeedScale; );
	ReceiveOnDeactivate 0x26074 hash ccb4949f params:( PlayerController RestoredPC; );
	ReceiveOnActorSelected 0x26068 hash dd6aa9a7 params:( Actor NewSelectedActor;Vector SelectHitLocation;Vector SelectHitNormal;HitResult Hit; );
	ReceiveOnActivate 0x2605e hash b72c1116 params:( PlayerController OriginalPC; );
	GetSelectedActor 0x49781 hash b2af8ee7 params:( Actor ReturnValue; );
};


instance 1ab5e147fc0
class DebugCameraControllerSettings public : DeveloperSettings
{
	// Fields
	TArray CycleViewModes; // 0x38

};


instance 1ab5e147d80
class DebugCameraHUD public : HUD
{
	// Fields

};


instance 1ab5e147b40
class DebugDrawService public : BlueprintFunctionLibrary
{
	// Fields

};


instance 1ab5e147900
class DecalActor public : Actor
{
	// Fields
	DecalComponent* Decal; // 0x218

	// Functions
	SetDecalMaterial 0x497dc hash ec84c019 params:( MaterialInterface NewDecalMaterial; );
	GetDecalMaterial 0x497d3 hash 5a06f98d params:( MaterialInterface ReturnValue; );
	CreateDynamicMaterialInstance 0x3f665 hash a4482bc2 params:( MaterialInstanceDynamic ReturnValue; );
};


instance 1ab5e1476c0
class DecalComponent public : SceneComponent
{
	// Fields
	MaterialInterface* DecalMaterial; // 0x1f0
	int SortOrder; // 0x1f8
	float FadeScreenSize; // 0x1fc
	float FadeStartDelay; // 0x200
	float FadeDuration; // 0x204
	float FadeInDuration; // 0x208
	float FadeInStartDelay; // 0x20c
	bool bDestroyOwnerAfterFade; // 0x210
	Vector DecalSize; // 0x214

	// Functions
	SetSortOrder 0x4982b hash 3aa68235 params:( None Value; );
	SetFadeScreenSize 0x49821 hash c792123c params:( None NewFadeScreenSize; );
	SetFadeOut 0x4981b hash 7e034e59 params:( None StartDelay;None Duration;None DestroyOwnerAfterFade; );
	SetFadeIn 0x49815 hash 782ea478 params:( None StartDelay;None Duaration; );
	SetDecalMaterial 0x497dc hash ec84c019 params:( MaterialInterface NewDecalMaterial; );
	GetFadeStartDelay 0x4980b hash fa0432d2 params:( None ReturnValue; );
	GetFadeInStartDelay 0x49800 hash 9ed2eea9 params:( None ReturnValue; );
	GetFadeInDuration 0x497f6 hash 37941e52 params:( None ReturnValue; );
	GetFadeDuration 0x497ed hash ae24443b params:( None ReturnValue; );
	GetDecalMaterial 0x497d3 hash 5a06f98d params:( MaterialInterface ReturnValue; );
	CreateDynamicMaterialInstance 0x3f665 hash a4482bc2 params:( MaterialInstanceDynamic ReturnValue; );
};


instance 1ab5e147480
class DefaultPawn public : Pawn
{
	// Fields
	float BaseTurnRate; // 0x278
	float BaseLookUpRate; // 0x27c
	PawnMovementComponent* MovementComponent; // 0x280
	SphereComponent* CollisionComponent; // 0x288
	StaticMeshComponent* MeshComponent; // 0x290
	bool bAddDefaultMovementBindings; // 0x298

	// Functions
	TurnAtRate 0x44f89 hash aedd190f params:( None Rate; );
	MoveUp_World 0x49839 hash ba556888 params:( None Val; );
	MoveRight 0x44f7a hash d90e0f1a params:( None Val; );
	MoveForward 0x44f73 hash c7e15dd1 params:( None Val; );
	LookUpAtRate 0x44f6c hash e4048ec0 params:( None Rate; );
};


instance 1ab5e147000
class PhysicsVolume public : Volume
{
	// Fields
	float TerminalVelocity; // 0x250
	int Priority; // 0x254
	float FluidFriction; // 0x258
	bool bWaterVolume; // 0x25c
	bool bPhysicsOnContact; // 0x25c

};


instance 1ab5e147240
class DefaultPhysicsVolume public : PhysicsVolume
{
	// Fields

};


instance 1ab5e146dc0
class DemoNetConnection public : NetConnection
{
	// Fields

};


instance 1ab5e146b80
class DemoNetDriver public : NetDriver
{
	// Fields
	MapProperty RollbackNetStartupActors; // 0x800 property 0x1ab71168e40 hash 0xadd0fb88
	float CheckpointSaveMaxMSPerFrame; // 0xc14
	TArray MulticastRecordOptions; // 0xc48
	bool bIsLocalReplay; // 0xc58
	TArray SpectatorControllers; // 0xc60

};


instance 1ab5e146700
class PendingNetGame public : Object
{
	// Fields
	NetDriver* NetDriver; // 0x30
	DemoNetDriver* DemoNetDriver; // 0x38

};


instance 1ab5e146940
class DemoPendingNetGame public : PendingNetGame
{
	// Fields

};


instance 1ab5e1464c0
class DestructibleInterface public : Interface
{
	// Fields

};


instance 1ab5e146040
class TextureLODSettings public : Object
{
	// Fields
	TArray TextureLODGroups; // 0x28

};


instance 1ab5e146280
class DeviceProfile public : TextureLODSettings
{
	// Fields
	FString DeviceType; // 0x38
	FString BaseProfileName; // 0x48
	Object* Parent; // 0x58
	TArray CVars; // 0x78

};


instance 1ab5e145e00
class DeviceProfileManager public : Object
{
	// Fields
	TArray Profiles; // 0x28

};


instance 1ab5e145bc0
class DialogueSoundWaveProxy public : SoundBase
{
	// Fields

};


instance 1ab5e145980
class DialogueVoice public : Object
{
	// Fields
	BYTE Gender; // 0x28
	BYTE Plurality; // 0x29
	Guid LocalizationGUID; // 0x2c

};


instance 1ab5e145740
class DialogueWave public : Object
{
	// Fields
	bool bMature; // 0x28
	bool bOverride_SubtitleOverride; // 0x28
	FString SpokenText; // 0x30
	FString SubtitleOverride; // 0x40
	TArray ContextMappings; // 0x50
	Guid LocalizationGUID; // 0x60

};


instance 1ab5e1452c0
class Light public : Actor
{
	// Fields
	LightComponent* LightComponent; // 0x218
	bool bEnabled; // 0x220

	// Functions
	ToggleEnabled 0x49925 hash 1bd29f32 params:(  );
	SetLightFunctionScale 0x49919 hash 5e41c8f7 params:( Vector NewLightFunctionScale; );
	SetLightFunctionMaterial 0x4990c hash b93107be params:( MaterialInterface NewLightFunctionMaterial; );
	SetLightFunctionFadeDistance 0x498fd hash 956a87ca params:( None NewLightFunctionFadeDistance; );
	SetLightColor 0x498f5 hash 48b5b1c8 params:( LinearColor NewLightColor; );
	SetEnabled 0x48cbb hash 4f24ac5c params:( None bSetEnabled; );
	SetCastShadows 0x498ed hash 80cb9a75 params:( None bNewValue; );
	SetBrightness 0x498e5 hash abad8c0a params:( None NewBrightness; );
	SetAffectTranslucentLighting 0x498d6 hash 2a71fc83 params:( None bNewValue; );
	OnRep_bEnabled 0x456da hash f2b2e395 params:(  );
	IsEnabled 0x498d0 hash 1248190c params:( None ReturnValue; );
	GetLightColor 0x498c8 hash 90413fbc params:( LinearColor ReturnValue; );
	GetBrightness 0x498c0 hash f33919fe params:( None ReturnValue; );
};


instance 1ab5e145500
class DirectionalLight public : Light
{
	// Fields

};


instance 1ab5e144c00
class LightComponentBase public : SceneComponent
{
	// Fields
	Guid LightGuid; // 0x1f0
	float Brightness; // 0x200
	float Intensity; // 0x204
	Color LightColor; // 0x208
	bool bAffectsWorld; // 0x20c
	bool CastShadows; // 0x20c
	bool CastStaticShadows; // 0x20c
	bool CastDynamicShadows; // 0x20c
	bool bAffectTranslucentLighting; // 0x20c
	bool bTransmission; // 0x20c
	bool bCastVolumetricShadow; // 0x20c
	bool bCastDeepShadow; // 0x20c
	bool bCastRaytracedShadow; // 0x20d
	bool bAffectReflection; // 0x20d
	bool bAffectGlobalIllumination; // 0x20d
	float IndirectLightingIntensity; // 0x210
	float VolumetricScatteringIntensity; // 0x214
	int SamplesPerPixel; // 0x218

	// Functions
	SetSamplesPerPixel 0x4998a hash 1398664f params:( None NewValue; );
	SetCastVolumetricShadow 0x4997d hash cbeefe2c params:( None bNewValue; );
	SetCastShadows 0x498ed hash 80cb9a75 params:( None bNewValue; );
	SetCastRaytracedShadow 0x49971 hash 73075101 params:( None bNewValue; );
	SetCastDeepShadow 0x49967 hash 95e3d320 params:( None bNewValue; );
	SetAffectReflection 0x4995c hash 4321a045 params:( None bNewValue; );
	SetAffectGlobalIllumination 0x4994d hash 6093d0c0 params:( None bNewValue; );
	GetLightColor 0x498c8 hash 90413fbc params:( LinearColor ReturnValue; );
};


instance 1ab5e144e40
class LightComponent public : LightComponentBase
{
	// Fields
	float Temperature; // 0x220
	float MaxDrawDistance; // 0x224
	float MaxDistanceFadeRange; // 0x228
	bool bUseTemperature; // 0x22c
	int ShadowMapChannel; // 0x230
	float MinRoughness; // 0x238
	float SpecularScale; // 0x23c
	float ShadowResolutionScale; // 0x240
	float ShadowBias; // 0x244
	float ShadowSlopeBias; // 0x248
	float ShadowSharpen; // 0x24c
	float ContactShadowLength; // 0x250
	bool ContactShadowLengthInWS; // 0x254
	bool InverseSquaredFalloff; // 0x254
	bool CastTranslucentShadows; // 0x254
	bool bCastShadowsFromCinematicObjectsOnly; // 0x254
	bool bAffectDynamicIndirectLighting; // 0x254
	bool bForceCachedShadowsForMovablePrimitives; // 0x254
	LightingChannels LightingChannels; // 0x258
	MaterialInterface* LightFunctionMaterial; // 0x260
	Vector LightFunctionScale; // 0x268
	TextureLightProfile* IESTexture; // 0x278
	bool bUseIESBrightness; // 0x280
	float IESBrightnessScale; // 0x284
	float LightFunctionFadeDistance; // 0x288
	float DisabledBrightness; // 0x28c
	bool bEnableLightShaftBloom; // 0x290
	float BloomScale; // 0x294
	float BloomThreshold; // 0x298
	float BloomMaxBrightness; // 0x29c
	Color BloomTint; // 0x2a0
	bool bUseRayTracedDistanceFieldShadows; // 0x2a4
	float RayStartOffsetDepthScale; // 0x2a8

	// Functions
	SetVolumetricScatteringIntensity 0x49a60 hash 3bafe356 params:( None NewIntensity; );
	SetUseIESBrightness 0x49a55 hash a0864fb8 params:( None bNewValue; );
	SetTransmission 0x49a4c hash cebfc1db params:( None bNewValue; );
	SetTemperature 0x49a44 hash 8120a97f params:( None NewTemperature; );
	SetSpecularScale 0x49a3b hash 6eba3a38 params:( None NewValue; );
	SetShadowSlopeBias 0x49a31 hash cd791179 params:( None NewValue; );
	SetShadowBias 0x49a29 hash 2af9bbd6 params:( None NewValue; );
	SetLightFunctionScale 0x49919 hash 5e41c8f7 params:( Vector NewLightFunctionScale; );
	SetLightFunctionMaterial 0x4990c hash b93107be params:( MaterialInterface NewLightFunctionMaterial; );
	SetLightFunctionFadeDistance 0x498fd hash 956a87ca params:( None NewLightFunctionFadeDistance; );
	SetLightFunctionDisabledBrightness 0x49a17 hash 64c6c480 params:( None NewValue; );
	SetLightColor 0x498f5 hash 48b5b1c8 params:( LinearColor NewLightColor;None bSRGB; );
	SetIntensity 0x49a10 hash 3ab0f698 params:( None NewIntensity; );
	SetIndirectLightingIntensity 0x49a01 hash e69948e0 params:( None NewIntensity; );
	SetIESTexture 0x499f9 hash 43294f63 params:( TextureLightProfile NewValue; );
	SetIESBrightnessScale 0x499ed hash 6af14093 params:( None NewValue; );
	SetForceCachedShadowsForMovablePrimitives 0x499d7 hash cf0cf72a params:( None bNewValue; );
	SetEnableLightShaftBloom 0x499ca hash ce6e085f params:( None bNewValue; );
	SetBloomTint 0x499c3 hash c9138349 params:( Color NewValue; );
	SetBloomThreshold 0x499b9 hash d80ba577 params:( None NewValue; );
	SetBloomScale 0x499b1 hash eb6e51b2 params:( None NewValue; );
	SetBloomMaxBrightness 0x499a5 hash b03792c9 params:( None NewValue; );
	SetAffectTranslucentLighting 0x498d6 hash 2a71fc83 params:( None bNewValue; );
	SetAffectDynamicIndirectLighting 0x49994 hash 513add27 params:( None bNewValue; );
};


instance 1ab5e145080
class DirectionalLightComponent public : LightComponent
{
	// Fields
	float ShadowCascadeBiasDistribution; // 0x338
	bool bEnableLightShaftOcclusion; // 0x33c
	float OcclusionMaskDarkness; // 0x340
	float OcclusionDepthRange; // 0x344
	Vector LightShaftOverrideDirection; // 0x348
	float WholeSceneDynamicShadowRadius; // 0x354
	float DynamicShadowDistanceMovableLight; // 0x358
	float DynamicShadowDistanceStationaryLight; // 0x35c
	int DynamicShadowCascades; // 0x360
	float CascadeDistributionExponent; // 0x364
	float CascadeTransitionFraction; // 0x368
	float ShadowDistanceFadeoutFraction; // 0x36c
	bool bUseInsetShadowsForMovableObjects; // 0x370
	int FarShadowCascadeCount; // 0x374
	float FarShadowDistance; // 0x378
	float DistanceFieldShadowDistance; // 0x37c
	float LightSourceAngle; // 0x380
	float LightSourceSoftAngle; // 0x384
	float TraceDistance; // 0x388
	LightmassDirectionalLightSettings LightmassSettings; // 0x38c
	bool bCastModulatedShadows; // 0x39c
	Color ModulatedShadowColor; // 0x3a0
	float ShadowAmount; // 0x3a4
	bool bUsedAsAtmosphereSunLight; // 0x3a8
	int AtmosphereSunLightIndex; // 0x3ac

	// Functions
	SetShadowDistanceFadeoutFraction 0x49afa hash f2547be0 params:( None NewValue; );
	SetShadowAmount 0x49af1 hash ce53072b params:( None NewValue; );
	SetOcclusionMaskDarkness 0x49ae4 hash 4db56b87 params:( None NewValue; );
	SetLightShaftOverrideDirection 0x49ad4 hash 78d308e0 params:( Vector NewValue; );
	SetEnableLightShaftOcclusion 0x49ac5 hash e701af15 params:( None bNewValue; );
	SetDynamicShadowDistanceStationaryLight 0x49ab0 hash d44a714d params:( None NewValue; );
	SetDynamicShadowDistanceMovableLight 0x49a9d hash 74173aa5 params:( None NewValue; );
	SetDynamicShadowCascades 0x49a90 hash 5e63c953 params:( None NewValue; );
	SetCascadeTransitionFraction 0x49a81 hash c4207736 params:( None NewValue; );
	SetCascadeDistributionExponent 0x49a71 hash a27b5226 params:( None NewValue; );
};


instance 1ab5e14de40
class Distribution public : Object
{
	// Fields

};


instance 1ab5e14dc00
class DistributionFloat public : Distribution
{
	// Fields
	bool bCanBeBaked; // 0x30
	bool bBakedDataSuccesfully; // 0x30

};


instance 1ab5e14d9c0
class DistributionFloatConstant public : DistributionFloat
{
	// Fields
	float Constant; // 0x38

};


instance 1ab5e14d780
class DistributionFloatConstantCurve public : DistributionFloat
{
	// Fields
	InterpCurveFloat ConstantCurve; // 0x38

};


instance 1ab5e14d540
class DistributionFloatParameterBase public : DistributionFloatConstant
{
	// Fields
	FName ParameterName; // 0x40
	float MinInput; // 0x48
	float MaxInput; // 0x4c
	float MinOutput; // 0x50
	float MaxOutput; // 0x54
	BYTE ParamMode; // 0x58

};


instance 1ab5e14d300
class DistributionFloatParticleParameter public : DistributionFloatParameterBase
{
	// Fields

};


instance 1ab5e14d0c0
class DistributionFloatUniform public : DistributionFloat
{
	// Fields
	float Min; // 0x38
	float Max; // 0x3c

};


instance 1ab5e14ce80
class DistributionFloatUniformCurve public : DistributionFloat
{
	// Fields
	InterpCurveVector2D ConstantCurve; // 0x38

};


instance 1ab5e14cc40
class DistributionVector public : Distribution
{
	// Fields
	bool bCanBeBaked; // 0x30
	bool bIsDirty; // 0x30
	bool bBakedDataSuccesfully; // 0x30

};


instance 1ab5e14ca00
class DistributionVectorConstant public : DistributionVector
{
	// Fields
	Vector Constant; // 0x38
	bool bLockAxes; // 0x44
	BYTE LockedAxes; // 0x48

};


instance 1ab5e14c7c0
class DistributionVectorConstantCurve public : DistributionVector
{
	// Fields
	InterpCurveVector ConstantCurve; // 0x38
	bool bLockAxes; // 0x50
	BYTE LockedAxes; // 0x54

};


instance 1ab5e14c580
class DistributionVectorParameterBase public : DistributionVectorConstant
{
	// Fields
	FName ParameterName; // 0x50
	Vector MinInput; // 0x58
	Vector MaxInput; // 0x64
	Vector MinOutput; // 0x70
	Vector MaxOutput; // 0x7c
	BYTE ParamModes; // 0x88

};


instance 1ab5e14c340
class DistributionVectorParticleParameter public : DistributionVectorParameterBase
{
	// Fields

};


instance 1ab5e14c100
class DistributionVectorUniform public : DistributionVector
{
	// Fields
	Vector Max; // 0x38
	Vector Min; // 0x44
	bool bLockAxes; // 0x50
	BYTE LockedAxes; // 0x54
	BYTE MirrorFlags; // 0x55
	bool bUseExtremes; // 0x58

};


instance 1ab5e14bec0
class DistributionVectorUniformCurve public : DistributionVector
{
	// Fields
	InterpCurveTwoVectors ConstantCurve; // 0x38
	bool bLockAxes1; // 0x50
	bool bLockAxes2; // 0x50
	BYTE LockedAxes; // 0x54
	BYTE MirrorFlags; // 0x56
	bool bUseExtremes; // 0x5c

};


instance 1ab5e14bc80
class DocumentationActor public : Actor
{
	// Fields

};


instance 1ab5e14ba40
class DPICustomScalingRule public : Object
{
	// Fields

};


instance 1ab5e14b800
class DrawFrustumComponent public : PrimitiveComponent
{
	// Fields
	Color FrustumColor; // 0x3d8
	float FrustumAngle; // 0x3dc
	float FrustumAspectRatio; // 0x3e0
	float FrustumStartDist; // 0x3e4
	float FrustumEndDist; // 0x3e8
	Texture* Texture; // 0x3f0

};


instance 1ab5e14b5c0
class DrawSphereComponent public : SphereComponent
{
	// Fields

};


instance 1ab5e14b380
class EdGraph public : Object
{
	// Fields
	EdGraphSchema* Schema; // 0x28
	TArray Nodes; // 0x30
	bool bEditable; // 0x40
	bool bAllowDeletion; // 0x40
	bool bAllowRenaming; // 0x40

};


instance 1ab5e14b140
class GraphNodeContextMenuContext public : Object
{
	// Fields
	Blueprint* Blueprint; // 0x28
	EdGraph* Graph; // 0x30
	EdGraphNode* Node; // 0x38
	bool bIsDebugging; // 0x48

};


instance 1ab5e14af00
class EdGraphNode public : Object
{
	// Fields
	TArray DeprecatedPins; // 0x38
	int NodePosX; // 0x48
	int NodePosY; // 0x4c
	int NodeWidth; // 0x50
	int NodeHeight; // 0x54
	BYTE AdvancedPinDisplay; // 0x58
	ENodeEnabledState EnabledState; // 0x59
	bool bDisplayAsDisabled; // 0x5b
	bool bUserSetEnabledState; // 0x5b
	bool bIsNodeEnabled; // 0x5b
	bool bHasCompilerMessage; // 0x5b
	FString NodeComment; // 0x60
	int ErrorType; // 0x70
	FString ErrorMsg; // 0x78
	Guid NodeGuid; // 0x88

};


instance 1ab5e14acc0
class EdGraphNode_Documentation public : EdGraphNode
{
	// Fields
	FString Link; // 0x98
	FString Excerpt; // 0xa8

};


instance 1ab5e14aa80
class EdGraphPin_Deprecated public : Object
{
	// Fields
	FString PinName; // 0x28
	FString PinToolTip; // 0x38
	BYTE Direction; // 0x48
	EdGraphPinType PinType; // 0x50
	FString DefaultValue; // 0xa8
	FString AutogeneratedDefaultValue; // 0xb8
	Object* DefaultObject; // 0xc8
	FText DefaultTextValue; // 0xd0
	TArray LinkedTo; // 0xe8
	TArray SubPins; // 0xf8
	EdGraphPin_Deprecated* ParentPin; // 0x108
	EdGraphPin_Deprecated* ReferencePassThroughConnection; // 0x110

};


instance 1ab5e14a840
class EdGraphSchema public : Object
{
	// Fields

};


instance 1ab5e14a600
class Emitter public : Actor
{
	// Fields
	ParticleSystemComponent* ParticleSystemComponent; // 0x218
	bool bDestroyOnSystemFinish; // 0x220
	bool bPostUpdateTickGroup; // 0x220
	bool bCurrentlyActive; // 0x220
	MulticastInlineDelegateProperty OnParticleSpawn; // 0x228 property 0x1ab71d77200 hash 0xb7a5ed1a
	MulticastInlineDelegateProperty OnParticleBurst; // 0x238 property 0x1ab71d77280 hash 0xb7a5ed1a
	MulticastInlineDelegateProperty OnParticleDeath; // 0x248 property 0x1ab71d77300 hash 0xb7a5ed1a
	MulticastInlineDelegateProperty OnParticleCollide; // 0x258 property 0x1ab71d77380 hash 0xb7a5ed1a

	// Functions
	ToggleActive 0x3e045 hash 6361d743 params:(  );
	SetVectorParameter 0x49c90 hash df99c205 params:( None ParameterName;Vector Param; );
	SetTemplate 0x49c89 hash 73c4be4d params:( ParticleSystem NewTemplate; );
	SetMaterialParameter 0x49c7e hash 6d43c681 params:( None ParameterName;MaterialInterface Param; );
	SetFloatParameter 0x40ca1 hash 44c33de8 params:( None ParameterName;None Param; );
	SetColorParameter 0x49c74 hash 31425cb1 params:( None ParameterName;LinearColor Param; );
	SetActorParameter 0x49c6a hash 89e8626b params:( None ParameterName;Actor Param; );
	OnRep_bCurrentlyActive 0x49c5e hash c995c8ae params:(  );
	OnParticleSystemFinished 0x49c51 hash 629c9d05 params:( ParticleSystemComponent FinishedComponent; );
	IsActive 0x3dfb3 hash dc27ddd params:( None ReturnValue; );
	Deactivate 0x3df9b hash 9d90ffdf params:(  );
	Activate 0x3df71 hash 5374ac56 params:(  );
};


instance 1ab5e14a3c0
class EmitterCameraLensEffectBase public : Emitter
{
	// Fields
	ParticleSystem* PS_CameraEffect; // 0x268
	ParticleSystem* PS_CameraEffectNonExtremeContent; // 0x270
	PlayerCameraManager* BaseCamera; // 0x278
	Transform RelativeTransform; // 0x280
	float BaseFOV; // 0x2b0
	bool bAllowMultipleInstances; // 0x2b4
	bool bResetWhenRetriggered; // 0x2b4
	TArray EmittersToTreatAsSame; // 0x2b8
	float DistFromCamera; // 0x2c8

};


instance 1ab5e14a180
class EngineBaseTypes public : Object
{
	// Fields

};


instance 1ab5e149f40
class EngineHandlerComponentFactory public : HandlerComponentFactory
{
	// Fields

};


instance 1ab5e149ac0
class LocalMessage public : Object
{
	// Fields

};


instance 1ab5e149d00
class EngineMessage public : LocalMessage
{
	// Fields
	FString FailedPlaceMessage; // 0x28
	FString MaxedOutMessage; // 0x38
	FString EnteredMessage; // 0x48
	FString LeftMessage; // 0x58
	FString GlobalNameChange; // 0x68
	FString SpecEnteredMessage; // 0x78
	FString NewPlayerMessage; // 0x88
	FString NewSpecMessage; // 0x98

};


instance 1ab5e149880
class EngineTypes public : Object
{
	// Fields

};


instance 1ab5e149640
class ExponentialHeightFog public : Info
{
	// Fields
	ExponentialHeightFogComponent* Component; // 0x218
	bool bEnabled; // 0x220

	// Functions
	OnRep_bEnabled 0x456da hash f2b2e395 params:(  );
};


instance 1ab5e14fdc0
class ExponentialHeightFogComponent public : SceneComponent
{
	// Fields
	float FogDensity; // 0x1f0
	float FogHeightFalloff; // 0x1f4
	ExponentialHeightFogData SecondFogData; // 0x1f8
	LinearColor FogInscatteringColor; // 0x204
	TextureCube* InscatteringColorCubemap; // 0x218
	float InscatteringColorCubemapAngle; // 0x220
	LinearColor InscatteringTextureTint; // 0x224
	float FullyDirectionalInscatteringColorDistance; // 0x234
	float NonDirectionalInscatteringColorDistance; // 0x238
	float DirectionalInscatteringExponent; // 0x23c
	float DirectionalInscatteringStartDistance; // 0x240
	LinearColor DirectionalInscatteringColor; // 0x244
	float FogMaxOpacity; // 0x254
	float StartDistance; // 0x258
	float FogCutoffDistance; // 0x25c
	bool bEnableVolumetricFog; // 0x260
	float VolumetricFogScatteringDistribution; // 0x264
	Color VolumetricFogAlbedo; // 0x268
	LinearColor VolumetricFogEmissive; // 0x26c
	float VolumetricFogExtinctionScale; // 0x27c
	float VolumetricFogDistance; // 0x280
	float VolumetricFogStaticLightingScatteringIntensity; // 0x284
	bool bOverrideLightColorsWithFogInscatteringColors; // 0x288

	// Functions
	SetVolumetricFogScatteringDistribution 0x49dfa hash c5abcf8b params:( None NewValue; );
	SetVolumetricFogExtinctionScale 0x49de9 hash 5b7423a4 params:( None NewValue; );
	SetVolumetricFogEmissive 0x49ddc hash 4a3402dc params:( LinearColor NewValue; );
	SetVolumetricFogDistance 0x49dcf hash 41651dc2 params:( None NewValue; );
	SetVolumetricFogAlbedo 0x49dc3 hash f5015fde params:( Color NewValue; );
	SetVolumetricFog 0x49dba hash b89af337 params:( None bNewValue; );
	SetStartDistance 0x48c91 hash 6768fc2a params:( None Value; );
	SetNonDirectionalInscatteringColorDistance 0x49da4 hash e96939bf params:( None Value; );
	SetInscatteringTextureTint 0x49d96 hash 4bf58fec params:( LinearColor Value; );
	SetInscatteringColorCubemapAngle 0x49d85 hash 913c011f params:( None Value; );
	SetInscatteringColorCubemap 0x49d76 hash 88c76f38 params:( TextureCube Value; );
	SetFullyDirectionalInscatteringColorDistance 0x49d5f hash 28beb960 params:( None Value; );
	SetFogMaxOpacity 0x49d56 hash 73dc5ccc params:( None Value; );
	SetFogInscatteringColor 0x49d49 hash d767c997 params:( LinearColor Value; );
	SetFogHeightFalloff 0x49d3e hash 4a271a20 params:( None Value; );
	SetFogDensity 0x49d36 hash f83f478d params:( None Value; );
	SetFogCutoffDistance 0x49d2b hash db5cc45f params:( None Value; );
	SetDirectionalInscatteringStartDistance 0x49d16 hash 8c6455e3 params:( None Value; );
	SetDirectionalInscatteringExponent 0x49d04 hash 958f73fb params:( None Value; );
	SetDirectionalInscatteringColor 0x49cf3 hash e3b482c9 params:( LinearColor Value; );
};


instance 1ab5e14fb80
class Exporter public : Object
{
	// Fields
	Object* SupportedClass; // 0x28
	Object* ExportRootScope; // 0x30
	TArray FormatExtension; // 0x38
	TArray FormatDescription; // 0x48
	int PreferredFormatIndex; // 0x58
	int TextIndent; // 0x5c
	bool bText; // 0x60
	bool bSelectedOnly; // 0x60
	bool bForceFileOperations; // 0x60
	AssetExportTask* ExportTask; // 0x68

	// Functions
	ScriptRunAssetExportTask 0x27af1 hash 39dd3b24 params:( AssetExportTask Task;None ReturnValue; );
	RunAssetExportTasks 0x49e1d hash ec917ba2 params:( ExportTasks ExportTasks;None ReturnValue; );
	RunAssetExportTask 0x49e13 hash f7a7514f params:( AssetExportTask Task;None ReturnValue; );
};


instance 1ab5e14f940
class FloatingPawnMovement public : PawnMovementComponent
{
	// Fields
	float MaxSpeed; // 0x138
	float Acceleration; // 0x13c
	float Deceleration; // 0x140
	float TurningBoost; // 0x144
	bool bPositionCorrected; // 0x148

};


instance 1ab5e14f700
class Font public : Object
{
	// Fields
	EFontCacheType FontCacheType; // 0x30
	TArray Characters; // 0x38
	TArray Textures; // 0x48
	int IsRemapped; // 0x58
	float EmScale; // 0x5c
	float Ascent; // 0x60
	float Descent; // 0x64
	float Leading; // 0x68
	int Kerning; // 0x6c
	FontImportOptionsData ImportOptions; // 0x70
	int NumCharacters; // 0x120
	TArray MaxCharHeight; // 0x128
	float ScalingFactor; // 0x138
	int LegacyFontSize; // 0x13c
	FName LegacyFontName; // 0x140
	CompositeFont CompositeFont; // 0x148

};


instance 1ab5e14f4c0
class FontFace public : Object
{
	// Fields
	FString SourceFilename; // 0x30
	EFontHinting Hinting; // 0x40
	EFontLoadingPolicy LoadingPolicy; // 0x41
	EFontLayoutMethod LayoutMethod; // 0x42

};


instance 1ab5e14f280
class FontImportOptions public : Object
{
	// Fields
	FontImportOptionsData Data; // 0x28

};


instance 1ab5e14f040
class ForceFeedbackAttenuation public : Object
{
	// Fields
	ForceFeedbackAttenuationSettings Attenuation; // 0x28

};


instance 1ab5e14ee00
class ForceFeedbackComponent public : SceneComponent
{
	// Fields
	ForceFeedbackEffect* ForceFeedbackEffect; // 0x1f0
	bool bAutoDestroy; // 0x1f8
	bool bStopWhenOwnerDestroyed; // 0x1f8
	bool bLooping; // 0x1f8
	bool bIgnoreTimeDilation; // 0x1f8
	bool bOverrideAttenuation; // 0x1f8
	float IntensityMultiplier; // 0x1fc
	ForceFeedbackAttenuation* AttenuationSettings; // 0x200
	ForceFeedbackAttenuationSettings AttenuationOverrides; // 0x208
	MulticastInlineDelegateProperty OnForceFeedbackFinished; // 0x2b8 property 0x1ab71d7d780 hash 0xb7a5ed1a

	// Functions
	Stop 0x3e2ef hash 7c8c8f2b params:(  );
	SetIntensityMultiplier 0x49e6a hash 9a341edf params:( None NewIntensityMultiplier; );
	SetForceFeedbackEffect 0x49e5e hash e6ccf212 params:( ForceFeedbackEffect NewForceFeedbackEffect; );
	Play 0x3fb72 hash 7c8ac63b params:( None StartTime; );
	BP_GetAttenuationSettingsToApply 0x40c21 hash 707247c params:( ForceFeedbackAttenuationSettings OutAttenuationSettings;None ReturnValue; );
	AdjustAttenuation 0x40c10 hash e674439c params:( ForceFeedbackAttenuationSettings InAttenuationSettings; );
};


instance 1ab5e14ebc0
class ForceFeedbackEffect public : Object
{
	// Fields
	TArray ChannelDetails; // 0x28
	float Duration; // 0x38

};


instance 1ab5e14e980
class GameEngine public : Engine
{
	// Fields
	float MaxDeltaTime; // 0xde8
	float ServerFlushLogInterval; // 0xdec
	GameInstance* GameInstance; // 0xdf0

};


instance 1ab5e14e740
class GameInstanceSubsystem public : Subsystem
{
	// Fields

};


instance 1ab5e14e500
class GameNetworkManager public : Info
{
	// Fields
	float BadPacketLossThreshold; // 0x218
	float SeverePacketLossThreshold; // 0x21c
	int BadPingThreshold; // 0x220
	int SeverePingThreshold; // 0x224
	int AdjustedNetSpeed; // 0x228
	float LastNetSpeedUpdateTime; // 0x22c
	int TotalNetBandwidth; // 0x230
	int MinDynamicBandwidth; // 0x234
	int MaxDynamicBandwidth; // 0x238
	bool bIsStandbyCheckingEnabled; // 0x23c
	bool bHasStandbyCheatTriggered; // 0x23c
	float StandbyRxCheatTime; // 0x240
	float StandbyTxCheatTime; // 0x244
	float PercentMissingForRxStandby; // 0x248
	float PercentMissingForTxStandby; // 0x24c
	float PercentForBadPing; // 0x250
	float JoinInProgressStandbyWaitTime; // 0x254
	float MoveRepSize; // 0x258
	float MAXPOSITIONERRORSQUARED; // 0x25c
	float MAXNEARZEROVELOCITYSQUARED; // 0x260
	float CLIENTADJUSTUPDATECOST; // 0x264
	float MAXCLIENTUPDATEINTERVAL; // 0x268
	float MaxClientForcedUpdateDuration; // 0x26c
	float ServerForcedUpdateHitchThreshold; // 0x270
	float ServerForcedUpdateHitchCooldown; // 0x274
	float MaxMoveDeltaTime; // 0x278
	float MaxClientSmoothingDeltaTime; // 0x27c
	float ClientNetSendMoveDeltaTime; // 0x280
	float ClientNetSendMoveDeltaTimeThrottled; // 0x284
	float ClientNetSendMoveDeltaTimeStationary; // 0x288
	int ClientNetSendMoveThrottleAtNetSpeed; // 0x28c
	int ClientNetSendMoveThrottleOverPlayerCount; // 0x290
	bool ClientAuthorativePosition; // 0x294
	float ClientErrorUpdateRateLimit; // 0x298
	float ClientNetCamUpdateDeltaTime; // 0x29c
	float ClientNetCamUpdatePositionLimit; // 0x2a0
	bool bMovementTimeDiscrepancyDetection; // 0x2a4
	bool bMovementTimeDiscrepancyResolution; // 0x2a5
	float MovementTimeDiscrepancyMaxTimeMargin; // 0x2a8
	float MovementTimeDiscrepancyMinTimeMargin; // 0x2ac
	float MovementTimeDiscrepancyResolutionRate; // 0x2b0
	float MovementTimeDiscrepancyDriftAllowance; // 0x2b4
	bool bMovementTimeDiscrepancyForceCorrectionsDuringResolution; // 0x2b8
	bool bUseDistanceBasedRelevancy; // 0x2b9

};


instance 1ab5e14e2c0
class GameplayStatics public : BlueprintFunctionLibrary
{
	// Fields

	// Functions
	UnloadStreamLevel 0x4a3b1 hash 935fe28c params:( Object WorldContextObject;None LevelName;LatentActionInfo LatentInfo;None bShouldBlockOnUnload; );
	SuggestProjectileVelocity_CustomArc 0x4a39e hash b7018077 params:( Object WorldContextObject;Vector OutLaunchVelocity;Vector StartPos;Vector EndPos;None OverrideGravityZ;None ArcParam;None ReturnValue; );
	SpawnSoundAttached 0x4a394 hash e4b6a875 params:( SoundBase Sound;SceneComponent AttachToComponent;None AttachPointName;Vector Location;Rotator Rotation;EAttachLocation LocationType;None bStopWhenAttachedToDestroyed;None VolumeMultiplier;None PitchMultiplier;None StartTime;SoundAttenuation AttenuationSettings;SoundConcurrency ConcurrencySettings;None bAutoDestroy;AudioComponent ReturnValue; );
	SpawnSoundAtLocation 0x4a389 hash 37f25b45 params:( Object WorldContextObject;SoundBase Sound;Vector Location;Rotator Rotation;None VolumeMultiplier;None PitchMultiplier;None StartTime;SoundAttenuation AttenuationSettings;SoundConcurrency ConcurrencySettings;None bAutoDestroy;AudioComponent ReturnValue; );
	SpawnSound2D 0x4a382 hash c2cdda2d params:( Object WorldContextObject;SoundBase Sound;None VolumeMultiplier;None PitchMultiplier;None StartTime;SoundConcurrency ConcurrencySettings;None bPersistAcrossLevelTransition;None bAutoDestroy;AudioComponent ReturnValue; );
	SpawnObject 0x4a37b hash b5cfb165 params:( Class ObjectClass;Object Outer;Object ReturnValue; );
	SpawnForceFeedbackAttached 0x4a36d hash af3ad240 params:( ForceFeedbackEffect ForceFeedbackEffect;SceneComponent AttachToComponent;None AttachPointName;Vector Location;Rotator Rotation;EAttachLocation LocationType;None bStopWhenAttachedToDestroyed;None bLooping;None IntensityMultiplier;None StartTime;ForceFeedbackAttenuation AttenuationSettings;None bAutoDestroy;ForceFeedbackComponent ReturnValue; );
	SpawnForceFeedbackAtLocation 0x4a35e hash b42823d0 params:( Object WorldContextObject;ForceFeedbackEffect ForceFeedbackEffect;Vector Location;Rotator Rotation;None bLooping;None IntensityMultiplier;None StartTime;ForceFeedbackAttenuation AttenuationSettings;None bAutoDestroy;ForceFeedbackComponent ReturnValue; );
	SpawnEmitterAttached 0x4a353 hash c0c5e526 params:( ParticleSystem EmitterTemplate;SceneComponent AttachToComponent;None AttachPointName;Vector Location;Rotator Rotation;Vector Scale;EAttachLocation LocationType;None bAutoDestroy;UnderlyingType PoolingMethod;None bAutoActivate;ParticleSystemComponent ReturnValue; );
	SpawnEmitterAtLocation 0x4a347 hash 54c38836 params:( Object WorldContextObject;ParticleSystem EmitterTemplate;Vector Location;Rotator Rotation;Vector Scale;None bAutoDestroy;UnderlyingType PoolingMethod;None bAutoActivateSystem;ParticleSystemComponent ReturnValue; );
	SpawnDialogueAttached 0x4a33b hash 89db7c96 params:( DialogueWave Dialogue;DialogueContext Context;SceneComponent AttachToComponent;None AttachPointName;Vector Location;Rotator Rotation;EAttachLocation LocationType;None bStopWhenAttachedToDestroyed;None VolumeMultiplier;None PitchMultiplier;None StartTime;SoundAttenuation AttenuationSettings;None bAutoDestroy;AudioComponent ReturnValue; );
	SpawnDialogueAtLocation 0x4a32e hash b99cbba6 params:( Object WorldContextObject;DialogueWave Dialogue;DialogueContext Context;Vector Location;Rotator Rotation;None VolumeMultiplier;None PitchMultiplier;None StartTime;SoundAttenuation AttenuationSettings;None bAutoDestroy;AudioComponent ReturnValue; );
	SpawnDialogue2D 0x4a325 hash 7a32698e params:( Object WorldContextObject;DialogueWave Dialogue;DialogueContext Context;None VolumeMultiplier;None PitchMultiplier;None StartTime;None bAutoDestroy;AudioComponent ReturnValue; );
	SpawnDecalAttached 0x4a31b hash 6378dee5 params:( MaterialInterface DecalMaterial;Vector DecalSize;SceneComponent AttachToComponent;None AttachPointName;Vector Location;Rotator Rotation;EAttachLocation LocationType;None LifeSpan;DecalComponent ReturnValue; );
	SpawnDecalAtLocation 0x4a310 hash 701bedb5 params:( Object WorldContextObject;MaterialInterface DecalMaterial;Vector DecalSize;Vector Location;Rotator Rotation;None LifeSpan;DecalComponent ReturnValue; );
	SetWorldOriginLocation 0x4a304 hash 27204afa params:( Object WorldContextObject;IntVector NewLocation; );
	SetViewportMouseCaptureMode 0x4a2f5 hash 8ffa57f3 params:( Object WorldContextObject;UnderlyingType MouseCaptureMode; );
	SetSubtitlesEnabled 0x4a2ea hash 526e455b params:( None bEnabled; );
	SetSoundMixClassOverride 0x4a2dd hash 8a1b979e params:( Object WorldContextObject;SoundMix InSoundMixModifier;SoundClass InSoundClass;None Volume;None Pitch;None FadeInTime;None bApplyToChildren; );
	SetPlayerControllerID 0x4a2d1 hash f6ee402f params:( PlayerController Player;None ControllerId; );
	SetMaxAudioChannelsScaled 0x4a2c3 hash 853f701 params:( Object WorldContextObject;None MaxChannelCountScale; );
	SetGlobalTimeDilation 0x4a2b7 hash d4a04525 params:( Object WorldContextObject;None TimeDilation; );
	SetGlobalPitchModulation 0x4a2aa hash 383d2636 params:( Object WorldContextObject;None PitchModulation;None TimeSec; );
	SetGlobalListenerFocusParameters 0x4a299 hash 94cde9bc params:( Object WorldContextObject;None FocusAzimuthScale;None NonFocusAzimuthScale;None FocusDistanceScale;None NonFocusDistanceScale;None FocusVolumeScale;None NonFocusVolumeScale;None FocusPriorityScale;None NonFocusPriorityScale; );
	SetGamePaused 0x4a291 hash e1622a4d params:( Object WorldContextObject;None bPaused;None ReturnValue; );
	SetForceDisableSplitscreen 0x4a283 hash d8531960 params:( Object WorldContextObject;None bDisable; );
	SetEnableWorldRendering 0x4a276 hash d102f55e params:( Object WorldContextObject;None bEnable; );
	SetBaseSoundMix 0x4a26d hash e02dfbe3 params:( Object WorldContextObject;SoundMix InSoundMix; );
	SaveGameToSlot 0x4a265 hash 87cbd013 params:( SaveGame SaveGameObject;None SlotName;None UserIndex;None ReturnValue; );
	RemovePlayer 0x4a25e hash e6275c40 params:( PlayerController Player;None bDestroyPawn; );
	RebaseZeroOriginOntoLocal 0x4a250 hash 33ad156a params:( Object WorldContextObject;Vector WorldLocation;Vector ReturnValue; );
	RebaseLocalOriginOntoZero 0x4a242 hash c0df07aa params:( Object WorldContextObject;Vector WorldLocation;Vector ReturnValue; );
	PushSoundMixModifier 0x4a237 hash b28aa6cb params:( Object WorldContextObject;SoundMix InSoundMixModifier; );
	ProjectWorldToScreen 0x4a22c hash 85f144e7 params:( PlayerController Player;Vector WorldPosition;Vector2D ScreenPosition;None bPlayerViewportRelative;None ReturnValue; );
	PrimeSound 0x4a226 hash f7a7922b params:( SoundBase InSound; );
	PopSoundMixModifier 0x4a21b hash c2f64bfa params:( Object WorldContextObject;SoundMix InSoundMixModifier; );
	PlayWorldCameraShake 0x4a210 hash b5e1718 params:( Object WorldContextObject;Class Shake;Vector Epicenter;None InnerRadius;None OuterRadius;None Falloff;None bOrientShakeTowardsEpicenter; );
	PlaySoundAtLocation 0x4a205 hash 9c389912 params:( Object WorldContextObject;SoundBase Sound;Vector Location;Rotator Rotation;None VolumeMultiplier;None PitchMultiplier;None StartTime;SoundAttenuation AttenuationSettings;SoundConcurrency ConcurrencySettings;Actor OwningActor; );
	PlaySound2D 0x4a1fe hash 1bad9afa params:( Object WorldContextObject;SoundBase Sound;None VolumeMultiplier;None PitchMultiplier;None StartTime;SoundConcurrency ConcurrencySettings;Actor OwningActor; );
	PlayDialogueAtLocation 0x4a1f2 hash 22064253 params:( Object WorldContextObject;DialogueWave Dialogue;DialogueContext Context;Vector Location;Rotator Rotation;None VolumeMultiplier;None PitchMultiplier;None StartTime;SoundAttenuation AttenuationSettings; );
	PlayDialogue2D 0x4a1ea hash 846a933b params:( Object WorldContextObject;DialogueWave Dialogue;DialogueContext Context;None VolumeMultiplier;None PitchMultiplier;None StartTime; );
	ParseOption 0x4a1e3 hash 408e00d9 params:( None Options;None Key;None ReturnValue; );
	OpenLevel 0x4a1dd hash a63aa5af params:( Object WorldContextObject;None LevelName;None bAbsolute;None Options; );
	MakeHitResult 0x4a1d5 hash 80c1f507 params:( None bBlockingHit;None bInitialOverlap;None Time;None Distance;Vector Location;Vector ImpactPoint;Vector Normal;Vector ImpactNormal;PhysicalMaterial PhysMat;Actor HitActor;PrimitiveComponent HitComponent;None HitBoneName;None HitItem;None FaceIndex;Vector TraceStart;Vector TraceEnd;HitResult ReturnValue; );
	LoadStreamLevel 0x4a1cc hash 4b2dac29 params:( Object WorldContextObject;None LevelName;None bMakeVisibleAfterLoad;None bShouldBlockOnLoad;LatentActionInfo LatentInfo; );
	LoadGameFromSlot 0x4a1c3 hash 537882b5 params:( None SlotName;None UserIndex;SaveGame ReturnValue; );
	IsSplitscreenForceDisabled 0x4a1b5 hash b6e04654 params:( Object WorldContextObject;None ReturnValue; );
	IsGamePaused 0x4a1ae hash 313e98fd params:( Object WorldContextObject;None ReturnValue; );
	HasOption 0x4a1a8 hash 8eeaf25a params:( None Options;None InKey;None ReturnValue; );
	HasLaunchOption 0x4a19f hash fa822175 params:( None OptionToCheck;None ReturnValue; );
	GrassOverlappingSphereCount 0x4a190 hash 99ca181c params:( Object WorldContextObject;StaticMesh StaticMesh;Vector CenterPosition;None Radius;None ReturnValue; );
	GetWorldOriginLocation 0x4a184 hash c70ccb6e params:( Object WorldContextObject;IntVector ReturnValue; );
	GetWorldDeltaSeconds 0x4a179 hash 5df6a186 params:( Object WorldContextObject;None ReturnValue; );
	GetViewProjectionMatrix 0x4a16c hash d2e5f492 params:( MinimalViewInfo DesiredView;Matrix ViewMatrix;Matrix ProjectionMatrix;Matrix ViewProjectionMatrix; );
	GetViewportMouseCaptureMode 0x4a15d hash a64d40e7 params:( Object WorldContextObject;UnderlyingType ReturnValue; );
	GetUnpausedTimeSeconds 0x4a151 hash 4cf4a668 params:( Object WorldContextObject;None ReturnValue; );
	GetTimeSeconds 0x4a149 hash 1baa12a3 params:( Object WorldContextObject;None ReturnValue; );
	GetSurfaceType 0x4a141 hash 2a96c930 params:( HitResult Hit;EPhysicalSurface ReturnValue; );
	GetStreamingLevel 0x4a137 hash a7345b87 params:( Object WorldContextObject;None PackageName;LevelStreaming ReturnValue; );
	GetRealTimeSeconds 0x4a12d hash 676b1047 params:( Object WorldContextObject;None ReturnValue; );
	GetPlayerPawn 0x4a125 hash 7137d388 params:( Object WorldContextObject;None PlayerIndex;Pawn ReturnValue; );
	GetPlayerControllerID 0x4a119 hash 2a528223 params:( PlayerController Player;None ReturnValue; );
	GetPlayerControllerFromID 0x4a10b hash 32bc8057 params:( Object WorldContextObject;None ControllerId;PlayerController ReturnValue; );
	GetPlayerController 0x4a100 hash 1f4de2f6 params:( Object WorldContextObject;None PlayerIndex;PlayerController ReturnValue; );
	GetPlayerCharacter 0x4a0f6 hash 37b354df params:( Object WorldContextObject;None PlayerIndex;Character ReturnValue; );
	GetPlayerCameraManager 0x4a0ea hash ae62c4d6 params:( Object WorldContextObject;None PlayerIndex;PlayerCameraManager ReturnValue; );
	GetPlatformName 0x4a0e1 hash ad71a62b params:( None ReturnValue; );
	GetObjectClass 0x4a0d9 hash f7778052 params:( Object Object;Class ReturnValue; );
	GetMaxAudioChannelCount 0x4a0cc hash 88c4433f params:( Object WorldContextObject;None ReturnValue; );
	GetKeyValue 0x4a0c5 hash ff3d548b params:( None Pair;None Key;None Value; );
	GetIntOption 0x4a0be hash bc1bd4e9 params:( None Options;None Key;None DefaultValue;None ReturnValue; );
	GetGlobalTimeDilation 0x4a0b2 hash 8048719 params:( Object WorldContextObject;None ReturnValue; );
	GetGameState 0x4a0ab hash ea381000 params:( Object WorldContextObject;GameStateBase ReturnValue; );
	GetGameMode 0x4a0a4 hash ff53a904 params:( Object WorldContextObject;GameModeBase ReturnValue; );
	GetGameInstance 0x3e6d6 hash 898add94 params:( Object WorldContextObject;GameInstance ReturnValue; );
	GetEnableWorldRendering 0x4a097 hash 6e7f8452 params:( Object WorldContextObject;None ReturnValue; );
	GetCurrentReverbEffect 0x4a08b hash d1880c7b params:( Object WorldContextObject;ReverbEffect ReturnValue; );
	GetCurrentLevelName 0x4a080 hash f261e561 params:( Object WorldContextObject;None bRemovePrefixString;None ReturnValue; );
	GetAudioTimeSeconds 0x4a075 hash 8103d2f5 params:( Object WorldContextObject;None ReturnValue; );
	GetAllActorsWithTag 0x4a06a hash 1f8bc022 params:( Object WorldContextObject;None Tag;OutActors OutActors; );
	GetAllActorsWithInterface 0x4a05c hash 1d2d6537 params:( Object WorldContextObject;Class Interface;OutActors OutActors; );
	GetAllActorsOfClassWithTag 0x4a04e hash 231640cd params:( Object WorldContextObject;Class ActorClass;None Tag;OutActors OutActors; );
	GetAllActorsOfClass 0x4a043 hash ad461ab5 params:( Object WorldContextObject;Class ActorClass;OutActors OutActors; );
	GetActorOfClass 0x4a03a hash 7a304889 params:( Object WorldContextObject;Class ActorClass;Actor ReturnValue; );
	GetActorArrayBounds 0x4a02f hash 19577568 params:( Actors Actors;None bOnlyCollidingComponents;Vector Center;Vector BoxExtent; );
	GetActorArrayAverageLocation 0x4a020 hash 73c7a891 params:( Actors Actors;Vector ReturnValue; );
	GetAccurateRealTime 0x4a015 hash 3c472520 params:( Object WorldContextObject;None Seconds;None PartialSeconds; );
	FlushLevelStreaming 0x4a00a hash c52ccaa9 params:( Object WorldContextObject; );
	FinishSpawningActor 0x49fff hash 495d1326 params:( Actor Actor;Transform SpawnTransform;Actor ReturnValue; );
	FindCollisionUV 0x49ff6 hash e49835dd params:( HitResult Hit;None UVChannel;Vector2D UV;None ReturnValue; );
	EnableLiveStreaming 0x49feb hash 808f3a46 params:( None Enable; );
	DoesSaveGameExist 0x49fe1 hash b0da65e6 params:( None SlotName;None UserIndex;None ReturnValue; );
	DeprojectScreenToWorld 0x49fd5 hash 140d3590 params:( PlayerController Player;Vector2D ScreenPosition;Vector WorldPosition;Vector WorldDirection;None ReturnValue; );
	DeleteGameInSlot 0x49fcc hash 6d9de6cb params:( None SlotName;None UserIndex;None ReturnValue; );
	DeactivateReverbEffect 0x49fc0 hash b6cf1b12 params:( Object WorldContextObject;None TagName; );
	CreateSound2D 0x49fb8 hash 23bc9d98 params:( Object WorldContextObject;SoundBase Sound;None VolumeMultiplier;None PitchMultiplier;None StartTime;SoundConcurrency ConcurrencySettings;None bPersistAcrossLevelTransition;None bAutoDestroy;AudioComponent ReturnValue; );
	CreateSaveGameObject 0x49fad hash cabb0059 params:( Class SaveGameClass;SaveGame ReturnValue; );
	CreatePlayer 0x49fa6 hash 75f3b706 params:( Object WorldContextObject;None ControllerId;None bSpawnPlayerController;PlayerController ReturnValue; );
	ClearSoundMixModifiers 0x49f9a hash ef06f225 params:( Object WorldContextObject; );
	ClearSoundMixClassOverride 0x49f8c hash f5abde79 params:( Object WorldContextObject;SoundMix InSoundMixModifier;SoundClass InSoundClass;None FadeOutTime; );
	CancelAsyncLoading 0x49f82 hash 218c8b87 params:(  );
	BreakHitResult 0x49f7a hash 85e59c8e params:( HitResult Hit;None bBlockingHit;None bInitialOverlap;None Time;None Distance;Vector Location;Vector ImpactPoint;Vector Normal;Vector ImpactNormal;PhysicalMaterial PhysMat;Actor HitActor;PrimitiveComponent HitComponent;None HitBoneName;None HitItem;None FaceIndex;Vector TraceStart;Vector TraceEnd; );
	BlueprintSuggestProjectileVelocity 0x49f68 hash 853e36fc params:( Object WorldContextObject;Vector TossVelocity;Vector StartLocation;Vector EndLocation;None LaunchSpeed;None OverrideGravityZ;ESuggestProjVelocityTraceOption TraceOption;None CollisionRadius;None bFavorHighArc;None bDrawDebug;None ReturnValue; );
	Blueprint_PredictProjectilePath_ByTraceChannel 0x49f50 hash 6278fd24 params:( Object WorldContextObject;HitResult OutHit;OutPathPositions OutPathPositions;Vector OutLastTraceDestination;Vector StartPos;Vector LaunchVelocity;None bTracePath;None ProjectileRadius;ECollisionChannel TraceChannel;None bTraceComplex;ActorsToIgnore ActorsToIgnore;EDrawDebugTrace DrawDebugType;None DrawDebugTime;None SimFrequency;None MaxSimTime;None OverrideGravityZ;None ReturnValue; );
	Blueprint_PredictProjectilePath_ByObjectType 0x49f39 hash df0e44d5 params:( Object WorldContextObject;HitResult OutHit;OutPathPositions OutPathPositions;Vector OutLastTraceDestination;Vector StartPos;Vector LaunchVelocity;None bTracePath;None ProjectileRadius;ObjectTypes ObjectTypes;None bTraceComplex;ActorsToIgnore ActorsToIgnore;EDrawDebugTrace DrawDebugType;None DrawDebugTime;None SimFrequency;None MaxSimTime;None OverrideGravityZ;None ReturnValue; );
	Blueprint_PredictProjectilePath_Advanced 0x49f24 hash 1c88d277 params:( Object WorldContextObject;PredictProjectilePathParams PredictParams;PredictProjectilePathResult PredictResult;None ReturnValue; );
	BeginSpawningActorFromClass 0x49f15 hash c52928b4 params:( Object WorldContextObject;Class ActorClass;Transform SpawnTransform;None bNoCollisionFail;Actor Owner;Actor ReturnValue; );
	BeginSpawningActorFromBlueprint 0x49f04 hash 80a87ef3 params:( Object WorldContextObject;Blueprint Blueprint;Transform SpawnTransform;None bNoCollisionFail;Actor ReturnValue; );
	BeginDeferredActorSpawnFromClass 0x49ef3 hash ac09a6b7 params:( Object WorldContextObject;Class ActorClass;Transform SpawnTransform;UnderlyingType CollisionHandlingOverride;Actor Owner;Actor ReturnValue; );
	AreSubtitlesEnabled 0x49ee8 hash 5f6e9267 params:( None ReturnValue; );
	AreAnyListenersWithinRange 0x49eda hash a28a7c7e params:( Object WorldContextObject;Vector Location;None MaximumRange;None ReturnValue; );
	ApplyRadialDamageWithFalloff 0x49ecb hash 297acf8d params:( Object WorldContextObject;None BaseDamage;None MinimumDamage;Vector Origin;None DamageInnerRadius;None DamageOuterRadius;None DamageFalloff;Class DamageTypeClass;IgnoreActors IgnoreActors;Actor DamageCauser;Controller InstigatedByController;ECollisionChannel DamagePreventionChannel;None ReturnValue; );
	ApplyRadialDamage 0x49ec1 hash 3f8c9597 params:( Object WorldContextObject;None BaseDamage;Vector Origin;None DamageRadius;Class DamageTypeClass;IgnoreActors IgnoreActors;Actor DamageCauser;Controller InstigatedByController;None bDoFullDamage;ECollisionChannel DamagePreventionChannel;None ReturnValue; );
	ApplyPointDamage 0x49eb8 hash 11beebb4 params:( Actor DamagedActor;None BaseDamage;Vector HitFromDirection;HitResult HitInfo;Controller EventInstigator;Actor DamageCauser;Class DamageTypeClass;None ReturnValue; );
	ApplyDamage 0x49eb1 hash 36c8c5aa params:( Actor DamagedActor;None BaseDamage;Controller EventInstigator;Actor DamageCauser;Class DamageTypeClass;None ReturnValue; );
	ActivateReverbEffect 0x49ea6 hash 18c23209 params:( Object WorldContextObject;ReverbEffect ReverbEffect;None TagName;None Priority;None Volume;None FadeTime; );
};


instance 1ab5e14e080
class GameSession public : Info
{
	// Fields
	int MaxSpectators; // 0x218
	int MaxPlayers; // 0x21c
	int MaxPartySize; // 0x220
	BYTE MaxSplitscreensPerConnection; // 0x224
	bool bRequiresPushToTalk; // 0x225
	FName SessionName; // 0x228

};


instance 1ab5e1549c0
class GameUserSettings public : Object
{
	// Fields
	bool bUseVSync; // 0x28
	bool bUseDynamicResolution; // 0x29
	int ResolutionSizeX; // 0x80
	int ResolutionSizeY; // 0x84
	int LastUserConfirmedResolutionSizeX; // 0x88
	int LastUserConfirmedResolutionSizeY; // 0x8c
	int WindowPosX; // 0x90
	int WindowPosY; // 0x94
	int FullscreenMode; // 0x98
	int LastConfirmedFullscreenMode; // 0x9c
	int PreferredFullscreenMode; // 0xa0
	int Version; // 0xa4
	int AudioQualityLevel; // 0xa8
	int LastConfirmedAudioQualityLevel; // 0xac
	float FrameRateLimit; // 0xb0
	int DesiredScreenWidth; // 0xb8
	bool bUseDesiredScreenHeight; // 0xbc
	int DesiredScreenHeight; // 0xc0
	int LastUserConfirmedDesiredScreenWidth; // 0xc4
	int LastUserConfirmedDesiredScreenHeight; // 0xc8
	float LastRecommendedScreenWidth; // 0xcc
	float LastRecommendedScreenHeight; // 0xd0
	float LastCPUBenchmarkResult; // 0xd4
	float LastGPUBenchmarkResult; // 0xd8
	TArray LastCPUBenchmarkSteps; // 0xe0
	TArray LastGPUBenchmarkSteps; // 0xf0
	float LastGPUBenchmarkMultiplier; // 0x100
	bool bUseHDRDisplayOutput; // 0x104
	int HDRDisplayOutputNits; // 0x108
	MulticastInlineDelegateProperty OnGameUserSettingsUINeedsUpdate; // 0x110 property 0x1ab71dacc80 hash 0xb7a5ed1a

	// Functions
	ValidateSettings 0x4a6d1 hash c2f47a60 params:(  );
	SupportsHDRDisplayOutput 0x4a6c4 hash 1e0a01ba params:( None ReturnValue; );
	SetVSyncEnabled 0x4a6bb hash aa8e23af params:( None bEnable; );
	SetVisualEffectQuality 0x4a6af hash a06991bb params:( None Value; );
	SetViewDistanceQuality 0x4a6a3 hash 22284ce0 params:( None Value; );
	SetToDefaults 0x4a69b hash d180010c params:(  );
	SetTextureQuality 0x4a691 hash 6445a0ab params:( None Value; );
	SetShadowQuality 0x4a688 hash 79fea260 params:( None Value; );
	SetShadingQuality 0x4a67e hash 318ce3f8 params:( None Value; );
	SetScreenResolution 0x4a673 hash 35a58ac5 params:( IntPoint Resolution; );
	SetResolutionScaleValueEx 0x4a665 hash f9b3d607 params:( None NewScaleValue; );
	SetResolutionScaleValue 0x4a658 hash de249a2a params:( None NewScaleValue; );
	SetResolutionScaleNormalized 0x4a649 hash 4fc99cc2 params:( None NewScaleNormalized; );
	SetPostProcessingQuality 0x4a63c hash 8e5cfbd params:( None Value; );
	SetOverallScalabilityLevel 0x4a62e hash 8781188f params:( None Value; );
	SetFullscreenMode 0x4a624 hash a971a0a9 params:( EWindowMode InFullscreenMode; );
	SetFrameRateLimit 0x4a61a hash 1574367 params:( None NewLimit; );
	SetFoliageQuality 0x4a610 hash e7e87cf1 params:( None Value; );
	SetDynamicResolutionEnabled 0x4a601 hash fcce64b5 params:( None bEnable; );
	SetBenchmarkFallbackValues 0x4a5f3 hash a6f7563c params:(  );
	SetAudioQualityLevel 0x4a5e8 hash e0e06924 params:( None QualityLevel; );
	SetAntiAliasingQuality 0x4a5dc hash 68d9440e params:( None Value; );
	SaveSettings 0x4a5d5 hash a0b92925 params:(  );
	RunHardwareBenchmark 0x4a5ca hash a0f02333 params:( None WorkScale;None CPUMultiplier;None GPUMultiplier; );
	RevertVideoMode 0x4a5c1 hash 726d9179 params:(  );
	ResetToCurrentSettings 0x4a5b5 hash 30bce3f params:(  );
	LoadSettings 0x4a5ae hash cbc92c56 params:( None bForceReload; );
	IsVSyncEnabled 0x4a5a6 hash 6340fe5f params:( None ReturnValue; );
	IsVSyncDirty 0x4a59f hash 12fafc0 params:( None ReturnValue; );
	IsScreenResolutionDirty 0x4a592 hash a509f901 params:( None ReturnValue; );
	IsHDREnabled 0x4a58b hash bee78b0a params:( None ReturnValue; );
	IsFullscreenModeDirty 0x4a57f hash 39b37165 params:( None ReturnValue; );
	IsDynamicResolutionEnabled 0x4a571 hash cfeec765 params:( None ReturnValue; );
	IsDynamicResolutionDirty 0x4a564 hash dfab7f46 params:( None ReturnValue; );
	IsDirty 0x4a55f hash 8663b2d params:( None ReturnValue; );
	GetVisualEffectQuality 0x4a553 hash 4056122f params:( None ReturnValue; );
	GetViewDistanceQuality 0x4a547 hash c214cd54 params:( None ReturnValue; );
	GetTextureQuality 0x4a53d hash 820f089f params:( None ReturnValue; );
	GetSyncInterval 0x4a534 hash 720518a7 params:( None ReturnValue; );
	GetShadowQuality 0x4a52b hash e780dbd4 params:( None ReturnValue; );
	GetShadingQuality 0x4a521 hash 4f564bec params:( None ReturnValue; );
	GetScreenResolution 0x4a516 hash eb68bfb9 params:( IntPoint ReturnValue; );
	GetResolutionScaleNormalized 0x4a507 hash 3079a436 params:( None ReturnValue; );
	GetResolutionScaleInformationEx 0x4a4f6 hash 20d79a64 params:( None CurrentScaleNormalized;None CurrentScaleValue;None MinScaleValue;None MaxScaleValue; );
	GetResolutionScaleInformation 0x4a4e6 hash 21e1a347 params:( None CurrentScaleNormalized;None CurrentScaleValue;None MinScaleValue;None MaxScaleValue; );
	GetRecommendedResolutionScale 0x4a4d6 hash 786929e4 params:( None ReturnValue; );
	GetPreferredFullscreenMode 0x4a4c8 hash 8fa589bc params:( EWindowMode ReturnValue; );
	GetPostProcessingQuality 0x4a4bb hash 55f43d31 params:( None ReturnValue; );
	GetOverallScalabilityLevel 0x4a4ad hash 51e0b303 params:( None ReturnValue; );
	GetLastConfirmedScreenResolution 0x4a49c hash fdcdae24 params:( IntPoint ReturnValue; );
	GetLastConfirmedFullscreenMode 0x4a48c hash dc2b6048 params:( EWindowMode ReturnValue; );
	GetGameUserSettings 0x4a481 hash 355f712f params:( GameUserSettings ReturnValue; );
	GetFullscreenMode 0x4a477 hash c73b089d params:( EWindowMode ReturnValue; );
	GetFrameRateLimit 0x4a46d hash 1f20ab5b params:( None ReturnValue; );
	GetFoliageQuality 0x4a463 hash 5b1e4e5 params:( None ReturnValue; );
	GetDesktopResolution 0x4a458 hash 2cca65f3 params:( IntPoint ReturnValue; );
	GetDefaultWindowPosition 0x4a44b hash b2f61557 params:( IntPoint ReturnValue; );
	GetDefaultWindowMode 0x4a440 hash 64ca8e67 params:( EWindowMode ReturnValue; );
	GetDefaultResolutionScale 0x4a432 hash b0d4b646 params:( None ReturnValue; );
	GetDefaultResolution 0x4a427 hash 639f593e params:( IntPoint ReturnValue; );
	GetCurrentHDRDisplayNits 0x4a41a hash bf532f1a params:( None ReturnValue; );
	GetAudioQualityLevel 0x4a40f hash 4f0a3c98 params:( None ReturnValue; );
	GetAntiAliasingQuality 0x4a403 hash 8c5c482 params:( None ReturnValue; );
	EnableHDRDisplayOutput 0x4a3f7 hash e62f4ad1 params:( None bEnable;None DisplayNits; );
	ConfirmVideoMode 0x4a3ee hash ee9230f params:(  );
	ApplySettings 0x4a3e6 hash 29827f1c params:( None bCheckForCommandLineOverrides; );
	ApplyResolutionSettings 0x4a3d9 hash de9bafd0 params:( None bCheckForCommandLineOverrides; );
	ApplyNonResolutionSettings 0x4a3cb hash 7693ab3b params:(  );
	ApplyHardwareBenchmarkResults 0x4a3bb hash a22a4036 params:(  );
};


instance 1ab5e154540
class SpotLight public : Light
{
	// Fields
	SpotLightComponent* SpotLightComponent; // 0x228

	// Functions
	SetOuterConeAngle 0x4a6f6 hash fa17394c params:( None NewOuterConeAngle; );
	SetInnerConeAngle 0x4a6ec hash 45486cb9 params:( None NewInnerConeAngle; );
};


instance 1ab5e154780
class GeneratedMeshAreaLight public : SpotLight
{
	// Fields

};


instance 1ab5e154300
class HapticFeedbackEffect_Base public : Object
{
	// Fields

};


instance 1ab5e1540c0
class HapticFeedbackEffect_Buffer public : HapticFeedbackEffect_Base
{
	// Fields
	TArray Amplitudes; // 0x28
	int SampleRate; // 0x38

};


instance 1ab5e153e80
class HapticFeedbackEffect_Curve public : HapticFeedbackEffect_Base
{
	// Fields
	HapticFeedbackDetails_Curve HapticDetails; // 0x28

};


instance 1ab5e153c40
class HapticFeedbackEffect_SoundWave public : HapticFeedbackEffect_Base
{
	// Fields
	SoundWave* SoundWave; // 0x28

};


instance 1ab5e153a00
class HealthSnapshotBlueprintLibrary public : BlueprintFunctionLibrary
{
	// Fields

	// Functions
	StopPerformanceSnapshots 0x4a765 hash 7599fa00 params:(  );
	StartPerformanceSnapshots 0x4a757 hash 16e9b888 params:(  );
	LogPerformanceSnapshot 0x4a74b hash 85de029 params:( None SnapshotTitle;None bResetStats; );
};


instance 1ab5e1537c0
class HLODProxy public : Object
{
	// Fields
	TArray ProxyMeshes; // 0x28

};


instance 1ab5e153580
class AmbisonicsSubmixSettingsBase public : Object
{
	// Fields

};


instance 1ab5e153340
class SpatializationPluginSourceSettingsBase public : Object
{
	// Fields

};


instance 1ab5e153100
class OcclusionPluginSourceSettingsBase public : Object
{
	// Fields

};


instance 1ab5e152ec0
class SoundModulationPluginSourceSettingsBase public : Object
{
	// Fields

};


instance 1ab5e152c80
class ReverbPluginSourceSettingsBase public : Object
{
	// Fields

};


instance 1ab5e152a40
class ImportanceSamplingLibrary public : BlueprintFunctionLibrary
{
	// Fields

	// Functions
	RandomSobolFloat 0x4a82f hash a1cc32bb params:( None Index;None Dimension;None Seed;None ReturnValue; );
	RandomSobolCell3D 0x4a825 hash d3d2e63c params:( None Index;None NumCells;Vector Cell;Vector Seed;Vector ReturnValue; );
	RandomSobolCell2D 0x4a81b hash d3d2e61b params:( None Index;None NumCells;Vector2D Cell;Vector2D Seed;Vector2D ReturnValue; );
	NextSobolFloat 0x4a813 hash 6ebf07d9 params:( None Index;None Dimension;None PreviousValue;None ReturnValue; );
	NextSobolCell3D 0x4a80a hash 3f205f1a params:( None Index;None NumCells;Vector PreviousValue;Vector ReturnValue; );
	NextSobolCell2D 0x4a801 hash 3f205ef9 params:( None Index;None NumCells;Vector2D PreviousValue;Vector2D ReturnValue; );
	MakeImportanceTexture 0x4a7f5 hash 6beab3a6 params:( Texture2D Texture;EImportanceWeight WeightingFunc;ImportanceTexture ReturnValue; );
	ImportanceSample 0x4a7ec hash 696b0f99 params:( ImportanceTexture Texture;Vector2D Rand;None Samples;None Intensity;Vector2D SamplePosition;LinearColor SampleColor;None SampleIntensity;None SampleSize; );
	BreakImportanceTexture 0x4a7e0 hash 7f64f22d params:( ImportanceTexture ImportanceTexture;Texture2D Texture;EImportanceWeight WeightingFunc; );
};


instance 1ab5e152800
class ImportantToggleSettingInterface public : Interface
{
	// Fields

};


instance 1ab5e1525c0
class InGameAdManager public : PlatformInterfaceBase
{
	// Fields
	bool bShouldPauseWhileAdOpen; // 0x38
	TArray ClickedBannerDelegates; // 0x40
	TArray ClosedAdDelegates; // 0x50

};


instance 1ab5e152380
class InheritableComponentHandler public : Object
{
	// Fields
	TArray Records; // 0x28
	TArray UnnecessaryComponents; // 0x38

};


instance 1ab5e151f00
class InputDelegateBinding public : DynamicBlueprintBinding
{
	// Fields

};


instance 1ab5e152140
class InputActionDelegateBinding public : InputDelegateBinding
{
	// Fields
	TArray InputActionDelegateBindings; // 0x28

};


instance 1ab5e151cc0
class InputAxisDelegateBinding public : InputDelegateBinding
{
	// Fields
	TArray InputAxisDelegateBindings; // 0x28

};


instance 1ab5e151a80
class InputAxisKeyDelegateBinding public : InputDelegateBinding
{
	// Fields
	TArray InputAxisKeyDelegateBindings; // 0x28

};


instance 1ab5e151840
class InputComponent public : ActorComponent
{
	// Fields
	TArray CachedKeyToActionInfo; // 0x120

	// Functions
	WasControllerKeyJustReleased 0x4a908 hash ae0e8388 params:( Key Key;None ReturnValue; );
	WasControllerKeyJustPressed 0x4a8f9 hash 52e091d9 params:( Key Key;None ReturnValue; );
	IsControllerKeyDown 0x4a8ee hash 87179926 params:( Key Key;None ReturnValue; );
	GetTouchState 0x4a8e6 hash bb5d1389 params:( None FingerIndex;None LocationX;None LocationY;None bIsCurrentlyPressed; );
	GetControllerVectorKeyState 0x4a8d7 hash b84f1ea6 params:( Key Key;Vector ReturnValue; );
	GetControllerMouseDelta 0x4a8ca hash 479da73c params:( None DeltaX;None DeltaY; );
	GetControllerKeyTimeDown 0x4a8bd hash d19ee959 params:( Key Key;None ReturnValue; );
	GetControllerAnalogStickState 0x4a8ad hash 26d771a params:( EControllerAnalogStick WhichStick;None StickX;None StickY; );
	GetControllerAnalogKeyState 0x4a89e hash 183c7a25 params:( Key Key;None ReturnValue; );
};


instance 1ab5e151600
class InputKeyDelegateBinding public : InputDelegateBinding
{
	// Fields
	TArray InputKeyDelegateBindings; // 0x28

};


instance 1ab5e1513c0
class InputSettings public : Object
{
	// Fields
	TArray AxisConfig; // 0x28
	bool bAltEnterTogglesFullscreen; // 0x38
	bool bF11TogglesFullscreen; // 0x38
	bool bUseMouseForTouch; // 0x38
	bool bEnableMouseSmoothing; // 0x38
	bool bEnableFOVScaling; // 0x38
	bool bCaptureMouseOnLaunch; // 0x38
	bool bDefaultViewportMouseLock; // 0x38
	bool bAlwaysShowTouchInterface; // 0x38
	bool bShowConsoleOnFourFingerTap; // 0x39
	bool bEnableGestureRecognizer; // 0x39
	bool bUseAutocorrect; // 0x3a
	TArray ExcludedAutocorrectOS; // 0x40
	TArray ExcludedAutocorrectCultures; // 0x50
	TArray ExcludedAutocorrectDeviceModels; // 0x60
	EMouseCaptureMode DefaultViewportMouseCaptureMode; // 0x70
	EMouseLockMode DefaultViewportMouseLockMode; // 0x71
	float FOVScale; // 0x74
	float DoubleClickTime; // 0x78
	TArray ActionMappings; // 0x80
	TArray AxisMappings; // 0x90
	TArray SpeechMappings; // 0xa0
	SoftObjectPath DefaultTouchInterface; // 0xb0
	Key ConsoleKey; // 0xc8
	TArray ConsoleKeys; // 0xe0

	// Functions
	SaveKeyMappings 0x4a98c hash e3a19d5c params:(  );
	RemoveAxisMapping 0x4a982 hash 29e04914 params:( InputAxisKeyMapping KeyMapping;None bForceRebuildKeymaps; );
	RemoveActionMapping 0x4a977 hash 80dd50bd params:( InputActionKeyMapping KeyMapping;None bForceRebuildKeymaps; );
	GetInputSettings 0x4a96e hash 185b0ae6 params:( InputSettings ReturnValue; );
	GetAxisNames 0x4a967 hash 55921b6e params:( AxisNames AxisNames; );
	GetAxisMappingByName 0x4a95c hash f4eafb82 params:( None InAxisName;OutMappings OutMappings; );
	GetActionNames 0x4a954 hash 7cd10157 params:( ActionNames ActionNames; );
	GetActionMappingByName 0x4a948 hash d081ba6b params:( None InActionName;OutMappings OutMappings; );
	ForceRebuildKeymaps 0x4a93d hash e77f3695 params:(  );
	AddAxisMapping 0x4a935 hash f3b26e8f params:( InputAxisKeyMapping KeyMapping;None bForceRebuildKeymaps; );
	AddActionMapping 0x4a92c hash 7cec0f8 params:( InputActionKeyMapping KeyMapping;None bForceRebuildKeymaps; );
};


instance 1ab5e151180
class InputTouchDelegateBinding public : InputDelegateBinding
{
	// Fields
	TArray InputTouchDelegateBindings; // 0x28

};


instance 1ab5e150f40
class InputVectorAxisDelegateBinding public : InputAxisKeyDelegateBinding
{
	// Fields

};


instance 1ab5e150d00
class Interface_AssetUserData public : Interface
{
	// Fields

};


instance 1ab5e150ac0
class Interface_CollisionDataProvider public : Interface
{
	// Fields

};


instance 1ab5e150880
class Interface_PostProcessVolume public : Interface
{
	// Fields

};


instance 1ab5e150640
class Interface_PreviewMeshProvider public : Interface
{
	// Fields

};


instance 1ab5e150400
class InterpCurveEdSetup public : Object
{
	// Fields
	TArray Tabs; // 0x28
	int ActiveTab; // 0x38

};


instance 1ab5e1501c0
class InterpData public : Object
{
	// Fields
	float InterpLength; // 0x28
	float PathBuildTime; // 0x2c
	TArray InterpGroups; // 0x30
	InterpCurveEdSetup* CurveEdSetup; // 0x40
	float EdSectionStart; // 0x48
	float EdSectionEnd; // 0x4c
	bool bShouldBakeAndPrune; // 0x50
	InterpGroupDirector* CachedDirectorGroup; // 0x58
	TArray AllEventNames; // 0x60

};


instance 1ab5e159400
class InterpFilter public : Object
{
	// Fields
	FString Caption; // 0x28

};


instance 1ab5e1591c0
class InterpFilter_Classes public : InterpFilter
{
	// Fields

};


instance 1ab5e158f80
class InterpFilter_Custom public : InterpFilter
{
	// Fields

};


instance 1ab5e158d40
class InterpGroup public : Object
{
	// Fields
	TArray InterpTracks; // 0x30
	FName GroupName; // 0x40
	Color GroupColor; // 0x48
	bool bCollapsed; // 0x4c
	bool bVisible; // 0x4c
	bool bIsFolder; // 0x4c
	bool bIsParented; // 0x4c
	bool bIsSelected; // 0x4c

};


instance 1ab5e158b00
class InterpGroupCamera public : InterpGroup
{
	// Fields
	CameraAnim* CameraAnimInst; // 0x50
	float CompressTolerance; // 0x58

};


instance 1ab5e1588c0
class InterpGroupDirector public : InterpGroup
{
	// Fields

};


instance 1ab5e158680
class InterpGroupInst public : Object
{
	// Fields
	InterpGroup* Group; // 0x28
	Actor* GroupActor; // 0x30
	TArray TrackInst; // 0x38

};


instance 1ab5e158440
class InterpGroupInstCamera public : InterpGroupInst
{
	// Fields

};


instance 1ab5e158200
class InterpGroupInstDirector public : InterpGroupInst
{
	// Fields

};


instance 1ab5e157fc0
class InterpToMovementComponent public : MovementComponent
{
	// Fields
	float Duration; // 0xf0
	bool bPauseOnImpact; // 0xf4
	bool bSweep; // 0xf8
	ETeleportType TeleportType; // 0xf9
	EInterpToBehaviourType BehaviourType; // 0xfa
	bool bCheckIfStillInWorld; // 0xfb
	bool bForceSubStepping; // 0xfc
	MulticastInlineDelegateProperty OnInterpToReverse; // 0x100 property 0x1ab712f4b00 hash 0xb7a5ed1a
	MulticastInlineDelegateProperty OnInterpToStop; // 0x110 property 0x1ab712f4b80 hash 0xb7a5ed1a
	MulticastInlineDelegateProperty OnWaitBeginDelegate; // 0x120 property 0x1ab712f4c00 hash 0xb7a5ed1a
	MulticastInlineDelegateProperty OnWaitEndDelegate; // 0x130 property 0x1ab712f4c80 hash 0xb7a5ed1a
	MulticastInlineDelegateProperty OnResetDelegate; // 0x140 property 0x1ab712f4d00 hash 0xb7a5ed1a
	float MaxSimulationTimeStep; // 0x150
	int MaxSimulationIterations; // 0x154
	TArray ControlPoints; // 0x158
	DelegateFunction OnInterpToWaitEndDelegate__DelegateSignature; // 0x0 property 0x1ab71206600 hash 0x8ad2d5e6
	DelegateFunction OnInterpToWaitBeginDelegate__DelegateSignature; // 0x0 property 0x1ab712066e0 hash 0x8ad2d5e6
	DelegateFunction OnInterpToStopDelegate__DelegateSignature; // 0x0 property 0x1ab712067c0 hash 0x8ad2d5e6
	DelegateFunction OnInterpToReverseDelegate__DelegateSignature; // 0x0 property 0x1ab712068a0 hash 0x8ad2d5e6
	DelegateFunction OnInterpToResetDelegate__DelegateSignature; // 0x0 property 0x1ab71206980 hash 0x8ad2d5e6

	// Functions
	StopSimulating 0x4aa7e hash ab446608 params:( HitResult HitResult; );
	RestartMovement 0x4aa75 hash c47c7475 params:( None InitialDirection; );
	FinaliseControlPoints 0x4aa69 hash d6b7a30e params:(  );
};


instance 1ab5e157d80
class InterpTrack public : Object
{
	// Fields
	TArray SubTracks; // 0x38
	InterpTrackInst* TrackInstClass; // 0x48
	BYTE ActiveCondition; // 0x50
	FString TrackTitle; // 0x58
	bool bOnePerGroup; // 0x68
	bool bDirGroupOnly; // 0x68
	bool bDisableTrack; // 0x68
	bool bIsSelected; // 0x68
	bool bIsAnimControlTrack; // 0x68
	bool bSubTrackOnly; // 0x68
	bool bVisible; // 0x68
	bool bIsRecording; // 0x68

};


instance 1ab5e157900
class InterpTrackFloatBase public : InterpTrack
{
	// Fields
	InterpCurveFloat FloatTrack; // 0x70
	float CurveTension; // 0x88

};


instance 1ab5e157b40
class InterpTrackAnimControl public : InterpTrackFloatBase
{
	// Fields
	FName SlotName; // 0x90
	TArray AnimSeqs; // 0x98
	bool bSkipAnimNotifiers; // 0xa8

};


instance 1ab5e157480
class InterpTrackVectorBase public : InterpTrack
{
	// Fields
	InterpCurveVector VectorTrack; // 0x70
	float CurveTension; // 0x88

};


instance 1ab5e1576c0
class InterpTrackAudioMaster public : InterpTrackVectorBase
{
	// Fields

};


instance 1ab5e157240
class InterpTrackBoolProp public : InterpTrack
{
	// Fields
	TArray BoolTrack; // 0x70
	FName PropertyName; // 0x80

};


instance 1ab5e157000
class InterpTrackColorProp public : InterpTrackVectorBase
{
	// Fields
	FName PropertyName; // 0x90

};


instance 1ab5e156dc0
class InterpTrackColorScale public : InterpTrackVectorBase
{
	// Fields

};


instance 1ab5e156b80
class InterpTrackDirector public : InterpTrack
{
	// Fields
	TArray CutTrack; // 0x70
	bool bSimulateCameraCutsOnClients; // 0x80

};


instance 1ab5e156940
class InterpTrackEvent public : InterpTrack
{
	// Fields
	TArray EventTrack; // 0x70
	bool bFireEventsWhenForwards; // 0x80
	bool bFireEventsWhenBackwards; // 0x80
	bool bFireEventsWhenJumpingForwards; // 0x80
	bool bUseCustomEventName; // 0x80

};


instance 1ab5e156700
class InterpTrackFade public : InterpTrackFloatBase
{
	// Fields
	bool bPersistFade; // 0x90
	bool bFadeAudio; // 0x90
	LinearColor FadeColor; // 0x94

};


instance 1ab5e1564c0
class InterpTrackFloatAnimBPParam public : InterpTrackFloatBase
{
	// Fields
	Object* AnimBlueprintClass; // 0x90
	AnimInstance* AnimClass; // 0x98
	FName ParamName; // 0xa0

};


instance 1ab5e156280
class InterpTrackFloatMaterialParam public : InterpTrackFloatBase
{
	// Fields
	TArray TargetMaterials; // 0x90
	FName ParamName; // 0xa0

};


instance 1ab5e156040
class InterpTrackFloatParticleParam public : InterpTrackFloatBase
{
	// Fields
	FName ParamName; // 0x90

};


instance 1ab5e155e00
class InterpTrackFloatProp public : InterpTrackFloatBase
{
	// Fields
	FName PropertyName; // 0x90

};


instance 1ab5e155bc0
class InterpTrackInst public : Object
{
	// Fields

};


instance 1ab5e155980
class InterpTrackInstAnimControl public : InterpTrackInst
{
	// Fields
	float LastUpdatePosition; // 0x28

};


instance 1ab5e155740
class InterpTrackInstAudioMaster public : InterpTrackInst
{
	// Fields

};


instance 1ab5e1552c0
class InterpTrackInstProperty public : InterpTrackInst
{
	// Fields
	Property* InterpProperty; // 0x28
	Object* PropertyOuterObjectInst; // 0x30

};


instance 1ab5e155500
class InterpTrackInstBoolProp public : InterpTrackInstProperty
{
	// Fields
	BoolProperty* BoolProperty; // 0x40
	bool ResetBool; // 0x48

};


instance 1ab5e155080
class InterpTrackInstColorProp public : InterpTrackInstProperty
{
	// Fields
	Color ResetColor; // 0x40

};


instance 1ab5e154e40
class InterpTrackInstColorScale public : InterpTrackInst
{
	// Fields

};


instance 1ab5e154c00
class InterpTrackInstDirector public : InterpTrackInst
{
	// Fields
	Actor* OldViewTarget; // 0x28

};


instance 1ab5e15de40
class InterpTrackInstEvent public : InterpTrackInst
{
	// Fields
	float LastUpdatePosition; // 0x28

};


instance 1ab5e15dc00
class InterpTrackInstFade public : InterpTrackInst
{
	// Fields

};


instance 1ab5e15d9c0
class InterpTrackInstFloatAnimBPParam public : InterpTrackInst
{
	// Fields
	AnimInstance* AnimScriptInstance; // 0x28
	float ResetFloat; // 0x30

};


instance 1ab5e15d780
class InterpTrackInstFloatMaterialParam public : InterpTrackInst
{
	// Fields
	TArray MaterialInstances; // 0x28
	TArray ResetFloats; // 0x38
	TArray PrimitiveMaterialRefs; // 0x48
	InterpTrackFloatMaterialParam* InstancedTrack; // 0x58

};


instance 1ab5e15d540
class InterpTrackInstFloatParticleParam public : InterpTrackInst
{
	// Fields
	float ResetFloat; // 0x28

};


instance 1ab5e15d300
class InterpTrackInstFloatProp public : InterpTrackInstProperty
{
	// Fields
	float ResetFloat; // 0x40

};


instance 1ab5e15d0c0
class InterpTrackInstLinearColorProp public : InterpTrackInstProperty
{
	// Fields
	LinearColor ResetColor; // 0x40

};


instance 1ab5e15ce80
class InterpTrackInstMove public : InterpTrackInst
{
	// Fields
	Vector ResetLocation; // 0x28
	Rotator ResetRotation; // 0x34

};


instance 1ab5e15cc40
class InterpTrackInstParticleReplay public : InterpTrackInst
{
	// Fields
	float LastUpdatePosition; // 0x28

};


instance 1ab5e15ca00
class InterpTrackInstSlomo public : InterpTrackInst
{
	// Fields
	float OldTimeDilation; // 0x28

};


instance 1ab5e15c7c0
class InterpTrackInstSound public : InterpTrackInst
{
	// Fields
	float LastUpdatePosition; // 0x28
	AudioComponent* PlayAudioComp; // 0x30

};


instance 1ab5e15c580
class InterpTrackInstToggle public : InterpTrackInst
{
	// Fields
	BYTE Action; // 0x28
	float LastUpdatePosition; // 0x2c
	bool bSavedActiveState; // 0x30

};


instance 1ab5e15c340
class InterpTrackInstVectorMaterialParam public : InterpTrackInst
{
	// Fields
	TArray MaterialInstances; // 0x28
	TArray ResetVectors; // 0x38
	TArray PrimitiveMaterialRefs; // 0x48
	InterpTrackVectorMaterialParam* InstancedTrack; // 0x58

};


instance 1ab5e15c100
class InterpTrackInstVectorProp public : InterpTrackInstProperty
{
	// Fields
	Vector ResetVector; // 0x40

};


instance 1ab5e15bec0
class InterpTrackInstVisibility public : InterpTrackInst
{
	// Fields
	BYTE Action; // 0x28
	float LastUpdatePosition; // 0x2c

};


instance 1ab5e15bc80
class InterpTrackLinearColorBase public : InterpTrack
{
	// Fields
	InterpCurveLinearColor LinearColorTrack; // 0x70
	float CurveTension; // 0x88

};


instance 1ab5e15ba40
class InterpTrackLinearColorProp public : InterpTrackLinearColorBase
{
	// Fields
	FName PropertyName; // 0x90

};


instance 1ab5e15b800
class InterpTrackMove public : InterpTrack
{
	// Fields
	InterpCurveVector PosTrack; // 0x70
	InterpCurveVector EulerTrack; // 0x88
	InterpLookupTrack LookupTrack; // 0xa0
	FName LookAtGroupName; // 0xb0
	float LinCurveTension; // 0xb8
	float AngCurveTension; // 0xbc
	bool bUseQuatInterpolation; // 0xc0
	bool bShowArrowAtKeys; // 0xc0
	bool bDisableMovement; // 0xc0
	bool bShowTranslationOnCurveEd; // 0xc0
	bool bShowRotationOnCurveEd; // 0xc0
	bool bHide3DTrack; // 0xc0
	BYTE RotMode; // 0xc4

};


instance 1ab5e15b5c0
class InterpTrackMoveAxis public : InterpTrackFloatBase
{
	// Fields
	BYTE MoveAxis; // 0x90
	InterpLookupTrack LookupTrack; // 0x98

};


instance 1ab5e15b380
class InterpTrackParticleReplay public : InterpTrack
{
	// Fields
	TArray TrackKeys; // 0x70

};


instance 1ab5e15b140
class InterpTrackSlomo public : InterpTrackFloatBase
{
	// Fields

};


instance 1ab5e15af00
class InterpTrackSound public : InterpTrackVectorBase
{
	// Fields
	TArray Sounds; // 0x90
	bool bPlayOnReverse; // 0xa0
	bool bContinueSoundOnMatineeEnd; // 0xa0
	bool bSuppressSubtitles; // 0xa0
	bool bTreatAsDialogue; // 0xa0
	bool bAttach; // 0xa0

};


instance 1ab5e15acc0
class InterpTrackToggle public : InterpTrack
{
	// Fields
	TArray ToggleTrack; // 0x70
	bool bActivateSystemEachUpdate; // 0x80
	bool bActivateWithJustAttachedFlag; // 0x80
	bool bFireEventsWhenForwards; // 0x80
	bool bFireEventsWhenBackwards; // 0x80
	bool bFireEventsWhenJumpingForwards; // 0x80

};


instance 1ab5e15aa80
class InterpTrackVectorMaterialParam public : InterpTrackVectorBase
{
	// Fields
	TArray TargetMaterials; // 0x90
	FName ParamName; // 0xa0

};


instance 1ab5e15a840
class InterpTrackVectorProp public : InterpTrackVectorBase
{
	// Fields
	FName PropertyName; // 0x90

};


instance 1ab5e15a600
class InterpTrackVisibility public : InterpTrack
{
	// Fields
	TArray VisibilityTrack; // 0x70
	bool bFireEventsWhenForwards; // 0x80
	bool bFireEventsWhenBackwards; // 0x80
	bool bFireEventsWhenJumpingForwards; // 0x80

};


instance 1ab5e15a3c0
class IntSerialization public : Object
{
	// Fields
	USHORT UnsignedInt16Variable; // 0x28
	int UnsignedInt32Variable; // 0x2c
	ULONG64 UnsignedInt64Variable; // 0x30
	char SignedInt8Variable; // 0x38
	SHORT SignedInt16Variable; // 0x3a
	ULONG64 SignedInt64Variable; // 0x40
	BYTE UnsignedInt8Variable; // 0x48
	int SignedInt32Variable; // 0x4c

};


instance 1ab5e15a180
