instance 1ab7151c280
struct SolverBreakingFilterSettings 
{
	// Fields
	bool FilterEnabled; // 0x0
	float MinMass; // 0x4
	float MinSpeed; // 0x8
	float MinVolume; // 0xc

};


instance 1ab7151c1c0
struct SolverCollisionFilterSettings 
{
	// Fields
	bool FilterEnabled; // 0x0
	float MinMass; // 0x4
	float MinSpeed; // 0x8
	float MinImpulse; // 0xc

};


instance 1ab7151c100
struct SolverTrailingFilterSettings 
{
	// Fields
	bool FilterEnabled; // 0x0
	float MinMass; // 0x4
	float MinSpeed; // 0x8
	float MinVolume; // 0xc

};


