instance 1ab71459a00
struct LightPropagationVolumeSettings 
{
	// Fields
	bool bOverride_LPVIntensity; // 0x0
	bool bOverride_LPVDirectionalOcclusionIntensity; // 0x0
	bool bOverride_LPVDirectionalOcclusionRadius; // 0x0
	bool bOverride_LPVDiffuseOcclusionExponent; // 0x0
	bool bOverride_LPVSpecularOcclusionExponent; // 0x0
	bool bOverride_LPVDiffuseOcclusionIntensity; // 0x0
	bool bOverride_LPVSpecularOcclusionIntensity; // 0x0
	bool bOverride_LPVSize; // 0x0
	bool bOverride_LPVSecondaryOcclusionIntensity; // 0x1
	bool bOverride_LPVSecondaryBounceIntensity; // 0x1
	bool bOverride_LPVGeometryVolumeBias; // 0x1
	bool bOverride_LPVVplInjectionBias; // 0x1
	bool bOverride_LPVEmissiveInjectionIntensity; // 0x1
	float LPVIntensity; // 0x4
	float LPVVplInjectionBias; // 0x8
	float LPVSize; // 0xc
	float LPVSecondaryOcclusionIntensity; // 0x10
	float LPVSecondaryBounceIntensity; // 0x14
	float LPVGeometryVolumeBias; // 0x18
	float LPVEmissiveInjectionIntensity; // 0x1c
	float LPVDirectionalOcclusionIntensity; // 0x20
	float LPVDirectionalOcclusionRadius; // 0x24
	float LPVDiffuseOcclusionExponent; // 0x28
	float LPVSpecularOcclusionExponent; // 0x2c
	float LPVDiffuseOcclusionIntensity; // 0x30
	float LPVSpecularOcclusionIntensity; // 0x34
	float LPVFadeRange; // 0x38
	float LPVDirectionalOcclusionFadeRange; // 0x3c

};


